lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
#include "nrf54l15_hal.h"

#include <Arduino.h>
#include <string.h>
#include <cmsis.h>
#include "variant.h"

extern uint32_t SystemCoreClock;
extern "C" void nrf54l15_core_prepare_system_off_wake_timebase(void)
    __attribute__((weak));
extern "C" void nrf54l15_core_prepare_system_off(void) __attribute__((weak));
extern "C" void nrf54l15_core_disable_system_off_retention(void)
    __attribute__((weak));
namespace xiao_nrf54l15 {
class I2sTx;
class I2sRx;
class I2sDuplex;
}

namespace {

using namespace nrf54l15;
using namespace xiao_nrf54l15;

static constexpr uint16_t kSystemOffTimeoutLfclk = 5U;
static constexpr uint8_t kSystemOffWakeLeadLfclk = 4U;
static constexpr uint32_t kLfclkFrequencyHz = 32768UL;
static constexpr uint32_t kMaxCcLatchWaitUs = 77UL;
static constexpr uint32_t kSystemOffMinimumLatencyGuardUs = 1000UL;
static constexpr uint32_t kGrtcStartSettleUs = 93UL;
#if defined(ARDUINO_XIAO_NRF54L15)
static constexpr uint32_t kZephyrAllowedCcMaskXiao = 0x67UL;
static constexpr uint8_t kZephyrMainCcChannelXiao = 1U;
#endif
xiao_nrf54l15::I2sTx* g_activeI2sTx = nullptr;
xiao_nrf54l15::I2sRx* g_activeI2sRx = nullptr;
xiao_nrf54l15::I2sDuplex* g_activeI2sDuplex = nullptr;

uint32_t gpioBaseForPort(uint8_t port) {
  switch (port) {
    case 0:
      return GPIO_P0_BASE;
    case 1:
      return GPIO_P1_BASE;
    case 2:
      return GPIO_P2_BASE;
    default:
      return 0;
  }
}

bool waitForEvent(uint32_t base, uint32_t eventOffset, uint32_t spinLimit) {
  while (spinLimit-- > 0) {
    if (reg32(base + eventOffset) != 0U) {
      return true;
    }
  }
  return false;
}

bool waitForEventOrError(uint32_t base, uint32_t eventOffset,
                         uint32_t errorOffset, uint32_t spinLimit) {
  while (spinLimit-- > 0) {
    if (reg32(base + eventOffset) != 0U) {
      return true;
    }
    if (reg32(base + errorOffset) != 0U) {
      return false;
    }
  }
  return false;
}

void clearEvent(uint32_t base, uint32_t eventOffset) {
  reg32(base + eventOffset) = 0;
}

void clearSystemOffVprRetention() {
  if (MEMCONF_POWER_MaxCount > 1U) {
    NRF_MEMCONF->POWER[1U].RET &= ~MEMCONF_POWER_RET_MEM0_Msk;
  }
}

[[noreturn]] void enterSystemOff(NRF_RESET_Type* reset,
                                 NRF_REGULATORS_Type* regulators,
                                 bool disableRamRetention) {
  if (nrf54l15_core_prepare_system_off != nullptr) {
    nrf54l15_core_prepare_system_off();
  }
  clearSystemOffVprRetention();
  if (disableRamRetention &&
      nrf54l15_core_disable_system_off_retention != nullptr) {
    nrf54l15_core_disable_system_off_retention();
  }

  __asm volatile("cpsid i" ::: "memory");
  __asm volatile("dsb 0xF" ::: "memory");
  __asm volatile("isb 0xF" ::: "memory");
  reset->RESETREAS = 0xFFFFFFFFUL;
  __asm volatile("dsb 0xF" ::: "memory");

  regulators->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;
  __asm volatile("dsb 0xF" ::: "memory");
  while (true) {
    __asm volatile("wfe");
  }
}

bool waitForNonZero(volatile uint32_t* reg, uint32_t spinLimit) {
  if (reg == nullptr) {
    return false;
  }
  while (spinLimit-- > 0U) {
    if (*reg != 0U) {
      return true;
    }
  }
  return false;
}

uint8_t allocateHighestSetBit(uint32_t mask) {
  return static_cast<uint8_t>(31U - static_cast<uint32_t>(__builtin_clz(mask)));
}

uint32_t lfclkStatSource(NRF_CLOCK_Type* clock) {
  return (clock->LFCLK.STAT & CLOCK_LFCLK_STAT_SRC_Msk) >>
         CLOCK_LFCLK_STAT_SRC_Pos;
}

bool lfclkRunningFrom(NRF_CLOCK_Type* clock, uint32_t src) {
  if (clock == nullptr) {
    return false;
  }

  const uint32_t stat = clock->LFCLK.STAT;
  const bool running =
      ((stat & CLOCK_LFCLK_STAT_STATE_Msk) >> CLOCK_LFCLK_STAT_STATE_Pos) ==
      CLOCK_LFCLK_STAT_STATE_Running;
  return running && (lfclkStatSource(clock) == src);
}

bool waitForLfclkStarted(NRF_CLOCK_Type* clock, uint32_t expectedSrc,
                         uint32_t spinLimit) {
  if (clock == nullptr) {
    return false;
  }

  while (spinLimit-- > 0U) {
    if (clock->EVENTS_LFCLKSTARTED != 0U && lfclkRunningFrom(clock, expectedSrc)) {
      return true;
    }
  }
  return false;
}

void startLfclkSource(NRF_CLOCK_Type* clock, uint32_t src) {
  if (clock == nullptr) {
    return;
  }

  clock->EVENTS_LFCLKSTARTED = 0U;
  clock->LFCLK.SRC = (src << CLOCK_LFCLK_SRC_SRC_Pos) & CLOCK_LFCLK_SRC_SRC_Msk;
  __asm volatile("dsb 0xF" ::: "memory");
  clock->TASKS_LFCLKSTART = CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger;
}

bool lfclkStartAlreadyRequested(NRF_CLOCK_Type* clock, uint32_t src) {
  if (clock == nullptr) {
    return false;
  }

  const uint32_t run = (clock->LFCLK.RUN & CLOCK_LFCLK_RUN_STATUS_Msk) >>
                       CLOCK_LFCLK_RUN_STATUS_Pos;
  const uint32_t requestedSrc =
      (clock->LFCLK.SRCCOPY & CLOCK_LFCLK_SRCCOPY_SRC_Msk) >>
      CLOCK_LFCLK_SRCCOPY_SRC_Pos;
  return (run == CLOCK_LFCLK_RUN_STATUS_Triggered) && (requestedSrc == src);
}

bool grtcSyscounterReady(NRF_GRTC_Type* grtc) {
  if (grtc == nullptr) {
    return false;
  }

  (void)NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
  __asm volatile("dsb 0xF" ::: "memory");
  const uint32_t high = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;
  return ((high & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) >>
          GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Pos) ==
         GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Ready;
}

void busyWaitApproxUs(uint32_t us) {
  uint32_t cyclesPerUs = SystemCoreClock / 1000000UL;
  if (cyclesPerUs == 0U) {
    cyclesPerUs = 64U;
  }

  uint32_t iterations = cyclesPerUs * us;
  if (iterations == 0U) {
    iterations = 1U;
  }

  while (iterations-- > 0U) {
    __asm volatile("nop");
  }
}

void ensureGrtcReady(NRF_GRTC_Type* grtc) {
  if (grtc == nullptr) {
    return;
  }

  grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;
  __asm volatile("dsb 0xF" ::: "memory");
  delayMicroseconds(kGrtcStartSettleUs);

  const uint32_t active =
      NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE & GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk;
  const bool restoreActive =
      active == (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive
                 << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
  if (restoreActive) {
    NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
        (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    __asm volatile("dsb 0xF" ::: "memory");
  }

