lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  while (!grtcSyscounterReady(grtc)) {
    __asm volatile("nop");
  }

  if (restoreActive) {
    NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
        (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    __asm volatile("dsb 0xF" ::: "memory");
  }
}

uint64_t readGrtcCounter(NRF_GRTC_Type* grtc) {
  if (grtc == nullptr) {
    return 0U;
  }

  for (uint8_t i = 0; i < 32U; ++i) {
    const uint32_t hi0 = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;
    const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
    const uint32_t hi1 = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;

    if ((hi0 & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) != 0U ||
        (hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) != 0U ||
        (hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk) != 0U) {
      continue;
    }

    const uint32_t high0 = hi0 & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
    const uint32_t high1 = hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
    if (high0 != high1) {
      continue;
    }

    return (static_cast<uint64_t>(high1) << 32U) | static_cast<uint64_t>(lo);
  }

  const uint32_t hi = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH &
                      GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
  const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
  return (static_cast<uint64_t>(hi) << 32U) | static_cast<uint64_t>(lo);
}

void ensureLfxoRunning() {
  NRF_CLOCK_Type* const clock = NRF_CLOCK;

  if (lfclkRunningFrom(clock, CLOCK_LFCLK_STAT_SRC_LFXO)) {
    return;
  }

  static constexpr uint32_t kLfclkStartSpinLimit = 2000000UL;
  if (!lfclkStartAlreadyRequested(clock, CLOCK_LFCLK_SRCCOPY_SRC_LFXO)) {
    startLfclkSource(clock, CLOCK_LFCLK_SRC_SRC_LFXO);
  }
  if (!waitForLfclkStarted(clock, CLOCK_LFCLK_STAT_SRC_LFXO,
                           kLfclkStartSpinLimit)) {
    return;
  }
}

void waitForSystemOffWakeLatch() {
  const uint32_t waitUs =
      (static_cast<uint32_t>(kSystemOffTimeoutLfclk) * 1000000UL) /
          kLfclkFrequencyHz +
      kMaxCcLatchWaitUs;
  delayMicroseconds(waitUs);
}

uint8_t systemOffWakeChannel() {
#if defined(ARDUINO_XIAO_NRF54L15)
  const uint32_t available = kZephyrAllowedCcMaskXiao & ~(1UL << kZephyrMainCcChannelXiao);
  return allocateHighestSetBit(available);
#else
  return 1U;
#endif
}

uint32_t systemOffMinimumLatencyUs() {
  return ((((uint32_t)kSystemOffTimeoutLfclk +
            (uint32_t)kSystemOffWakeLeadLfclk) * 1000000UL) /
          kLfclkFrequencyHz) +
         kSystemOffMinimumLatencyGuardUs;
}

uint32_t clampSystemOffDelayUs(uint32_t delayUs) {
  const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
  if (delayUs < minimumLatencyUs) {
    return minimumLatencyUs;
  }
  return delayUs;
}

void configureSystemOffWakeSleep(NRF_GRTC_Type* grtc) {
  uint32_t mode = grtc->MODE;
  mode &= ~(GRTC_MODE_AUTOEN_Msk | GRTC_MODE_SYSCOUNTEREN_Msk);
  mode |= (GRTC_MODE_AUTOEN_Default << GRTC_MODE_AUTOEN_Pos);
  mode |= (GRTC_MODE_SYSCOUNTEREN_Disabled << GRTC_MODE_SYSCOUNTEREN_Pos);
  grtc->MODE = mode;
  __asm volatile("dsb 0xF" ::: "memory");

  uint32_t clkcfg = grtc->CLKCFG;
  clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
  clkcfg |= (GRTC_CLKCFG_CLKSEL_LFXO << GRTC_CLKCFG_CLKSEL_Pos);
  grtc->CLKCFG = clkcfg;

  grtc->TIMEOUT = ((static_cast<uint32_t>(kSystemOffTimeoutLfclk)
                    << GRTC_TIMEOUT_VALUE_Pos) &
                   GRTC_TIMEOUT_VALUE_Msk);
  grtc->WAKETIME = ((static_cast<uint32_t>(kSystemOffWakeLeadLfclk)
                     << GRTC_WAKETIME_VALUE_Pos) &
                    GRTC_WAKETIME_VALUE_Msk);

  mode &= ~GRTC_MODE_SYSCOUNTEREN_Msk;
  mode |= (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
  grtc->MODE = mode;
  __asm volatile("dsb 0xF" ::: "memory");
}

void armSystemOffWakeCompare(NRF_GRTC_Type* grtc, uint8_t wakeChannel,
                             uint64_t wakeTimestamp) {
  grtc->EVENTS_COMPARE[wakeChannel] = 0U;
  grtc->CC[wakeChannel].CCEN =
      (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
  grtc->CC[wakeChannel].CCL =
      static_cast<uint32_t>(wakeTimestamp & 0xFFFFFFFFULL);
  grtc->CC[wakeChannel].CCH =
      (static_cast<uint32_t>((wakeTimestamp >> 32U) & 0xFFFFFUL)
       << GRTC_CC_CCH_CCH_Pos) &
      GRTC_CC_CCH_CCH_Msk;
  NRF54L15_GRTC_INTENSET_REG(grtc) = (1UL << wakeChannel);
  grtc->CC[wakeChannel].CCEN =
      (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
}

void programSystemOffWake(uint32_t delayUs) {
  delayUs = clampSystemOffDelayUs(delayUs);

  NRF_GRTC_Type* const grtc = NRF_GRTC;
  if (nrf54l15_core_prepare_system_off_wake_timebase != nullptr) {
    nrf54l15_core_prepare_system_off_wake_timebase();
  }
  ensureLfxoRunning();
  configureSystemOffWakeSleep(grtc);

  const uint8_t wakeChannel = systemOffWakeChannel();

  for (uint8_t channel = 0; channel < GRTC_CC_MaxCount; ++channel) {
    NRF54L15_GRTC_INTENCLR_REG(grtc) = (1UL << channel);
    if (channel != wakeChannel) {
      grtc->CC[channel].CCEN =
          (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    }
  }

  ensureGrtcReady(grtc);
  const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
  uint32_t wakeDelayUs = delayUs;

  for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
    const uint64_t wakeTimestamp = readGrtcCounter(grtc) + wakeDelayUs;
    armSystemOffWakeCompare(grtc, wakeChannel, wakeTimestamp);
    waitForSystemOffWakeLatch();

    if (grtc->EVENTS_COMPARE[wakeChannel] == 0U) {
      return;
    }

    const uint64_t now = readGrtcCounter(grtc);
    if (wakeTimestamp > now) {
      grtc->EVENTS_COMPARE[wakeChannel] = 0U;
      return;
    }

    wakeDelayUs += minimumLatencyUs;
  }
}

double adcGainValue(xiao_nrf54l15::AdcGain gain) {
  using xiao_nrf54l15::AdcGain;
  switch (gain) {
    case AdcGain::k2:
      return 2.0;
    case AdcGain::k1:
      return 1.0;
    case AdcGain::k2over3:
      return 2.0 / 3.0;
    case AdcGain::k2over4:
      return 2.0 / 4.0;
    case AdcGain::k2over5:
      return 2.0 / 5.0;
    case AdcGain::k2over6:
      return 2.0 / 6.0;
    case AdcGain::k2over7:
      return 2.0 / 7.0;
    case AdcGain::k2over8:
    default:
      return 2.0 / 8.0;
  }
}

