lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  const bool alreadyRunning =
      (((clock->XO.STAT & CLOCK_XO_STAT_STATE_Msk) >> CLOCK_XO_STAT_STATE_Pos) ==
       CLOCK_XO_STAT_STATE_Running);
  if (alreadyRunning) {
    return true;
  }

  clock->EVENTS_XOSTARTED = 0U;
  clock->EVENTS_XOTUNED = 0U;
  clock->EVENTS_XOTUNEFAILED = 0U;
  clock->TASKS_XOSTART = CLOCK_TASKS_XOSTART_TASKS_XOSTART_Trigger;

  if (!waitForTuned) {
    return true;
  }

  if (spinLimit == 0U) {
    spinLimit = 1000000UL;
  }

  while (spinLimit-- > 0U) {
    const bool running =
        (((clock->XO.STAT & CLOCK_XO_STAT_STATE_Msk) >> CLOCK_XO_STAT_STATE_Pos) ==
         CLOCK_XO_STAT_STATE_Running);
    if (running || (clock->EVENTS_XOSTARTED != 0U) || (clock->EVENTS_XOTUNED != 0U)) {
      return true;
    }
    if (clock->EVENTS_XOTUNEFAILED != 0U) {
      return false;
    }
  }

  return (((clock->XO.STAT & CLOCK_XO_STAT_STATE_Msk) >> CLOCK_XO_STAT_STATE_Pos) ==
          CLOCK_XO_STAT_STATE_Running);
}

void ClockControl::stopHfxo() {
  auto* clock =
      reinterpret_cast<NRF_CLOCK_Type*>(static_cast<uintptr_t>(nrf54l15::CLOCK_BASE));
  if (clock == nullptr) {
    return;
  }
  clock->TASKS_XOSTOP = CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Trigger;
}

bool ClockControl::setCpuFrequency(CpuFrequency frequency) {
  return nrf54l15_core_set_cpu_frequency_hz(static_cast<uint32_t>(frequency));
}

CpuFrequency ClockControl::cpuFrequency() {
  return (nrf54l15_core_get_cpu_frequency_hz() >=
          static_cast<uint32_t>(CpuFrequency::k128MHz))
             ? CpuFrequency::k128MHz
             : CpuFrequency::k64MHz;
}

bool ClockControl::enableIdleCpuScaling(CpuFrequency idleFrequency) {
  return nrf54l15_core_set_idle_cpu_scaling_hz(
      static_cast<uint32_t>(idleFrequency), true);
}

void ClockControl::disableIdleCpuScaling() {
  (void)nrf54l15_core_set_idle_cpu_scaling_hz(0UL, false);
}

bool ClockControl::idleCpuScalingEnabled() {
  return nrf54l15_core_get_idle_cpu_scaling_enabled();
}

CpuFrequency ClockControl::idleCpuFrequency() {
  return (nrf54l15_core_get_idle_cpu_frequency_hz() >=
          static_cast<uint32_t>(CpuFrequency::k128MHz))
             ? CpuFrequency::k128MHz
             : CpuFrequency::k64MHz;
}

bool Gpio::configure(const Pin& pin, GpioDirection direction, GpioPull pull) {
  if (!isConnected(pin)) {
    return false;
  }

  const uint32_t base = gpioBaseForPort(pin.port);
  if (base == 0U) {
    return false;
  }

  const uint32_t bit = (1UL << pin.pin);
  const uint32_t cnfAddr = base + gpio::PIN_CNF +
                           (static_cast<uint32_t>(pin.pin) * sizeof(uint32_t));

  uint32_t cnf = reg32(cnfAddr);
  cnf &= ~(gpio::PIN_CNF_DIR_Msk | gpio::PIN_CNF_INPUT_Msk |
           gpio::PIN_CNF_PULL_Msk);

  if (direction == GpioDirection::kOutput) {
    cnf |= gpio::PIN_CNF_DIR_Msk;
    // Disconnect input buffer while pin is output.
    cnf |= gpio::PIN_CNF_INPUT_Msk;
    reg32(base + gpio::DIRSET) = bit;
  } else {
    // Input buffer connected for reads.
    cnf &= ~gpio::PIN_CNF_INPUT_Msk;
    reg32(base + gpio::DIRCLR) = bit;
  }

  cnf |= ((static_cast<uint32_t>(pull) << gpio::PIN_CNF_PULL_Pos) &
          gpio::PIN_CNF_PULL_Msk);

  reg32(cnfAddr) = cnf;
  return true;
}

bool Gpio::write(const Pin& pin, bool high) {
  if (!isConnected(pin)) {
    return false;
  }

  const uint32_t base = gpioBaseForPort(pin.port);
  if (base == 0U) {
    return false;
  }

  const uint32_t bit = (1UL << pin.pin);
  reg32(base + (high ? gpio::OUTSET : gpio::OUTCLR)) = bit;
  return true;
}

bool Gpio::read(const Pin& pin, bool* high) {
  if (!isConnected(pin) || high == nullptr) {
    return false;
  }

  const uint32_t base = gpioBaseForPort(pin.port);
  if (base == 0U) {
    return false;
  }

  const uint32_t bit = (1UL << pin.pin);
  *high = (reg32(base + gpio::IN) & bit) != 0U;
  return true;
}

bool Gpio::toggle(const Pin& pin) {
  bool state = false;
  if (!read(pin, &state)) {
    return false;
  }
  return write(pin, !state);
}

bool Gpio::setDriveS0D1(const Pin& pin) {
  if (!isConnected(pin)) {
    return false;
  }

  const uint32_t base = gpioBaseForPort(pin.port);
  if (base == 0U) {
    return false;
  }

  const uint32_t cnfAddr = base + gpio::PIN_CNF +
                           (static_cast<uint32_t>(pin.pin) * sizeof(uint32_t));
  uint32_t cnf = reg32(cnfAddr);

  cnf &= ~(gpio::PIN_CNF_DRIVE0_Msk | gpio::PIN_CNF_DRIVE1_Msk);
  cnf |= (gpio::DRIVE0_S0 << gpio::PIN_CNF_DRIVE0_Pos);
  cnf |= (gpio::DRIVE1_D1 << gpio::PIN_CNF_DRIVE1_Pos);

  reg32(cnfAddr) = cnf;
  return true;
}

Spim::Spim(uint32_t base, uint32_t coreClockHz)
    : base_(base), coreClockHz_(coreClockHz), cs_(kPinDisconnected) {}

bool Spim::begin(const Pin& sck, const Pin& mosi, const Pin& miso,
                 const Pin& cs, uint32_t hz, SpiMode mode, bool lsbFirst) {
  if (!isConnected(sck) || !isConnected(mosi) || !isConnected(miso)) {
    return false;
  }

  cs_ = cs;

  if (!Gpio::configure(sck, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(mosi, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(miso, GpioDirection::kInput, GpioPull::kDisabled)) {
    return false;
  }

  if (isConnected(cs_) &&
      (!Gpio::configure(cs_, GpioDirection::kOutput, GpioPull::kDisabled) ||
       !Gpio::write(cs_, true))) {
    return false;
  }

  reg32(base_ + spim::ENABLE) = spim::ENABLE_DISABLED;

  reg32(base_ + spim::PSEL_SCK) = make_psel(sck.port, sck.pin);
  reg32(base_ + spim::PSEL_MOSI) = make_psel(mosi.port, mosi.pin);
  reg32(base_ + spim::PSEL_MISO) = make_psel(miso.port, miso.pin);
  reg32(base_ + spim::PSEL_DCX) = PSEL_DISCONNECTED;
  reg32(base_ + spim::PSEL_CSN) = PSEL_DISCONNECTED;

  if (!setFrequency(hz)) {
    return false;
  }

  uint32_t config = 0;
  if (lsbFirst) {
    config |= spim::CONFIG_ORDER_LSB_FIRST;
  }

  if (mode == SpiMode::kMode1 || mode == SpiMode::kMode3) {
    config |= spim::CONFIG_CPHA_TRAILING;
  }
  if (mode == SpiMode::kMode2 || mode == SpiMode::kMode3) {
    config |= spim::CONFIG_CPOL_ACTIVE_LOW;
  }

  reg32(base_ + spim::CONFIG) = config;
  reg32(base_ + spim::ORC) = 0xFF;
  reg32(base_ + spim::ENABLE) = spim::ENABLE_ENABLED;

