lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  return true;
}

bool Spim::setFrequency(uint32_t hz) {
  if (base_ == 0U) {
    return false;
  }
  const uint32_t minDivisor = (base_ == SPIM00_BASE) ? 4U : 2U;
  reg32(base_ + spim::PRESCALER) = spimPrescaler(coreClockHz_, hz, minDivisor);
  return true;
}

void Spim::end() {
  reg32(base_ + spim::ENABLE) = spim::ENABLE_DISABLED;
  reg32(base_ + spim::PSEL_SCK) = PSEL_DISCONNECTED;
  reg32(base_ + spim::PSEL_MOSI) = PSEL_DISCONNECTED;
  reg32(base_ + spim::PSEL_MISO) = PSEL_DISCONNECTED;
  reg32(base_ + spim::PSEL_CSN) = PSEL_DISCONNECTED;
}

bool Spim::transfer(const uint8_t* tx, uint8_t* rx, size_t len,
                    uint32_t spinLimit) {
  if (len == 0U) {
    return true;
  }
  if (len > 0xFFFFU) {
    return false;
  }

  uint8_t txFallback = 0xFF;
  uint8_t rxFallback = 0;

  const uint8_t* txPtr = (tx != nullptr) ? tx : &txFallback;
  uint8_t* rxPtr = (rx != nullptr) ? rx : &rxFallback;

  const uint32_t txLen = (tx != nullptr) ? static_cast<uint32_t>(len) : 0U;
  const uint32_t rxLen = (rx != nullptr) ? static_cast<uint32_t>(len) : 0U;

  clearEvent(base_, spim::EVENTS_STARTED);
  clearEvent(base_, spim::EVENTS_END);
  clearEvent(base_, spim::EVENTS_STOPPED);

  reg32(base_ + spim::DMA_TX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(txPtr));
  reg32(base_ + spim::DMA_TX_MAXCNT) = txLen;

  reg32(base_ + spim::DMA_RX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(rxPtr));
  reg32(base_ + spim::DMA_RX_MAXCNT) = rxLen;

  if (isConnected(cs_)) {
    Gpio::write(cs_, false);
  }

  reg32(base_ + spim::TASKS_START) = 1;
  const bool endOk = waitForEvent(base_, spim::EVENTS_END, spinLimit);

  reg32(base_ + spim::TASKS_STOP) = 1;
  const bool stopOk = waitForEvent(base_, spim::EVENTS_STOPPED, spinLimit);

  if (isConnected(cs_)) {
    Gpio::write(cs_, true);
  }

  return endOk && stopOk;
}

Spis::Spis(uint32_t base)
    : spis_(reinterpret_cast<NRF_SPIS_Type*>(static_cast<uintptr_t>(base))),
      active_(false) {}

bool Spis::begin(const Pin& sck, const Pin& mosi, const Pin& miso,
                 const Pin& csn, SpiMode mode, bool lsbFirst,
                 uint8_t defaultChar, uint8_t overReadChar,
                 bool autoAcquireAfterEnd) {
  if (!isConnected(sck) || !isConnected(mosi) || !isConnected(miso) ||
      !isConnected(csn)) {
    return false;
  }

  if (!Gpio::configure(sck, GpioDirection::kInput, GpioPull::kDisabled) ||
      !Gpio::configure(mosi, GpioDirection::kInput, GpioPull::kDisabled) ||
      !Gpio::configure(miso, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(csn, GpioDirection::kInput, GpioPull::kPullUp) ||
      !Gpio::write(miso, true)) {
    return false;
  }

  spis_->ENABLE = (SPIS_ENABLE_ENABLE_Disabled << SPIS_ENABLE_ENABLE_Pos);
  spis_->PSEL.SCK = make_psel(sck.port, sck.pin);
  spis_->PSEL.MOSI = make_psel(mosi.port, mosi.pin);
  spis_->PSEL.MISO = make_psel(miso.port, miso.pin);
  spis_->PSEL.CSN = make_psel(csn.port, csn.pin);

  uint32_t config = 0U;
  if (lsbFirst) {
    config |= (SPIS_CONFIG_ORDER_LsbFirst << SPIS_CONFIG_ORDER_Pos) &
              SPIS_CONFIG_ORDER_Msk;
  }
  if (mode == SpiMode::kMode1 || mode == SpiMode::kMode3) {
    config |= (SPIS_CONFIG_CPHA_Trailing << SPIS_CONFIG_CPHA_Pos) &
              SPIS_CONFIG_CPHA_Msk;
  }
  if (mode == SpiMode::kMode2 || mode == SpiMode::kMode3) {
    config |= (SPIS_CONFIG_CPOL_ActiveLow << SPIS_CONFIG_CPOL_Pos) &
              SPIS_CONFIG_CPOL_Msk;
  }

  spis_->CONFIG = config;
  spis_->DEF = ((static_cast<uint32_t>(defaultChar) << SPIS_DEF_DEF_Pos) &
                SPIS_DEF_DEF_Msk);
  spis_->ORC = ((static_cast<uint32_t>(overReadChar) << SPIS_ORC_ORC_Pos) &
                SPIS_ORC_ORC_Msk);
  spis_->SHORTS =
      autoAcquireAfterEnd
          ? ((SPIS_SHORTS_END_ACQUIRE_Enabled << SPIS_SHORTS_END_ACQUIRE_Pos) &
             SPIS_SHORTS_END_ACQUIRE_Msk)
          : 0U;
  spis_->INTENCLR = 0xFFFFFFFFUL;
  spis_->EVENTS_END = 0U;
  spis_->EVENTS_ACQUIRED = 0U;
  spis_->EVENTS_DMA.RX.END = 0U;
  spis_->EVENTS_DMA.TX.END = 0U;

  spis_->ENABLE = ((SPIS_ENABLE_ENABLE_Enabled << SPIS_ENABLE_ENABLE_Pos) &
                   SPIS_ENABLE_ENABLE_Msk);
  active_ = true;
  clearStatus();
  return true;
}

bool Spis::acquire(uint32_t spinLimit) {
  if (!active_) {
    return false;
  }
  if ((spis_->SEMSTAT & SPIS_SEMSTAT_SEMSTAT_Msk) ==
      (SPIS_SEMSTAT_SEMSTAT_CPU << SPIS_SEMSTAT_SEMSTAT_Pos)) {
    return true;
  }

  spis_->EVENTS_ACQUIRED = 0U;
  spis_->TASKS_ACQUIRE = SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger;
  while (spinLimit-- > 0U) {
    if ((spis_->SEMSTAT & SPIS_SEMSTAT_SEMSTAT_Msk) ==
        (SPIS_SEMSTAT_SEMSTAT_CPU << SPIS_SEMSTAT_SEMSTAT_Pos)) {
      return true;
    }
    if (spis_->EVENTS_ACQUIRED != 0U) {
      spis_->EVENTS_ACQUIRED = 0U;
      return true;
    }
  }

  return (spis_->SEMSTAT & SPIS_SEMSTAT_SEMSTAT_Msk) ==
         (SPIS_SEMSTAT_SEMSTAT_CPU << SPIS_SEMSTAT_SEMSTAT_Pos);
}

bool Spis::setBuffers(uint8_t* rx, size_t rxLen, const uint8_t* tx, size_t txLen,
                      uint32_t spinLimit) {
  if (!active_ || rx == nullptr || tx == nullptr || rxLen == 0U || txLen == 0U ||
      rxLen > 0xFFFFU || txLen > 0xFFFFU) {
    return false;
  }
  if (!acquire(spinLimit)) {
    return false;
  }

  spis_->DMA.RX.PTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(rx));
  spis_->DMA.RX.MAXCNT =
      (static_cast<uint32_t>(rxLen) << SPIS_DMA_RX_MAXCNT_MAXCNT_Pos) &
      SPIS_DMA_RX_MAXCNT_MAXCNT_Msk;
  spis_->DMA.TX.PTR = static_cast<uint32_t>(
      reinterpret_cast<uintptr_t>(const_cast<uint8_t*>(tx)));
  spis_->DMA.TX.MAXCNT =
      (static_cast<uint32_t>(txLen) << SPIS_DMA_TX_MAXCNT_MAXCNT_Pos) &
      SPIS_DMA_TX_MAXCNT_MAXCNT_Msk;

  spis_->EVENTS_END = 0U;
  spis_->EVENTS_DMA.RX.END = 0U;
  spis_->EVENTS_DMA.TX.END = 0U;
  clearStatus();
  return true;
}

bool Spis::releaseTransaction() {
  if (!active_) {
    return false;
  }
  spis_->TASKS_RELEASE = SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger;
  return true;
}

bool Spis::pollAcquired(bool clearEventFlag) {
  const bool fired = active_ && (spis_->EVENTS_ACQUIRED != 0U);
  if (fired && clearEventFlag) {
    spis_->EVENTS_ACQUIRED = 0U;
  }
  return fired;
}

