lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
bool Spis::pollEnd(bool clearEventFlag) {
  const bool fired = active_ && (spis_->EVENTS_END != 0U);
  if (fired && clearEventFlag) {
    spis_->EVENTS_END = 0U;
  }
  return fired;
}

size_t Spis::receivedBytes() const {
  if (!active_) {
    return 0U;
  }
  return static_cast<size_t>((spis_->DMA.RX.AMOUNT & SPIS_DMA_RX_AMOUNT_AMOUNT_Msk) >>
                             SPIS_DMA_RX_AMOUNT_AMOUNT_Pos);
}

size_t Spis::transmittedBytes() const {
  if (!active_) {
    return 0U;
  }
  return static_cast<size_t>((spis_->DMA.TX.AMOUNT & SPIS_DMA_TX_AMOUNT_AMOUNT_Msk) >>
                             SPIS_DMA_TX_AMOUNT_AMOUNT_Pos);
}

bool Spis::overflowed() const {
  return active_ && ((spis_->STATUS & SPIS_STATUS_OVERFLOW_Msk) != 0U);
}

bool Spis::overread() const {
  return active_ && ((spis_->STATUS & SPIS_STATUS_OVERREAD_Msk) != 0U);
}

void Spis::clearStatus() {
  if (spis_ == nullptr) {
    return;
  }
  spis_->STATUS = SPIS_STATUS_OVERREAD_Clear | SPIS_STATUS_OVERFLOW_Clear;
}

void Spis::end() {
  if (spis_ == nullptr) {
    return;
  }

  spis_->SHORTS = 0U;
  spis_->ENABLE = (SPIS_ENABLE_ENABLE_Disabled << SPIS_ENABLE_ENABLE_Pos);
  spis_->PSEL.SCK = PSEL_DISCONNECTED;
  spis_->PSEL.MOSI = PSEL_DISCONNECTED;
  spis_->PSEL.MISO = PSEL_DISCONNECTED;
  spis_->PSEL.CSN = PSEL_DISCONNECTED;
  active_ = false;
}

Twim::Twim(uint32_t base) : base_(base) {}

bool Twim::begin(const Pin& scl, const Pin& sda, TwimFrequency frequency) {
  if (!isConnected(scl) || !isConnected(sda)) {
    return false;
  }

  // Per datasheet, configure SCL/SDA for input and S0D1 drive before enabling TWIM.
  if (!Gpio::configure(scl, GpioDirection::kInput, GpioPull::kDisabled) ||
      !Gpio::configure(sda, GpioDirection::kInput, GpioPull::kDisabled) ||
      !Gpio::setDriveS0D1(scl) || !Gpio::setDriveS0D1(sda)) {
    return false;
  }

  reg32(base_ + twim::ENABLE) = twim::ENABLE_DISABLED;

  reg32(base_ + twim::PSEL_SCL) = make_psel(scl.port, scl.pin);
  reg32(base_ + twim::PSEL_SDA) = make_psel(sda.port, sda.pin);
  if (!setFrequency(frequency)) {
    return false;
  }

  reg32(base_ + twim::ENABLE) = twim::ENABLE_ENABLED;
  return true;
}

bool Twim::setFrequency(TwimFrequency frequency) {
  if (base_ == 0U) {
    return false;
  }
  reg32(base_ + twim::FREQUENCY) = static_cast<uint32_t>(frequency);
  return true;
}

void Twim::end() {
  reg32(base_ + twim::ENABLE) = twim::ENABLE_DISABLED;
  reg32(base_ + twim::PSEL_SCL) = PSEL_DISCONNECTED;
  reg32(base_ + twim::PSEL_SDA) = PSEL_DISCONNECTED;
}

bool Twim::write(uint8_t address7, const uint8_t* data, size_t len,
                 uint32_t spinLimit) {
  if (len > 0xFFFFU) {
    return false;
  }

  uint8_t dummy = 0;
  const uint8_t* tx = (data != nullptr) ? data : &dummy;

  clearTwimState(base_);
  reg32(base_ + twim::ADDRESS) = (address7 & 0x7FU);

  reg32(base_ + twim::DMA_TX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(tx));
  reg32(base_ + twim::DMA_TX_MAXCNT) = static_cast<uint32_t>(len);

  reg32(base_ + twim::TASKS_DMA_TX_START) = 1;
  const uint32_t doneEvent = (len > 0U) ? twim::EVENTS_LASTTX
                                        : twim::EVENTS_DMA_TX_END;
  const bool writeOk = waitForEventOrError(base_, doneEvent, twim::EVENTS_ERROR,
                                           spinLimit);

  reg32(base_ + twim::TASKS_STOP) = 1;
  const bool stopOk = waitForEvent(base_, twim::EVENTS_STOPPED, spinLimit);

  const bool hadError = (reg32(base_ + twim::EVENTS_ERROR) != 0U);
  reg32(base_ + twim::ERRORSRC) = twim::ERRORSRC_ALL;

  return writeOk && stopOk && !hadError;
}

bool Twim::read(uint8_t address7, uint8_t* data, size_t len,
                uint32_t spinLimit) {
  if (data == nullptr || len == 0U || len > 0xFFFFU) {
    return false;
  }

  clearTwimState(base_);
  reg32(base_ + twim::ADDRESS) = (address7 & 0x7FU);

  reg32(base_ + twim::DMA_RX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(data));
  reg32(base_ + twim::DMA_RX_MAXCNT) = static_cast<uint32_t>(len);

  reg32(base_ + twim::TASKS_DMA_RX_START) = 1;
  const bool readOk = waitForEventOrError(base_, twim::EVENTS_LASTRX,
                                          twim::EVENTS_ERROR, spinLimit);

  reg32(base_ + twim::TASKS_STOP) = 1;
  const bool stopOk = waitForEvent(base_, twim::EVENTS_STOPPED, spinLimit);

  const bool hadError = (reg32(base_ + twim::EVENTS_ERROR) != 0U);
  reg32(base_ + twim::ERRORSRC) = twim::ERRORSRC_ALL;

  return readOk && stopOk && !hadError;
}

bool Twim::writeRead(uint8_t address7, const uint8_t* tx, size_t txLen,
                     uint8_t* rx, size_t rxLen, uint32_t spinLimit) {
  if (txLen == 0U) {
    return read(address7, rx, rxLen, spinLimit);
  }
  if (rxLen == 0U) {
    return write(address7, tx, txLen, spinLimit);
  }
  if (tx == nullptr || rx == nullptr || txLen > 0xFFFFU || rxLen > 0xFFFFU) {
    return false;
  }

  clearTwimState(base_);
  reg32(base_ + twim::ADDRESS) = (address7 & 0x7FU);

  reg32(base_ + twim::DMA_TX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(tx));
  reg32(base_ + twim::DMA_TX_MAXCNT) = static_cast<uint32_t>(txLen);

  reg32(base_ + twim::DMA_RX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(rx));
  reg32(base_ + twim::DMA_RX_MAXCNT) = static_cast<uint32_t>(rxLen);

  reg32(base_ + twim::TASKS_DMA_TX_START) = 1;
  const bool writePhaseOk = waitForEventOrError(base_, twim::EVENTS_LASTTX,
                                                 twim::EVENTS_ERROR, spinLimit);

  if (!writePhaseOk) {
    reg32(base_ + twim::TASKS_STOP) = 1;
    waitForEvent(base_, twim::EVENTS_STOPPED, spinLimit);
    reg32(base_ + twim::ERRORSRC) = twim::ERRORSRC_ALL;
    return false;
  }

  reg32(base_ + twim::TASKS_DMA_RX_START) = 1;
  const bool readPhaseOk = waitForEventOrError(base_, twim::EVENTS_LASTRX,
                                                twim::EVENTS_ERROR, spinLimit);

  reg32(base_ + twim::TASKS_STOP) = 1;
  const bool stopOk = waitForEvent(base_, twim::EVENTS_STOPPED, spinLimit);

