lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  const bool hadError = (reg32(base_ + twim::EVENTS_ERROR) != 0U);
  reg32(base_ + twim::ERRORSRC) = twim::ERRORSRC_ALL;

  return writePhaseOk && readPhaseOk && stopOk && !hadError;
}

Uarte::Uarte(uint32_t base) : base_(base) {}

bool Uarte::begin(const Pin& txd, const Pin& rxd, UarteBaud baud,
                  bool hwFlowControl, const Pin& cts, const Pin& rts) {
  if (!isConnected(txd) || !isConnected(rxd)) {
    return false;
  }
  if (hwFlowControl && (!isConnected(cts) || !isConnected(rts))) {
    return false;
  }

  if (!Gpio::configure(txd, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(rxd, GpioDirection::kInput, GpioPull::kDisabled)) {
    return false;
  }
  Gpio::write(txd, true);

  if (hwFlowControl) {
    if (!Gpio::configure(cts, GpioDirection::kInput, GpioPull::kDisabled) ||
        !Gpio::configure(rts, GpioDirection::kOutput, GpioPull::kDisabled)) {
      return false;
    }
    Gpio::write(rts, true);
  }

  reg32(base_ + uarte::ENABLE) = uarte::ENABLE_DISABLED;

  reg32(base_ + uarte::PSEL_TXD) = make_psel(txd.port, txd.pin);
  reg32(base_ + uarte::PSEL_RXD) = make_psel(rxd.port, rxd.pin);
  reg32(base_ + uarte::PSEL_CTS) =
      hwFlowControl ? make_psel(cts.port, cts.pin) : PSEL_DISCONNECTED;
  reg32(base_ + uarte::PSEL_RTS) =
      hwFlowControl ? make_psel(rts.port, rts.pin) : PSEL_DISCONNECTED;

  uint32_t config = reg32(base_ + uarte::CONFIG);
  if (hwFlowControl) {
    config |= uarte::CONFIG_HWFC_Msk;
  } else {
    config &= ~uarte::CONFIG_HWFC_Msk;
  }
  reg32(base_ + uarte::CONFIG) = config;

  reg32(base_ + uarte::BAUDRATE) = static_cast<uint32_t>(baud);
  reg32(base_ + uarte::ENABLE) = uarte::ENABLE_ENABLED;

  return true;
}

void Uarte::end() {
  reg32(base_ + uarte::ENABLE) = uarte::ENABLE_DISABLED;
  reg32(base_ + uarte::PSEL_TXD) = PSEL_DISCONNECTED;
  reg32(base_ + uarte::PSEL_RXD) = PSEL_DISCONNECTED;
  reg32(base_ + uarte::PSEL_CTS) = PSEL_DISCONNECTED;
  reg32(base_ + uarte::PSEL_RTS) = PSEL_DISCONNECTED;
}

bool Uarte::write(const uint8_t* data, size_t len, uint32_t spinLimit) {
  if (data == nullptr) {
    return false;
  }
  if (len == 0U) {
    return true;
  }
  if (len > 0xFFFFU) {
    return false;
  }

  clearEvent(base_, uarte::EVENTS_DMA_TX_END);
  clearEvent(base_, uarte::EVENTS_TXSTOPPED);
  clearEvent(base_, uarte::EVENTS_ERROR);
  reg32(base_ + uarte::ERRORSRC) = uarte::ERRORSRC_ALL;

  reg32(base_ + uarte::DMA_TX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(data));
  reg32(base_ + uarte::DMA_TX_MAXCNT) = static_cast<uint32_t>(len);

  reg32(base_ + uarte::TASKS_DMA_TX_START) = 1;
  const bool txOk = waitForEvent(base_, uarte::EVENTS_DMA_TX_END, spinLimit);

  reg32(base_ + uarte::TASKS_DMA_TX_STOP) = 1;
  const bool stopped =
      waitForEvent(base_, uarte::EVENTS_TXSTOPPED, spinLimit);

  return txOk && stopped;
}

size_t Uarte::read(uint8_t* data, size_t len, uint32_t spinLimit) {
  if (data == nullptr || len == 0U || len > 0xFFFFU) {
    return 0;
  }

  clearEvent(base_, uarte::EVENTS_DMA_RX_END);
  clearEvent(base_, uarte::EVENTS_RXTO);
  clearEvent(base_, uarte::EVENTS_ERROR);
  reg32(base_ + uarte::ERRORSRC) = uarte::ERRORSRC_ALL;

  reg32(base_ + uarte::DMA_RX_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(data));
  reg32(base_ + uarte::DMA_RX_MAXCNT) = static_cast<uint32_t>(len);

  reg32(base_ + uarte::TASKS_DMA_RX_START) = 1;

  bool rxDone = false;
  while (spinLimit-- > 0U) {
    if (reg32(base_ + uarte::EVENTS_DMA_RX_END) != 0U) {
      rxDone = true;
      break;
    }
    if (reg32(base_ + uarte::EVENTS_ERROR) != 0U) {
      break;
    }
  }

  reg32(base_ + uarte::TASKS_DMA_RX_STOP) = 1;
  waitForEvent(base_, uarte::EVENTS_RXTO, 2000000UL);

  const size_t amount = static_cast<size_t>(reg32(base_ + uarte::DMA_RX_AMOUNT));
  if (!rxDone && reg32(base_ + uarte::EVENTS_ERROR) != 0U) {
    reg32(base_ + uarte::ERRORSRC) = uarte::ERRORSRC_ALL;
  }

  return amount;
}

Timer::Timer(uint32_t base, uint32_t pclkHz, uint8_t channelCount)
    : base_(base),
      pclkHz_(pclkHz),
      channelCount_(channelCount),
      prescaler_(4),
      callbacks_{},
      callbackContext_{} {
  if (channelCount_ > 8U) {
    channelCount_ = 8U;
  }
}

bool Timer::begin(TimerBitWidth bitWidth, uint8_t prescaler, bool counterMode) {
  if (channelCount_ == 0U || prescaler > 9U) {
    return false;
  }

  stop();
  clear();

  reg32(base_ + timer::MODE) = counterMode ? timer::MODE_COUNTER : timer::MODE_TIMER;
  reg32(base_ + timer::BITMODE) = static_cast<uint32_t>(bitWidth);
  reg32(base_ + timer::PRESCALER) = static_cast<uint32_t>(prescaler);
  prescaler_ = prescaler;

  reg32(base_ + timer::SHORTS) = 0;
  reg32(base_ + timer::INTENCLR) = 0xFFFFFFFFUL;

  for (uint8_t ch = 0; ch < channelCount_; ++ch) {
    clearEvent(base_, timerCompareEventOffset(ch));
    reg32(base_ + timerOneShotOffset(ch)) = 0;
  }

  return true;
}

bool Timer::setFrequency(uint32_t targetHz) {
  if (targetHz == 0U || pclkHz_ == 0U) {
    return false;
  }

  uint8_t bestPrescaler = 0;
  uint32_t bestError = 0xFFFFFFFFUL;
  bool found = false;

  for (uint8_t prescaler = 0; prescaler <= 9U; ++prescaler) {
    const uint32_t hz = pclkHz_ >> prescaler;
    if (hz == 0U) {
      continue;
    }
    const uint32_t error = absDiffU32(hz, targetHz);
    if (!found || error < bestError) {
      found = true;
      bestError = error;
      bestPrescaler = prescaler;
      if (error == 0U) {
        break;
      }
    }
  }

  if (!found) {
    return false;
  }

  reg32(base_ + timer::PRESCALER) = bestPrescaler;
  prescaler_ = bestPrescaler;
  return true;
}

uint32_t Timer::timerHz() const {
  if (prescaler_ > 31U) {
    return 0;
  }
  return pclkHz_ >> prescaler_;
}

uint32_t Timer::ticksFromMicros(uint32_t us) const {
  const uint32_t hz = timerHz();
  if (hz == 0U || us == 0U) {
    return 0U;
  }

  const uint64_t ticks =
      (static_cast<uint64_t>(hz) * static_cast<uint64_t>(us) + 999999ULL) /
      1000000ULL;
  return static_cast<uint32_t>(ticks);
}

void Timer::start() { reg32(base_ + timer::TASKS_START) = 1; }

void Timer::stop() { reg32(base_ + timer::TASKS_STOP) = 1; }

void Timer::clear() { reg32(base_ + timer::TASKS_CLEAR) = 1; }

bool Timer::setCompare(uint8_t channel, uint32_t ccValue, bool autoClear,
                       bool autoStop, bool oneShot, bool enableInterruptFlag) {
  if (channel >= channelCount_) {
    return false;
  }

