lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  reg32(base_ + timerCcOffset(channel)) = ccValue;
  reg32(base_ + timerOneShotOffset(channel)) = oneShot ? 1U : 0U;

  uint32_t shorts = reg32(base_ + timer::SHORTS);
  const uint32_t clearMask = (1UL << channel);
  const uint32_t stopMask = (1UL << (16U + channel));

  if (autoClear) {
    shorts |= clearMask;
  } else {
    shorts &= ~clearMask;
  }

  if (autoStop) {
    shorts |= stopMask;
  } else {
    shorts &= ~stopMask;
  }

  reg32(base_ + timer::SHORTS) = shorts;
  clearEvent(base_, timerCompareEventOffset(channel));
  enableInterrupt(channel, enableInterruptFlag);

  return true;
}

uint32_t Timer::capture(uint8_t channel) {
  if (channel >= channelCount_) {
    return 0U;
  }
  reg32(base_ + timerCaptureTaskOffset(channel)) = 1;
  return reg32(base_ + timerCcOffset(channel));
}

bool Timer::pollCompare(uint8_t channel, bool clearEventFlag) {
  if (channel >= channelCount_) {
    return false;
  }

  const uint32_t offset = timerCompareEventOffset(channel);
  const bool fired = (reg32(base_ + offset) != 0U);
  if (fired && clearEventFlag) {
    clearEvent(base_, offset);
  }
  return fired;
}

volatile uint32_t* Timer::publishCompareConfigRegister(uint8_t channel) const {
  if (channel >= channelCount_) {
    return nullptr;
  }
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + timerPublishCompareOffset(channel)));
}

volatile uint32_t* Timer::subscribeStartConfigRegister() const {
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + timer::SUBSCRIBE_START));
}

volatile uint32_t* Timer::subscribeStopConfigRegister() const {
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + timer::SUBSCRIBE_STOP));
}

volatile uint32_t* Timer::subscribeClearConfigRegister() const {
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + timer::SUBSCRIBE_CLEAR));
}

volatile uint32_t* Timer::subscribeCaptureConfigRegister(uint8_t channel) const {
  if (channel >= channelCount_) {
    return nullptr;
  }
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + timerSubscribeCaptureOffset(channel)));
}

void Timer::enableInterrupt(uint8_t channel, bool enable) {
  if (channel >= channelCount_) {
    return;
  }

  const uint32_t mask = timerCompareIntMask(channel);
  reg32(base_ + (enable ? timer::INTENSET : timer::INTENCLR)) = mask;
}

bool Timer::attachCompareCallback(uint8_t channel, CompareCallback callback,
                                  void* context) {
  if (channel >= channelCount_) {
    return false;
  }
  callbacks_[channel] = callback;
  callbackContext_[channel] = context;
  return true;
}

void Timer::service() {
  for (uint8_t ch = 0; ch < channelCount_; ++ch) {
    const uint32_t eventOffset = timerCompareEventOffset(ch);
    if (reg32(base_ + eventOffset) == 0U) {
      continue;
    }

    clearEvent(base_, eventOffset);
    if (callbacks_[ch] != nullptr) {
      callbacks_[ch](ch, callbackContext_[ch]);
    }
  }
}

Pwm::Pwm(uint32_t base)
    : base_(base),
      outPin_(kPinDisconnected),
      dutyPermille_(500),
      countertop_(1000),
      prescaler_(0),
      activeHigh_(true),
      configured_(false),
      sequence_{0, 0, 0, 0} {}

bool Pwm::beginSingle(const Pin& outPin, uint32_t frequencyHz, uint16_t dutyPermille,
                      bool activeHigh) {
  if (!isConnected(outPin)) {
    return false;
  }

  outPin_ = outPin;
  dutyPermille_ = (dutyPermille > 1000U) ? 1000U : dutyPermille;
  activeHigh_ = activeHigh;

  if (!Gpio::configure(outPin_, GpioDirection::kOutput, GpioPull::kDisabled)) {
    return false;
  }
  Gpio::write(outPin_, activeHigh_ ? false : true);

  reg32(base_ + pwm::ENABLE) = pwm::ENABLE_DISABLED;
  reg32(base_ + pwm::SHORTS) = 0;

  for (uint8_t ch = 0; ch < 4U; ++ch) {
    reg32(base_ + pwm::PSEL_OUT + (static_cast<uint32_t>(ch) * sizeof(uint32_t))) =
        PSEL_DISCONNECTED;
  }
  reg32(base_ + pwm::PSEL_OUT) = make_psel(outPin_.port, outPin_.pin);

  reg32(base_ + pwm::MODE) = pwm::MODE_UP;

  if (!configureClockAndTop(frequencyHz)) {
    return false;
  }

  reg32(base_ + pwm::DECODER) =
      (pwm::DECODER_LOAD_COMMON << 0U) | (pwm::DECODER_MODE_REFRESHCOUNT << 8U);
  reg32(base_ + pwm::LOOP) = 0;

  // Keep the channel idle level in the "off" state between periods/stops.
  reg32(base_ + pwm::IDLEOUT) = activeHigh_ ? 0U : 1U;

  reg32(base_ + pwm::SEQ_REFRESH + 0U) = 0;
  reg32(base_ + pwm::SEQ_REFRESH + sizeof(uint32_t)) = 0;
  reg32(base_ + pwm::SEQ_ENDDELAY + 0U) = 0;
  reg32(base_ + pwm::SEQ_ENDDELAY + sizeof(uint32_t)) = 0;

  updateSequenceWord();

  for (uint8_t seq = 0; seq < 2U; ++seq) {
    reg32(base_ + pwmDmaSeqPtrOffset(seq)) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&sequence_[0]));
    reg32(base_ + pwmDmaSeqMaxCntOffset(seq)) = 2U;  // One 16-bit value in bytes.
  }

  reg32(base_ + pwm::ENABLE) = pwm::ENABLE_ENABLED;
  configured_ = true;
  return true;
}

bool Pwm::setDutyPermille(uint16_t dutyPermille) {
  dutyPermille_ = (dutyPermille > 1000U) ? 1000U : dutyPermille;
  if (!configured_) {
    return false;
  }
  updateSequenceWord();
  return true;
}

bool Pwm::setFrequency(uint32_t frequencyHz) {
  if (!configured_) {
    return false;
  }

  if (!configureClockAndTop(frequencyHz)) {
    return false;
  }

  updateSequenceWord();
  return true;
}

bool Pwm::start(uint8_t sequence, uint32_t spinLimit) {
  if (!configured_ || sequence > 1U) {
    return false;
  }

  uint32_t shorts = 0;
  if (sequence == 0U) {
    shorts |= (1UL << 2U);  // LOOPSDONE -> TASKS_DMA.SEQ[0].START
    shorts |= (1UL << 6U);  // DMA_SEQ0 bus error -> STOP
  } else {
    shorts |= (1UL << 3U);  // LOOPSDONE -> TASKS_DMA.SEQ[1].START
    shorts |= (1UL << 7U);  // DMA_SEQ1 bus error -> STOP
  }
  reg32(base_ + pwm::SHORTS) = shorts;

  clearEvent(base_, pwm::EVENTS_STOPPED);
  clearEvent(base_, pwm::EVENTS_LOOPSDONE);
  clearEvent(base_, pwm::EVENTS_PWMPERIODEND);
  clearEvent(base_, pwmEventSeqStartedOffset(sequence));
  clearEvent(base_, pwmEventSeqEndOffset(sequence));
  clearEvent(base_, pwmEventDmaSeqEndOffset(sequence));

  reg32(base_ + pwmTaskSeqStartOffset(sequence)) = 1;
  return waitForEvent(base_, pwmEventSeqStartedOffset(sequence), spinLimit);
}

bool Pwm::stop(uint32_t spinLimit) {
  if (!configured_) {
    return false;
  }

