lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  clearEvent(base_, pwm::EVENTS_STOPPED);
  reg32(base_ + pwm::TASKS_STOP) = 1;
  reg32(base_ + pwm::SHORTS) = 0;

  return waitForEvent(base_, pwm::EVENTS_STOPPED, spinLimit);
}

void Pwm::end() {
  if (configured_) {
    stop(200000UL);
  }

  reg32(base_ + pwm::ENABLE) = pwm::ENABLE_DISABLED;
  reg32(base_ + pwm::SHORTS) = 0;

  for (uint8_t ch = 0; ch < 4U; ++ch) {
    reg32(base_ + pwm::PSEL_OUT + (static_cast<uint32_t>(ch) * sizeof(uint32_t))) =
        PSEL_DISCONNECTED;
  }

  configured_ = false;
}

bool Pwm::pollPeriodEnd(bool clearEventFlag) {
  const bool fired = (reg32(base_ + pwm::EVENTS_PWMPERIODEND) != 0U);
  if (fired && clearEventFlag) {
    clearEvent(base_, pwm::EVENTS_PWMPERIODEND);
  }
  return fired;
}

bool Pwm::configureClockAndTop(uint32_t frequencyHz) {
  PwmTiming timing{};
  if (!computePwmTiming(frequencyHz, &timing)) {
    return false;
  }

  prescaler_ = timing.prescaler;
  countertop_ = timing.countertop;

  reg32(base_ + pwm::PRESCALER) = prescaler_;
  reg32(base_ + pwm::COUNTERTOP) = countertop_;
  return true;
}

void Pwm::updateSequenceWord() {
  if (countertop_ < 3U) {
    countertop_ = 3U;
  }

  uint32_t pulse = (static_cast<uint32_t>(countertop_) * dutyPermille_ + 500U) / 1000U;
  if (pulse > countertop_) {
    pulse = countertop_;
  }

  uint16_t word = static_cast<uint16_t>(pulse & 0x7FFFU);
  if (!activeHigh_) {
    word |= 0x8000U;
  }

  sequence_[0] = word;
  sequence_[1] = word;
  sequence_[2] = word;
  sequence_[3] = word;
}

Gpiote::Gpiote(uint32_t base, uint8_t channelCount)
    : base_(base), channelCount_(channelCount), callbacks_{}, callbackContext_{} {
  if (channelCount_ > 8U) {
    channelCount_ = 8U;
  }
}

bool Gpiote::configureEvent(uint8_t channel, const Pin& pin, GpiotePolarity polarity,
                            bool enableInterruptFlag) {
  if (channel >= channelCount_ || !isConnected(pin)) {
    return false;
  }

  if (!Gpio::configure(pin, GpioDirection::kInput, GpioPull::kDisabled)) {
    return false;
  }

  uint32_t config = 0;
  config |= (gpiote::MODE_EVENT << gpiote::CONFIG_MODE_Pos);
  config |= (static_cast<uint32_t>(pin.pin) << gpiote::CONFIG_PSEL_Pos);
  config |= (static_cast<uint32_t>(pin.port) << gpiote::CONFIG_PORT_Pos);
  config |= (static_cast<uint32_t>(polarity) << gpiote::CONFIG_POLARITY_Pos);

  reg32(base_ + gpioteConfigOffset(channel)) = config;
  clearEvent(base_, gpioteInEventOffset(channel));

  if (enableInterruptFlag) {
    enableInterrupt(channel, true);
  }
  return true;
}

bool Gpiote::configureTask(uint8_t channel, const Pin& pin, GpiotePolarity polarity,
                           bool initialHigh) {
  if (channel >= channelCount_ || !isConnected(pin)) {
    return false;
  }

  if (!Gpio::configure(pin, GpioDirection::kOutput, GpioPull::kDisabled)) {
    return false;
  }
  Gpio::write(pin, initialHigh);

  uint32_t config = 0;
  config |= (gpiote::MODE_TASK << gpiote::CONFIG_MODE_Pos);
  config |= (static_cast<uint32_t>(pin.pin) << gpiote::CONFIG_PSEL_Pos);
  config |= (static_cast<uint32_t>(pin.port) << gpiote::CONFIG_PORT_Pos);
  config |= (static_cast<uint32_t>(polarity) << gpiote::CONFIG_POLARITY_Pos);
  if (initialHigh) {
    config |= (1UL << gpiote::CONFIG_OUTINIT_Pos);
  }

  reg32(base_ + gpioteConfigOffset(channel)) = config;
  return true;
}

void Gpiote::disableChannel(uint8_t channel) {
  if (channel >= channelCount_) {
    return;
  }
  reg32(base_ + gpioteConfigOffset(channel)) = 0;
  enableInterrupt(channel, false);
  clearEvent(base_, gpioteInEventOffset(channel));
}

bool Gpiote::triggerTaskOut(uint8_t channel) {
  if (channel >= channelCount_) {
    return false;
  }
  reg32(base_ + gpioteTaskOutOffset(channel)) = 1;
  return true;
}

bool Gpiote::triggerTaskSet(uint8_t channel) {
  if (channel >= channelCount_) {
    return false;
  }
  reg32(base_ + gpioteTaskSetOffset(channel)) = 1;
  return true;
}

bool Gpiote::triggerTaskClr(uint8_t channel) {
  if (channel >= channelCount_) {
    return false;
  }
  reg32(base_ + gpioteTaskClrOffset(channel)) = 1;
  return true;
}

bool Gpiote::pollInEvent(uint8_t channel, bool clearEventFlag) {
  if (channel >= channelCount_) {
    return false;
  }

  const uint32_t offset = gpioteInEventOffset(channel);
  const bool fired = (reg32(base_ + offset) != 0U);
  if (fired && clearEventFlag) {
    clearEvent(base_, offset);
  }
  return fired;
}

bool Gpiote::pollPortEvent(bool clearEventFlag) {
  const bool fired = (reg32(base_ + gpiote::EVENTS_PORT_NONSECURE) != 0U);
  if (fired && clearEventFlag) {
    clearEvent(base_, gpiote::EVENTS_PORT_NONSECURE);
  }
  return fired;
}

volatile uint32_t* Gpiote::subscribeTaskOutConfigRegister(uint8_t channel) const {
  if (channel >= channelCount_) {
    return nullptr;
  }
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + gpioteSubscribeOutOffset(channel)));
}

volatile uint32_t* Gpiote::subscribeTaskSetConfigRegister(uint8_t channel) const {
  if (channel >= channelCount_) {
    return nullptr;
  }
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + gpioteSubscribeSetOffset(channel)));
}

volatile uint32_t* Gpiote::subscribeTaskClrConfigRegister(uint8_t channel) const {
  if (channel >= channelCount_) {
    return nullptr;
  }
  return reinterpret_cast<volatile uint32_t*>(
      static_cast<uintptr_t>(base_ + gpioteSubscribeClrOffset(channel)));
}

void Gpiote::enableInterrupt(uint8_t channel, bool enable) {
  if (channel >= channelCount_) {
    return;
  }

  const uint32_t mask = (1UL << channel);
  reg32(base_ + (enable ? gpiote::INTENSET0 : gpiote::INTENCLR0)) = mask;
}

bool Gpiote::attachInCallback(uint8_t channel, InCallback callback, void* context) {
  if (channel >= channelCount_) {
    return false;
  }
  callbacks_[channel] = callback;
  callbackContext_[channel] = context;
  return true;
}

void Gpiote::service() {
  for (uint8_t ch = 0; ch < channelCount_; ++ch) {
    const uint32_t offset = gpioteInEventOffset(ch);
    if (reg32(base_ + offset) == 0U) {
      continue;
    }

    clearEvent(base_, offset);
    if (callbacks_[ch] != nullptr) {
      callbacks_[ch](ch, callbackContext_[ch]);
    }
  }
}

