lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
Dppic::Dppic(uint32_t base)
    : dppic_(reinterpret_cast<NRF_DPPIC_Type*>(static_cast<uintptr_t>(base))) {}

bool Dppic::enableChannel(uint8_t channel, bool enable) {
  if (channel >= 24U || dppic_ == nullptr) {
    return false;
  }

  const uint32_t mask = (1UL << channel);
  if (enable) {
    dppic_->CHENSET = mask;
  } else {
    dppic_->CHENCLR = mask;
  }
  return true;
}

bool Dppic::channelEnabled(uint8_t channel) const {
  if (channel >= 24U || dppic_ == nullptr) {
    return false;
  }
  return (dppic_->CHEN & (1UL << channel)) != 0U;
}

bool Dppic::configurePublish(volatile uint32_t* publishRegister, uint8_t channel,
                             bool enable) const {
  if (publishRegister == nullptr || channel >= 24U) {
    return false;
  }
  *publishRegister = enable ? nrf54l15::dppic::configValue(channel) : 0U;
  return true;
}

bool Dppic::configureSubscribe(volatile uint32_t* subscribeRegister, uint8_t channel,
                               bool enable) const {
  if (subscribeRegister == nullptr || channel >= 24U) {
    return false;
  }
  *subscribeRegister = enable ? nrf54l15::dppic::configValue(channel) : 0U;
  return true;
}

bool Dppic::connect(volatile uint32_t* publishRegister,
                    volatile uint32_t* subscribeRegister,
                    uint8_t channel,
                    bool enableChannelFlag) const {
  if (!configurePublish(publishRegister, channel, true) ||
      !configureSubscribe(subscribeRegister, channel, true)) {
    return false;
  }

  if (enableChannelFlag && dppic_ != nullptr) {
    dppic_->CHENSET = (1UL << channel);
  }
  return true;
}

bool Dppic::disconnectPublish(volatile uint32_t* publishRegister) const {
  if (publishRegister == nullptr) {
    return false;
  }
  *publishRegister = 0U;
  return true;
}

bool Dppic::disconnectSubscribe(volatile uint32_t* subscribeRegister) const {
  if (subscribeRegister == nullptr) {
    return false;
  }
  *subscribeRegister = 0U;
  return true;
}

namespace {

constexpr uint32_t kVdmaDescriptorAttrEcbData =
    (VDMADESCRIPTOR_CONFIG_ATTRIBUTE_EcbData
     << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) &
    VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk;
constexpr uint32_t kVdmaDescriptorAttrAarHash =
    (VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarHash
     << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) &
    VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk;
constexpr uint32_t kVdmaDescriptorAttrAarPrand =
    (VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarPrand
     << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) &
    VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk;
constexpr uint32_t kVdmaDescriptorAttrAarIrk =
    (VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarIrk
     << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) &
    VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk;
// Nordic confirmed the output job list needs a dedicated 0x11 descriptor byte,
// not the generic AarHash value that the datasheet implies.
constexpr uint32_t kVdmaDescriptorAttrAarResolvedIndex =
    (0x11UL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) &
    VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk;
constexpr size_t kAarMaxIrksScratch = 64U;

alignas(4) uint8_t g_aarAddressScratch[6] = {};
alignas(4) uint8_t g_aarIrkScratch[kAarMaxIrksScratch * 16U] = {};
alignas(4) uint16_t g_aarResolvedIndexScratch = 0xFFFFU;
alignas(4) NRF_VDMADESCRIPTOR_Type g_aarInJobs[kAarMaxIrksScratch + 3U] = {};
alignas(4) NRF_VDMADESCRIPTOR_Type g_aarOutJobs[2] = {};

uint32_t packBigEndianWord(const uint8_t* bytes) {
  return (static_cast<uint32_t>(bytes[0]) << 24U) |
         (static_cast<uint32_t>(bytes[1]) << 16U) |
         (static_cast<uint32_t>(bytes[2]) << 8U) |
         static_cast<uint32_t>(bytes[3]);
}

void configureVdmaDescriptor(NRF_VDMADESCRIPTOR_Type* descriptor,
                             const uint8_t* data,
                             size_t length,
                             uint32_t attrBits) {
  if (descriptor == nullptr) {
    return;
  }

  descriptor->PTR = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(data));
  descriptor->CONFIG =
      (static_cast<uint32_t>(length) & VDMADESCRIPTOR_CONFIG_CNT_Msk) | attrBits;
}

void zeroVdmaDescriptor(NRF_VDMADESCRIPTOR_Type* descriptor) {
  if (descriptor == nullptr) {
    return;
  }
  descriptor->PTR = 0U;
  descriptor->CONFIG = 0U;
}

}  // namespace

Aar::Aar(uint32_t base)
    : aar_(reinterpret_cast<NRF_AAR_Type*>(static_cast<uintptr_t>(base))) {}

bool Aar::resolveFirst(const uint8_t address[6], const uint8_t* irks,
                       size_t irkCount, bool* outResolved, uint16_t* outIndex,
                       uint32_t spinLimit) {
  if (aar_ == nullptr || address == nullptr || irks == nullptr ||
      outResolved == nullptr || irkCount == 0U ||
      irkCount > kAarMaxIrksScratch) {
    return false;
  }

  *outResolved = false;
  if (outIndex != nullptr) {
    *outIndex = 0xFFFFU;
  }

  uint8_t* const irkRam = g_aarIrkScratch;
  NRF_VDMADESCRIPTOR_Type* const inJobs = g_aarInJobs;
  NRF_VDMADESCRIPTOR_Type* const outJobs = g_aarOutJobs;

  memset(g_aarAddressScratch, 0, sizeof(g_aarAddressScratch));
  memset(g_aarIrkScratch, 0, irkCount * 16U);
  memset(g_aarInJobs, 0, (irkCount + 3U) * sizeof(NRF_VDMADESCRIPTOR_Type));
  memset(g_aarOutJobs, 0, sizeof(g_aarOutJobs));
  g_aarResolvedIndexScratch = 0xFFFFU;

  memcpy(g_aarAddressScratch, address, sizeof(g_aarAddressScratch));
  // Zephyr pre-swaps nRF54L resolving-list IRKs before feeding AAR.
  for (size_t irkIndex = 0; irkIndex < irkCount; ++irkIndex) {
    const uint8_t* src = irks + (irkIndex * 16U);
    uint8_t* dst = irkRam + (irkIndex * 16U);
    for (size_t byteIndex = 0; byteIndex < 16U; ++byteIndex) {
      dst[byteIndex] = src[15U - byteIndex];
    }
  }

  configureVdmaDescriptor(&inJobs[0], &g_aarAddressScratch[0], 3U,
                          kVdmaDescriptorAttrAarHash);
  configureVdmaDescriptor(&inJobs[1], &g_aarAddressScratch[3], 3U,
                          kVdmaDescriptorAttrAarPrand);
  for (size_t irkIndex = 0; irkIndex < irkCount; ++irkIndex) {
    configureVdmaDescriptor(&inJobs[2U + irkIndex], irkRam + (irkIndex * 16U),
                            16U, kVdmaDescriptorAttrAarIrk);
  }
  zeroVdmaDescriptor(&inJobs[2U + irkCount]);

  configureVdmaDescriptor(&outJobs[0],
                          reinterpret_cast<const uint8_t*>(&g_aarResolvedIndexScratch),
                          sizeof(g_aarResolvedIndexScratch),
                          kVdmaDescriptorAttrAarResolvedIndex);
  zeroVdmaDescriptor(&outJobs[1]);

