lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  aar_->ENABLE = AAR_ENABLE_ENABLE_Disabled;
  aar_->INTENCLR = 0xFFFFFFFFUL;
  clearEvents();
  NVIC_ClearPendingIRQ(AAR00_IRQn);
  aar_->ENABLE = AAR_ENABLE_ENABLE_Enabled;
  aar_->MAXRESOLVED = 1U;
  aar_->IN.PTR = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&inJobs[0]));
  aar_->OUT.PTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&outJobs[0]));
  __asm volatile("dsb 0xF" ::: "memory");

  aar_->TASKS_START = AAR_TASKS_START_TASKS_START_Trigger;

  bool completed = false;
  while (spinLimit-- > 0U) {
    if (aar_->EVENTS_ERROR != 0U) {
      completed = false;
      break;
    }
    if (aar_->EVENTS_END != 0U) {
      completed = true;
      break;
    }
  }

  const uint32_t finalAmount = aar_->OUT.AMOUNT & AAR_OUT_AMOUNT_AMOUNT_Msk;
  const bool resolved = (aar_->EVENTS_RESOLVED != 0U) &&
                        (aar_->EVENTS_NOTRESOLVED == 0U);
  const uint16_t resolvedIndex = g_aarResolvedIndexScratch;

  if (!completed) {
    aar_->TASKS_STOP = AAR_TASKS_STOP_TASKS_STOP_Trigger;
  }
  *outResolved = completed && resolved;

  aar_->ENABLE = AAR_ENABLE_ENABLE_Disabled;
  NVIC_DisableIRQ(AAR00_IRQn);
  NVIC_ClearPendingIRQ(AAR00_IRQn);

  if (completed && resolved && outIndex != nullptr && finalAmount >= 2U) {
    *outIndex = resolvedIndex;
  }

  return completed && errorStatus() == AAR_ERRORSTATUS_ERRORSTATUS_NoError;
}

bool Aar::resolveSingle(const uint8_t address[6], const uint8_t irk[16],
                        bool* outResolved, uint32_t spinLimit) {
  return resolveFirst(address, irk, 1U, outResolved, nullptr, spinLimit);
}

uint32_t Aar::errorStatus() const {
  if (aar_ == nullptr) {
    return AAR_ERRORSTATUS_ERRORSTATUS_DmaError;
  }
  return aar_->ERRORSTATUS & AAR_ERRORSTATUS_ERRORSTATUS_Msk;
}

uint32_t Aar::resolvedAmountBytes() const {
  if (aar_ == nullptr) {
    return 0U;
  }
  return aar_->OUT.AMOUNT & AAR_OUT_AMOUNT_AMOUNT_Msk;
}

void Aar::clearEvents() {
  if (aar_ == nullptr) {
    return;
  }
  aar_->EVENTS_END = 0U;
  aar_->EVENTS_RESOLVED = 0U;
  aar_->EVENTS_NOTRESOLVED = 0U;
  aar_->EVENTS_ERROR = 0U;
}

Ecb::Ecb(uint32_t base)
    : ecb_(reinterpret_cast<NRF_ECB_Type*>(static_cast<uintptr_t>(base))) {}

bool Ecb::encryptBlock(const uint8_t key[16], const uint8_t plaintext[16],
                       uint8_t ciphertext[16], uint32_t spinLimit) {
  if (ecb_ == nullptr || key == nullptr || plaintext == nullptr ||
      ciphertext == nullptr) {
    return false;
  }

  alignas(4) uint8_t inputBlock[16];
  alignas(4) NRF_VDMADESCRIPTOR_Type inJobs[2] = {};
  alignas(4) NRF_VDMADESCRIPTOR_Type outJobs[2] = {};

  memcpy(inputBlock, plaintext, sizeof(inputBlock));
  configureVdmaDescriptor(&inJobs[0], inputBlock, sizeof(inputBlock),
                          kVdmaDescriptorAttrEcbData);
  configureVdmaDescriptor(&outJobs[0], ciphertext, 16U,
                          kVdmaDescriptorAttrEcbData);
  zeroVdmaDescriptor(&inJobs[1]);
  zeroVdmaDescriptor(&outJobs[1]);

  clearEvents();

  for (uint8_t i = 0U; i < 4U; ++i) {
    ecb_->KEY.VALUE[i] = packBigEndianWord(&key[(3U - i) * 4U]);
  }

  ecb_->IN.PTR = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&inJobs[0]));
  ecb_->OUT.PTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&outJobs[0]));
  __asm volatile("dsb 0xF" ::: "memory");

  ecb_->TASKS_START = ECB_TASKS_START_TASKS_START_Trigger;
  while (spinLimit-- > 0U) {
    if (ecb_->EVENTS_END != 0U) {
      ecb_->EVENTS_END = 0U;
      return (ecb_->ERRORSTATUS & ECB_ERRORSTATUS_ERRORSTATUS_Msk) ==
             ECB_ERRORSTATUS_ERRORSTATUS_NoError;
    }
    if (ecb_->EVENTS_ERROR != 0U) {
      ecb_->EVENTS_ERROR = 0U;
      return false;
    }
  }

  ecb_->TASKS_STOP = ECB_TASKS_STOP_TASKS_STOP_Trigger;
  return false;
}

bool Ecb::encryptBlockInPlace(const uint8_t key[16], uint8_t block[16],
                              uint32_t spinLimit) {
  return encryptBlock(key, block, block, spinLimit);
}

uint32_t Ecb::errorStatus() const {
  if (ecb_ == nullptr) {
    return ECB_ERRORSTATUS_ERRORSTATUS_DmaError;
  }
  return ecb_->ERRORSTATUS & ECB_ERRORSTATUS_ERRORSTATUS_Msk;
}

void Ecb::clearEvents() {
  if (ecb_ == nullptr) {
    return;
  }
  ecb_->EVENTS_END = 0U;
  ecb_->EVENTS_ERROR = 0U;
}

Comp::Comp(uint32_t base)
    : comp_(reinterpret_cast<NRF_COMP_Type*>(static_cast<uintptr_t>(base))),
      active_(false) {}

bool Comp::beginThreshold(const Pin& inputPin, uint16_t thresholdPermille,
                          uint16_t hysteresisPermille, CompReference reference,
                          CompSpeedMode speed, const Pin& externalReferencePin,
                          CompCurrentSource currentSource, uint32_t spinLimit) {
  return beginSingleEnded(inputPin, reference, thresholdPermille,
                          hysteresisPermille, speed, externalReferencePin,
                          currentSource, spinLimit);
}

bool Comp::beginSingleEnded(const Pin& inputPin, CompReference reference,
                            uint16_t thresholdPermille,
                            uint16_t hysteresisPermille, CompSpeedMode speed,
                            const Pin& externalReferencePin,
                            CompCurrentSource currentSource,
                            uint32_t spinLimit) {
  if (active_) {
    end();
  }

  if (!pinSupportsAnalogInput(inputPin)) {
    return false;
  }
  if (reference == CompReference::kExternalAref &&
      !pinSupportsAnalogInput(externalReferencePin)) {
    return false;
  }
  if (!claimComparator(ComparatorOwner::kComp)) {
    return false;
  }
  if (!configureAnalogPeripheralPin(inputPin) ||
      (reference == CompReference::kExternalAref &&
       !configureAnalogPeripheralPin(externalReferencePin))) {
    releaseComparator(ComparatorOwner::kComp);
    return false;
  }

  thresholdPermille = clampPermille(thresholdPermille);
  hysteresisPermille = clampPermille(hysteresisPermille);
  const uint16_t halfHysteresis = hysteresisPermille / 2U;
  uint16_t lowPermille =
      (thresholdPermille > halfHysteresis) ? (thresholdPermille - halfHysteresis) : 0U;
  uint16_t highPermille =
      thresholdPermille + static_cast<uint16_t>(hysteresisPermille - halfHysteresis);
  if (highPermille > 1000U) {
    highPermille = 1000U;
  }
  if (lowPermille > highPermille) {
    lowPermille = highPermille;
  }

  comp_->TASKS_STOP = COMP_TASKS_STOP_TASKS_STOP_Trigger;
  comp_->ENABLE = (COMP_ENABLE_ENABLE_Disabled << COMP_ENABLE_ENABLE_Pos);
  comp_->INTENCLR = 0xFFFFFFFFUL;
  comp_->SHORTS = 0U;
  clearEvents();

  comp_->PSEL = makeCompPinSelect(inputPin);
  comp_->REFSEL = ((static_cast<uint32_t>(reference) << COMP_REFSEL_REFSEL_Pos) &
                   COMP_REFSEL_REFSEL_Msk);
  comp_->EXTREFSEL = (reference == CompReference::kExternalAref)
                         ? makeCompPinSelect(externalReferencePin)
                         : 0U;
  comp_->TH = compThresholdRegValue(lowPermille, highPermille);
  comp_->MODE = ((static_cast<uint32_t>(speed) << COMP_MODE_SP_Pos) &
                 COMP_MODE_SP_Msk) |
                ((COMP_MODE_MAIN_SE << COMP_MODE_MAIN_Pos) &
                 COMP_MODE_MAIN_Msk);
  comp_->HYST = ((COMP_HYST_HYST_NoHyst << COMP_HYST_HYST_Pos) &
                 COMP_HYST_HYST_Msk);
  setCurrentSource(currentSource);

