lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  qdec_->PSEL.A = makeQdecConnectedPinSelect(pinA);
  qdec_->PSEL.B = makeQdecConnectedPinSelect(pinB);
  qdec_->PSEL.LED =
      isConnected(ledPin) ? makeQdecConnectedPinSelect(ledPin) : PSEL_DISCONNECTED;
  qdec_->LEDPOL = ((static_cast<uint32_t>(ledPolarity) << QDEC_LEDPOL_LEDPOL_Pos) &
                   QDEC_LEDPOL_LEDPOL_Msk);
  qdec_->SAMPLEPER =
      ((static_cast<uint32_t>(samplePeriod) << QDEC_SAMPLEPER_SAMPLEPER_Pos) &
       QDEC_SAMPLEPER_SAMPLEPER_Msk);
  qdec_->REPORTPER =
      ((static_cast<uint32_t>(reportPeriod) << QDEC_REPORTPER_REPORTPER_Pos) &
       QDEC_REPORTPER_REPORTPER_Msk);
  qdec_->DBFEN = (((debounce ? QDEC_DBFEN_DBFEN_Enabled
                             : QDEC_DBFEN_DBFEN_Disabled)
                   << QDEC_DBFEN_DBFEN_Pos) &
                  QDEC_DBFEN_DBFEN_Msk);
  qdec_->LEDPRE = ((static_cast<uint32_t>(ledPreUs) << QDEC_LEDPRE_LEDPRE_Pos) &
                   QDEC_LEDPRE_LEDPRE_Msk);

  qdec_->ENABLE = ((QDEC_ENABLE_ENABLE_Enabled << QDEC_ENABLE_ENABLE_Pos) &
                   QDEC_ENABLE_ENABLE_Msk);
  configured_ = true;
  return true;
}

void Qdec::end() {
  qdec_->TASKS_STOP = QDEC_TASKS_STOP_TASKS_STOP_Trigger;
  qdec_->ENABLE = QDEC_ENABLE_ENABLE_Disabled;
  qdec_->PSEL.A = PSEL_DISCONNECTED;
  qdec_->PSEL.B = PSEL_DISCONNECTED;
  qdec_->PSEL.LED = PSEL_DISCONNECTED;
  qdec_->EVENTS_SAMPLERDY = 0U;
  qdec_->EVENTS_REPORTRDY = 0U;
  qdec_->EVENTS_ACCOF = 0U;
  qdec_->EVENTS_DBLRDY = 0U;
  qdec_->EVENTS_STOPPED = 0U;
  configured_ = false;
}

void Qdec::start() {
  if (configured_) {
    qdec_->TASKS_START = QDEC_TASKS_START_TASKS_START_Trigger;
  }
}

void Qdec::stop() {
  if (configured_) {
    qdec_->TASKS_STOP = QDEC_TASKS_STOP_TASKS_STOP_Trigger;
  }
}

int32_t Qdec::sampleValue() const { return qdec_->SAMPLE; }

int32_t Qdec::accumulator() const { return qdec_->ACC; }

int32_t Qdec::readAndClearAccumulator() {
  if (!configured_) {
    return 0;
  }
  qdec_->TASKS_RDCLRACC = QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Trigger;
  __asm volatile("dsb 0xF" ::: "memory");
  return qdec_->ACCREAD;
}

uint32_t Qdec::doubleTransitions() const { return qdec_->ACCDBL; }

uint32_t Qdec::readAndClearDoubleTransitions() {
  if (!configured_) {
    return 0U;
  }
  qdec_->TASKS_RDCLRDBL = QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Trigger;
  __asm volatile("dsb 0xF" ::: "memory");
  return qdec_->ACCDBLREAD;
}

bool Qdec::pollSampleReady(bool clearEventFlag) {
  const bool fired = (qdec_->EVENTS_SAMPLERDY != 0U);
  if (fired && clearEventFlag) {
    qdec_->EVENTS_SAMPLERDY = 0U;
  }
  return fired;
}

bool Qdec::pollReportReady(bool clearEventFlag) {
  const bool fired = (qdec_->EVENTS_REPORTRDY != 0U);
  if (fired && clearEventFlag) {
    qdec_->EVENTS_REPORTRDY = 0U;
  }
  return fired;
}

bool Qdec::pollOverflow(bool clearEventFlag) {
  const bool fired = (qdec_->EVENTS_ACCOF != 0U);
  if (fired && clearEventFlag) {
    qdec_->EVENTS_ACCOF = 0U;
  }
  return fired;
}

bool Qdec::pollDoubleReady(bool clearEventFlag) {
  const bool fired = (qdec_->EVENTS_DBLRDY != 0U);
  if (fired && clearEventFlag) {
    qdec_->EVENTS_DBLRDY = 0U;
  }
  return fired;
}

bool Qdec::pollStopped(bool clearEventFlag) {
  const bool fired = (qdec_->EVENTS_STOPPED != 0U);
  if (fired && clearEventFlag) {
    qdec_->EVENTS_STOPPED = 0U;
  }
  return fired;
}

Saadc::Saadc(uint32_t base)
    : base_(base),
      resolution_(AdcResolution::k12bit),
      gain_(AdcGain::k2over8),
      configured_(false) {}

bool Saadc::begin(AdcResolution resolution, uint32_t spinLimit) {
  resolution_ = resolution;
  configured_ = false;

  reg32(base_ + saadc::ENABLE) = saadc::ENABLE_DISABLED;

  reg32(base_ + saadc::RESOLUTION) = static_cast<uint32_t>(resolution_);
  reg32(base_ + saadc::OVERSAMPLE) = saadc::OVERSAMPLE_BYPASS;
  reg32(base_ + saadc::SAMPLERATE) =
      (saadc::SAMPLERATE_MODE_TASK << saadc::SAMPLERATE_MODE_Pos);
  reg32(base_ + saadc::NOISESHAPE) = saadc::NOISESHAPE_DISABLED;

  reg32(base_ + saadc::ENABLE) = saadc::ENABLE_ENABLED;

  clearEvent(base_, saadc::EVENTS_CALIBRATEDONE);
  reg32(base_ + saadc::TASKS_CALIBRATEOFFSET) = 1;

  return waitForEvent(base_, saadc::EVENTS_CALIBRATEDONE, spinLimit);
}

void Saadc::end() {
  reg32(base_ + saadc::ENABLE) = saadc::ENABLE_DISABLED;
  configured_ = false;
}

bool Saadc::configureSingleEnded(uint8_t channel, const Pin& pin, AdcGain gain,
                                 uint16_t tacq, uint8_t tconv) {
  if (channel > 7U || !isConnected(pin) || saadcInputForPin(pin) < 0) {
    return false;
  }

  if (tacq < 1U) {
    tacq = 1U;
  }
  if (tacq > 319U) {
    tacq = 319U;
  }
  if (tconv < 1U) {
    tconv = 1U;
  }
  if (tconv > 7U) {
    tconv = 7U;
  }

  // Keep this HAL simple and deterministic: one active channel at a time.
  for (uint8_t i = 0; i < 8U; ++i) {
    reg32(base_ + saadc::CH_PSELP +
          (static_cast<uint32_t>(i) * saadc::CH_STRIDE)) = 0;
    reg32(base_ + saadc::CH_PSELN +
          (static_cast<uint32_t>(i) * saadc::CH_STRIDE)) = 0;
  }

  uint32_t psel = 0;
  psel |= (static_cast<uint32_t>(pin.pin) << saadc::CH_PSEL_PIN_Pos);
  psel |= (static_cast<uint32_t>(pin.port) << saadc::CH_PSEL_PORT_Pos);
  psel |= (saadc::CH_PSEL_CONNECT_ANALOG << saadc::CH_PSEL_CONNECT_Pos);

  reg32(base_ + saadc::CH_PSELP +
        (static_cast<uint32_t>(channel) * saadc::CH_STRIDE)) = psel;
  reg32(base_ + saadc::CH_PSELN +
        (static_cast<uint32_t>(channel) * saadc::CH_STRIDE)) =
      (saadc::CH_PSEL_CONNECT_NC << saadc::CH_PSEL_CONNECT_Pos);

  uint32_t config = 0;
  config |= (static_cast<uint32_t>(gain) << saadc::CH_CONFIG_GAIN_Pos);
  config |= (0U << saadc::CH_CONFIG_BURST_Pos);
  config |= (saadc::REFSEL_INTERNAL << saadc::CH_CONFIG_REFSEL_Pos);
  config |= (saadc::MODE_SINGLE_ENDED << saadc::CH_CONFIG_MODE_Pos);
  config |= (static_cast<uint32_t>(tacq) << saadc::CH_CONFIG_TACQ_Pos);
  config |= (static_cast<uint32_t>(tconv) << saadc::CH_CONFIG_TCONV_Pos);

  reg32(base_ + saadc::CH_CONFIG +
        (static_cast<uint32_t>(channel) * saadc::CH_STRIDE)) = config;

  gain_ = gain;
  configured_ = true;
  return true;
}

bool Saadc::sampleRaw(int16_t* outRaw, uint32_t spinLimit) const {
  if (!configured_ || outRaw == nullptr) {
    return false;
  }

  // EasyDMA writes this value asynchronously, keep it volatile.
  volatile int16_t sample = 0;

  clearEvent(base_, saadc::EVENTS_STARTED);
  clearEvent(base_, saadc::EVENTS_END);
  clearEvent(base_, saadc::EVENTS_STOPPED);

  reg32(base_ + saadc::RESULT_PTR) =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&sample));
  // On nRF54 SAADC this counter is in bytes.
  reg32(base_ + saadc::RESULT_MAXCNT) = sizeof(sample);

  reg32(base_ + saadc::TASKS_START) = 1;
  if (!waitForEvent(base_, saadc::EVENTS_STARTED, spinLimit)) {
    return false;
  }

  reg32(base_ + saadc::TASKS_SAMPLE) = 1;
  if (!waitForEvent(base_, saadc::EVENTS_END, spinLimit)) {
    return false;
  }

