lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  reg32(base_ + saadc::TASKS_STOP) = 1;
  if (!waitForEvent(base_, saadc::EVENTS_STOPPED, spinLimit)) {
    return false;
  }

  if (reg32(base_ + saadc::RESULT_AMOUNT) < sizeof(sample)) {
    return false;
  }

  *outRaw = sample;
  return true;
}

bool Saadc::sampleMilliVolts(int32_t* outMilliVolts, uint32_t spinLimit) const {
  if (outMilliVolts == nullptr) {
    return false;
  }

  int16_t raw = 0;
  if (!sampleRaw(&raw, spinLimit)) {
    return false;
  }

  if (raw < 0) {
    raw = 0;
  }

  const uint32_t bits = adcResolutionBits(resolution_);
  const uint32_t scale = (1UL << bits);
  const double gain = adcGainValue(gain_);

  // Internal reference is 0.9 V; convert using datasheet transfer equation.
  const double mv =
      (static_cast<double>(raw) * 900.0) / (gain * static_cast<double>(scale));

  *outMilliVolts = static_cast<int32_t>(mv + 0.5);
  return true;
}

bool BoardControl::setAntennaPath(BoardAntennaPath path) {
  xiao_nrf54l15_antenna_t selection = XIAO_NRF54L15_ANTENNA_CERAMIC;
  switch (path) {
    case BoardAntennaPath::kExternal:
      selection = XIAO_NRF54L15_ANTENNA_EXTERNAL;
      break;
    case BoardAntennaPath::kControlHighImpedance:
      selection = XIAO_NRF54L15_ANTENNA_CONTROL_HIZ;
      break;
    case BoardAntennaPath::kCeramic:
    default:
      selection = XIAO_NRF54L15_ANTENNA_CERAMIC;
      break;
  }
  xiaoNrf54l15SetAntenna(selection);
  g_boardAntennaPath = path;
  return true;
}

BoardAntennaPath BoardControl::antennaPath() {
  switch (xiaoNrf54l15GetAntenna()) {
    case XIAO_NRF54L15_ANTENNA_EXTERNAL:
      g_boardAntennaPath = BoardAntennaPath::kExternal;
      break;
    case XIAO_NRF54L15_ANTENNA_CONTROL_HIZ:
      g_boardAntennaPath = BoardAntennaPath::kControlHighImpedance;
      break;
    case XIAO_NRF54L15_ANTENNA_CERAMIC:
    default:
      g_boardAntennaPath = BoardAntennaPath::kCeramic;
      break;
  }
  return g_boardAntennaPath;
}

bool BoardControl::setImuMicEnabled(bool enable) {
  return arduinoXiaoNrf54l15SetImuMicEnable(enable ? 1U : 0U) != 0U;
}

bool BoardControl::imuMicEnabled() {
  return arduinoXiaoNrf54l15GetImuMicEnable() != 0U;
}

bool BoardControl::setRfSwitchPowerEnabled(bool enable) {
  return arduinoXiaoNrf54l15SetRfSwitchPower(enable ? 1U : 0U) != 0U;
}

bool BoardControl::rfSwitchPowerEnabled() {
  return arduinoXiaoNrf54l15GetRfSwitchPower() != 0U;
}

bool BoardControl::enableRfPath(BoardAntennaPath path) {
  return setRfSwitchPowerEnabled(true) && setAntennaPath(path);
}

bool BoardControl::collapseRfPathIdle(BoardAntennaPath idlePath,
                                      bool disablePower) {
  const bool pathOk = setAntennaPath(idlePath);
  if (!disablePower) {
    return pathOk;
  }
  return setRfSwitchPowerEnabled(false) && pathOk;
}

void BoardControl::enterLowestPowerState() {
  xiaoNrf54l15EnterLowestPowerBoardState();
}

bool BoardControl::setBatterySenseEnabled(bool enable) {
  if (!Gpio::configure(kPinVbatEnable, GpioDirection::kOutput,
                       GpioPull::kDisabled)) {
    return false;
  }
  return Gpio::write(kPinVbatEnable, enable);
}

bool BoardControl::sampleBatteryMilliVolts(int32_t* outMilliVolts,
                                           uint32_t settleDelayUs,
                                           uint32_t spinLimit) {
  if (outMilliVolts == nullptr) {
    return false;
  }

  Saadc adc(nrf54l15::SAADC_BASE);
  if (!adc.begin(AdcResolution::k12bit, spinLimit)) {
    return false;
  }

  bool ok = setBatterySenseEnabled(true);
  if (ok && settleDelayUs > 0U) {
    delayMicroseconds(settleDelayUs);
  }

  int32_t halfMilliVolts = 0;
  if (ok) {
    ok = adc.configureSingleEnded(0U, kPinVbatSense, AdcGain::k2over8) &&
         adc.sampleMilliVolts(&halfMilliVolts, spinLimit);
  }

  const bool disableOk = setBatterySenseEnabled(false);
  adc.end();

  if (!ok || !disableOk) {
    return false;
  }

  *outMilliVolts = halfMilliVolts * 2;
  return true;
}

bool BoardControl::sampleBatteryPercent(uint8_t* outPercent,
                                        int32_t emptyMilliVolts,
                                        int32_t fullMilliVolts,
                                        uint32_t settleDelayUs,
                                        uint32_t spinLimit) {
  if (outPercent == nullptr || fullMilliVolts <= emptyMilliVolts) {
    return false;
  }

  int32_t batteryMv = 0;
  if (!sampleBatteryMilliVolts(&batteryMv, settleDelayUs, spinLimit)) {
    return false;
  }

  if (batteryMv <= emptyMilliVolts) {
    *outPercent = 0U;
    return true;
  }
  if (batteryMv >= fullMilliVolts) {
    *outPercent = 100U;
    return true;
  }

  const int32_t span = fullMilliVolts - emptyMilliVolts;
  const int32_t scaled = (batteryMv - emptyMilliVolts) * 100 + (span / 2);
  const int32_t percent = scaled / span;
  *outPercent = static_cast<uint8_t>(percent);
  return true;
}

PowerManager::PowerManager(uint32_t powerBase, uint32_t resetBase,
                           uint32_t regulatorsBase)
    : power_(reinterpret_cast<NRF_POWER_Type*>(static_cast<uintptr_t>(powerBase))),
      reset_(reinterpret_cast<NRF_RESET_Type*>(static_cast<uintptr_t>(resetBase))),
      regulators_(reinterpret_cast<NRF_REGULATORS_Type*>(
          static_cast<uintptr_t>(regulatorsBase))) {}

void PowerManager::setLatencyMode(PowerLatencyMode mode) {
  if (mode == PowerLatencyMode::kConstantLatency) {
    power_->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
  } else {
    power_->TASKS_LOWPWR = POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger;
  }
}

bool PowerManager::isConstantLatency() const {
  return (power_->CONSTLATSTAT & 0x1UL) != 0U;
}

bool PowerManager::setRetention(uint8_t index, uint8_t value) {
  if (index >= 2U) {
    return false;
  }
  power_->GPREGRET[index] = static_cast<uint32_t>(value);
  return true;
}

bool PowerManager::getRetention(uint8_t index, uint8_t* value) const {
  if (index >= 2U || value == nullptr) {
    return false;
  }
  *value = static_cast<uint8_t>(power_->GPREGRET[index] & POWER_GPREGRET_GPREGRET_Msk);
  return true;
}

