lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  NVIC_SetPriority(I2S20_IRQn, config_.irqPriority);
  NVIC_EnableIRQ(I2S20_IRQn);

  nextBufferIndex_ = 1U;
  configured_ = true;
  running_ = false;
  restartPending_ = false;
  rxPtrUpdCount_ = 0U;
  stoppedCount_ = 0U;
  restartCount_ = 0U;
  manualStopCount_ = 0U;
  return true;
}

void I2sRx::end() {
  if (!configured_ || i2s_ == nullptr) {
    return;
  }

  i2s_->INTENCLR = I2S_INTENCLR_RXPTRUPD_Msk | I2S_INTENCLR_STOPPED_Msk;
  i2s_->TASKS_STOP = I2S_TASKS_STOP_TASKS_STOP_Trigger;
  waitForNonZero(&i2s_->EVENTS_STOPPED, 300000UL);
  i2s_->ENABLE = (I2S_ENABLE_ENABLE_Disabled << I2S_ENABLE_ENABLE_Pos) &
                 I2S_ENABLE_ENABLE_Msk;
  i2s_->PSEL.MCK = PSEL_DISCONNECTED;
  i2s_->PSEL.SCK = PSEL_DISCONNECTED;
  i2s_->PSEL.LRCK = PSEL_DISCONNECTED;
  i2s_->PSEL.SDIN = PSEL_DISCONNECTED;
  i2s_->PSEL.SDOUT = PSEL_DISCONNECTED;
  if (g_activeI2sRx == this) {
    g_activeI2sRx = nullptr;
  }
  configured_ = false;
  running_ = false;
  restartPending_ = false;
}

bool I2sRx::start() {
  if (!configured_ || i2s_ == nullptr) {
    return false;
  }

  clearEvents();
  nextBufferIndex_ = 1U;
  armBuffer(0U);
  i2s_->INTENSET = I2S_INTENSET_RXPTRUPD_Msk | I2S_INTENSET_STOPPED_Msk;
  running_ = true;
  restartPending_ = false;
  i2s_->TASKS_START = I2S_TASKS_START_TASKS_START_Trigger;
  return true;
}

bool I2sRx::stop() {
  if (!configured_ || !running_ || i2s_ == nullptr) {
    return false;
  }

  ++manualStopCount_;
  i2s_->TASKS_STOP = I2S_TASKS_STOP_TASKS_STOP_Trigger;
  return true;
}

void I2sRx::service() {
  if (restartPending_ && config_.autoRestart) {
    restartPending_ = false;
    ++restartCount_;
    (void)start();
  }
}

void I2sRx::onIrq() {
  if (!configured_ || i2s_ == nullptr) {
    return;
  }

  if (i2s_->EVENTS_RXPTRUPD != 0U) {
    i2s_->EVENTS_RXPTRUPD = 0U;
    const uint8_t queuedIndex = nextBufferIndex_;
    armBuffer(queuedIndex);
    nextBufferIndex_ ^= 1U;
    if (receiveCallback_ != nullptr) {
      receiveCallback_(buffers_[nextBufferIndex_], wordCount_, receiveContext_);
    }
    ++rxPtrUpdCount_;
  }

  if (i2s_->EVENTS_STOPPED != 0U) {
    i2s_->EVENTS_STOPPED = 0U;
    running_ = false;
    restartPending_ = true;
    ++stoppedCount_;
  }
}

bool I2sRx::makeActive() {
  if (!configured_) {
    return false;
  }
  g_activeI2sDuplex = nullptr;
  g_activeI2sTx = nullptr;
  g_activeI2sRx = this;
  return true;
}

void I2sRx::irqHandler() {
  if (g_activeI2sRx != nullptr) {
    g_activeI2sRx->onIrq();
  }
}

bool I2sRx::configured() const { return configured_; }

bool I2sRx::running() const { return running_; }

bool I2sRx::restartPending() const { return restartPending_; }

uint32_t I2sRx::rxPtrUpdCount() const { return rxPtrUpdCount_; }

uint32_t I2sRx::stoppedCount() const { return stoppedCount_; }

uint32_t I2sRx::restartCount() const { return restartCount_; }

uint32_t I2sRx::manualStopCount() const { return manualStopCount_; }

void I2sRx::clearEvents() {
  i2s_->EVENTS_RXPTRUPD = 0U;
  i2s_->EVENTS_STOPPED = 0U;
}

void I2sRx::armBuffer(uint8_t bufferIndex) {
  const uint8_t index = bufferIndex & 1U;
  i2s_->RXD.PTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(buffers_[index])) &
      I2S_RXD_PTR_PTR_Msk;
}

I2sDuplex::I2sDuplex(uint32_t base)
    : i2s_(reinterpret_cast<NRF_I2S_Type*>(static_cast<uintptr_t>(base))),
      config_(),
      txBuffers_{nullptr, nullptr},
      rxBuffers_{nullptr, nullptr},
      wordCount_(0U),
      txRefillCallback_(nullptr),
      txRefillContext_(nullptr),
      rxReceiveCallback_(nullptr),
      rxReceiveContext_(nullptr),
      nextTxBufferIndex_(1U),
      nextRxBufferIndex_(1U),
      configured_(false),
      running_(false),
      restartPending_(false),
      txPtrUpdCount_(0U),
      rxPtrUpdCount_(0U),
      stoppedCount_(0U),
      restartCount_(0U),
      manualStopCount_(0U) {}

bool I2sDuplex::setTxBuffers(uint32_t* buffer0, uint32_t* buffer1,
                             uint32_t wordCount) {
  if (buffer0 == nullptr || buffer1 == nullptr || wordCount == 0U) {
    return false;
  }
  if ((reinterpret_cast<uintptr_t>(buffer0) & 0x3U) != 0U ||
      (reinterpret_cast<uintptr_t>(buffer1) & 0x3U) != 0U) {
    return false;
  }
  if (wordCount >
      (I2S_RXTXD_MAXCNT_MAXCNT_Msk >> I2S_RXTXD_MAXCNT_MAXCNT_Pos)) {
    return false;
  }

  txBuffers_[0] = buffer0;
  txBuffers_[1] = buffer1;
  wordCount_ = wordCount;
  return true;
}

bool I2sDuplex::setRxBuffers(uint32_t* buffer0, uint32_t* buffer1,
                             uint32_t wordCount) {
  if (buffer0 == nullptr || buffer1 == nullptr || wordCount == 0U) {
    return false;
  }
  if ((reinterpret_cast<uintptr_t>(buffer0) & 0x3U) != 0U ||
      (reinterpret_cast<uintptr_t>(buffer1) & 0x3U) != 0U) {
    return false;
  }
  if (wordCount >
      (I2S_RXTXD_MAXCNT_MAXCNT_Msk >> I2S_RXTXD_MAXCNT_MAXCNT_Pos)) {
    return false;
  }
  if (wordCount_ != 0U && wordCount_ != wordCount) {
    return false;
  }

  rxBuffers_[0] = buffer0;
  rxBuffers_[1] = buffer1;
  wordCount_ = wordCount;
  return true;
}

void I2sDuplex::setTxRefillCallback(TxRefillCallback callback, void* context) {
  txRefillCallback_ = callback;
  txRefillContext_ = context;
}

void I2sDuplex::setRxReceiveCallback(RxReceiveCallback callback, void* context) {
  rxReceiveCallback_ = callback;
  rxReceiveContext_ = context;
}

bool I2sDuplex::begin(const I2sDuplexConfig& config, uint32_t* txBuffer0,
                      uint32_t* txBuffer1, uint32_t* rxBuffer0,
                      uint32_t* rxBuffer1, uint32_t wordCount) {
  if (i2s_ == nullptr ||
      !setTxBuffers(txBuffer0, txBuffer1, wordCount) ||
      !setRxBuffers(rxBuffer0, rxBuffer1, wordCount)) {
    return false;
  }
  if (!isConnected(config.mck) || !isConnected(config.sck) ||
      !isConnected(config.lrck) || !isConnected(config.sdin) ||
      !isConnected(config.sdout)) {
    return false;
  }
  if (!Gpio::configure(config.mck, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(config.sck, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(config.lrck, GpioDirection::kOutput, GpioPull::kDisabled) ||
      !Gpio::configure(config.sdin, GpioDirection::kInput, GpioPull::kDisabled) ||
      !Gpio::configure(config.sdout, GpioDirection::kOutput, GpioPull::kDisabled)) {
    return false;
  }

