lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  uint32_t pcnf0 = 0U;
  pcnf0 |= (8UL << RADIO_PCNF0_LFLEN_Pos) & RADIO_PCNF0_LFLEN_Msk;
  pcnf0 |= (0UL << RADIO_PCNF0_S0LEN_Pos) & RADIO_PCNF0_S0LEN_Msk;
  pcnf0 |= (0UL << RADIO_PCNF0_S1LEN_Pos) & RADIO_PCNF0_S1LEN_Msk;
  pcnf0 |= (RADIO_PCNF0_S1INCL_Automatic << RADIO_PCNF0_S1INCL_Pos) &
           RADIO_PCNF0_S1INCL_Msk;
  pcnf0 |= (RADIO_PCNF0_PLEN_32bitZero << RADIO_PCNF0_PLEN_Pos) &
           RADIO_PCNF0_PLEN_Msk;
  pcnf0 |= (RADIO_PCNF0_CRCINC_Exclude << RADIO_PCNF0_CRCINC_Pos) &
           RADIO_PCNF0_CRCINC_Msk;
  pcnf0 |= (0UL << RADIO_PCNF0_TERMLEN_Pos) & RADIO_PCNF0_TERMLEN_Msk;
  radio_->PCNF0 = pcnf0;

  uint32_t pcnf1 = 0U;
  pcnf1 |= (127UL << RADIO_PCNF1_MAXLEN_Pos) & RADIO_PCNF1_MAXLEN_Msk;
  pcnf1 |= (0UL << RADIO_PCNF1_STATLEN_Pos) & RADIO_PCNF1_STATLEN_Msk;
  pcnf1 |= (0UL << RADIO_PCNF1_BALEN_Pos) & RADIO_PCNF1_BALEN_Msk;
  pcnf1 |= (RADIO_PCNF1_ENDIAN_Little << RADIO_PCNF1_ENDIAN_Pos) &
           RADIO_PCNF1_ENDIAN_Msk;
  pcnf1 |= (RADIO_PCNF1_WHITEEN_Disabled << RADIO_PCNF1_WHITEEN_Pos) &
           RADIO_PCNF1_WHITEEN_Msk;
  pcnf1 |= (RADIO_PCNF1_WHITEOFFSET_Include << RADIO_PCNF1_WHITEOFFSET_Pos) &
           RADIO_PCNF1_WHITEOFFSET_Msk;
  radio_->PCNF1 = pcnf1;

  uint32_t crccnf = 0U;
  crccnf |= (RADIO_CRCCNF_LEN_Two << RADIO_CRCCNF_LEN_Pos) &
            RADIO_CRCCNF_LEN_Msk;
  crccnf |= (RADIO_CRCCNF_SKIPADDR_Ieee802154 << RADIO_CRCCNF_SKIPADDR_Pos) &
            RADIO_CRCCNF_SKIPADDR_Msk;
  radio_->CRCCNF = crccnf;
  radio_->CRCPOLY = (0x11021UL & RADIO_CRCPOLY_CRCPOLY_Msk);
  radio_->CRCINIT = 0U;

  // IEEE 802.15.4 SFD, CCA and ED defaults.
  radio_->SFD = 0xA7U;
  radio_->EDCTRL = RADIO_EDCTRL_ResetValue;
  radio_->CCACTRL = RADIO_CCACTRL_ResetValue;

  clearRadioCoreEvents(radio_);
  radio_->EVENTS_FRAMESTART = 0U;
  radio_->EVENTS_MHRMATCH = 0U;
  radio_->EVENTS_EDEND = 0U;
  radio_->EVENTS_CCAIDLE = 0U;
  radio_->EVENTS_CCABUSY = 0U;
  radio_->EVENTS_CCASTOPPED = 0U;
  return true;
}

bool ZigbeeRadio::begin(uint8_t channel, int8_t txPowerDbm) {
  if (radio_ == nullptr) {
    initialized_ = false;
    return false;
  }

  if (!ClockControl::startHfxo(true, 1500000UL)) {
    initialized_ = false;
    return false;
  }
  if (!configureIeee802154()) {
    initialized_ = false;
    return false;
  }
  if (!setChannel(channel)) {
    initialized_ = false;
    return false;
  }
  if (!setTxPowerDbm(txPowerDbm)) {
    initialized_ = false;
    return false;
  }

  initialized_ = true;
  return true;
}

void ZigbeeRadio::end() {
  if (radio_ == nullptr) {
    initialized_ = false;
    return;
  }

  radio_->SHORTS = 0U;
  radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
  waitRadioDisabledBudgeted(radio_, 0U, 200000UL);
  clearRadioCoreEvents(radio_);
  radio_->EVENTS_FRAMESTART = 0U;
  radio_->EVENTS_MHRMATCH = 0U;
  radio_->EVENTS_EDEND = 0U;
  radio_->EVENTS_CCAIDLE = 0U;
  radio_->EVENTS_CCABUSY = 0U;
  radio_->EVENTS_CCASTOPPED = 0U;
  initialized_ = false;
}

bool ZigbeeRadio::setChannel(uint8_t channel) {
  if (radio_ == nullptr || !ieee802154ChannelValid(channel)) {
    return false;
  }

  const uint8_t freq = ieee802154ChannelToFrequency(channel);
  radio_->FREQUENCY =
      ((static_cast<uint32_t>(freq) << RADIO_FREQUENCY_FREQUENCY_Pos) &
       RADIO_FREQUENCY_FREQUENCY_Msk) |
      (0UL << RADIO_FREQUENCY_MAP_Pos);

  channel_ = channel;
  return true;
}

uint8_t ZigbeeRadio::channel() const { return channel_; }

bool ZigbeeRadio::setTxPowerDbm(int8_t dbm) {
  if (radio_ == nullptr) {
    return false;
  }
  const uint32_t regValue = radioTxPowerRegFromDbm(dbm);
  radio_->TXPOWER = ((regValue << RADIO_TXPOWER_TXPOWER_Pos) &
                     RADIO_TXPOWER_TXPOWER_Msk);
  return true;
}

bool ZigbeeRadio::performCcaCheck(uint32_t spinLimit) {
  if (radio_ == nullptr) {
    return false;
  }
  if (spinLimit == 0U) {
    spinLimit = 1U;
  }

  clearRadioCoreEvents(radio_);
  radio_->EVENTS_CCAIDLE = 0U;
  radio_->EVENTS_CCABUSY = 0U;
  radio_->EVENTS_CCASTOPPED = 0U;
  radio_->PACKETPTR = reinterpret_cast<uint32_t>(rxPacket_);
  radio_->SHORTS =
      ((RADIO_SHORTS_RXREADY_START_Enabled << RADIO_SHORTS_RXREADY_START_Pos) &
       RADIO_SHORTS_RXREADY_START_Msk);
  radio_->EVENTS_READY = 0U;
  radio_->TASKS_RXEN = RADIO_TASKS_RXEN_TASKS_RXEN_Trigger;
  if (!waitForNonZero(&radio_->EVENTS_READY, spinLimit)) {
    radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
    waitRadioDisabledBudgeted(radio_, 0U, spinLimit);
    radio_->SHORTS = 0U;
    return false;
  }

  radio_->TASKS_CCASTART = RADIO_TASKS_CCASTART_TASKS_CCASTART_Trigger;
  bool idle = false;
  uint32_t spins = spinLimit;
  while (spins-- > 0U) {
    if (radio_->EVENTS_CCAIDLE != 0U) {
      idle = true;
      break;
    }
    if (radio_->EVENTS_CCABUSY != 0U || radio_->EVENTS_CCASTOPPED != 0U) {
      idle = false;
      break;
    }
  }

  radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
  waitRadioDisabledBudgeted(radio_, 0U, spinLimit);
  radio_->SHORTS = 0U;
  return idle;
}

bool ZigbeeRadio::transmit(const uint8_t* psdu, uint8_t length, bool performCca,
                           uint32_t spinLimit) {
  if (!initialized_ || radio_ == nullptr || psdu == nullptr) {
    return false;
  }
  if (length == 0U || length > 127U) {
    return false;
  }

  if (performCca && !performCcaCheck(spinLimit / 2U + 1U)) {
    return false;
  }

  txPacket_[0] = length;
  memcpy(&txPacket_[1], psdu, length);

  clearRadioCoreEvents(radio_);
  radio_->EVENTS_FRAMESTART = 0U;
  radio_->PACKETPTR = reinterpret_cast<uint32_t>(txPacket_);
  radio_->SHORTS =
      ((RADIO_SHORTS_TXREADY_START_Enabled << RADIO_SHORTS_TXREADY_START_Pos) &
       RADIO_SHORTS_TXREADY_START_Msk) |
      ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
       RADIO_SHORTS_PHYEND_DISABLE_Msk);

  radio_->TASKS_TXEN = RADIO_TASKS_TXEN_TASKS_TXEN_Trigger;
  const bool endSeen = waitRadioEndBudgeted(radio_, 12000U, spinLimit);

  radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
  const bool disabled = waitRadioDisabledBudgeted(radio_, 3000U, spinLimit);
  radio_->SHORTS = 0U;
  clearRadioCoreEvents(radio_);
  return endSeen && disabled;
}

bool ZigbeeRadio::receive(ZigbeeFrame* frame, uint32_t listenWindowUs,
                          uint32_t spinLimit) {
  if (!initialized_ || radio_ == nullptr || frame == nullptr) {
    return false;
  }

