lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  writeLe16(&outPsdu[0], frameControl);
  outPsdu[2] = sequence;
  writeLe16(&outPsdu[3], panId);
  writeLe16(&outPsdu[5], destinationShort);
  writeLe16(&outPsdu[7], sourceShort);
  if (payloadLength > 0U) {
    memcpy(&outPsdu[kHeaderLen], payload, payloadLength);
  }
  *outLength = static_cast<uint8_t>(kHeaderLen + payloadLength);
  return true;
}

bool ZigbeeRadio::buildMacCommandFrameShort(
    uint8_t sequence, uint16_t panId, uint16_t destinationShort,
    uint16_t sourceShort, uint8_t commandId, const uint8_t* payload,
    uint8_t payloadLength, uint8_t* outPsdu, uint8_t* outLength,
    bool requestAck) {
  if (outPsdu == nullptr || outLength == nullptr) {
    return false;
  }
  if (payloadLength > 0U && payload == nullptr) {
    return false;
  }

  // MAC command frame with PAN compression, destination short, source short.
  // Header layout: FCF(2), Seq(1), DstPAN(2), DstShort(2), SrcShort(2),
  // CommandId(1).
  constexpr uint8_t kHeaderLen = 10U;
  if (payloadLength > static_cast<uint8_t>(127U - kHeaderLen)) {
    return false;
  }

  uint16_t frameControl = 0x9843U;
  if (requestAck) {
    frameControl |= (1U << 5U);
  }

  writeLe16(&outPsdu[0], frameControl);
  outPsdu[2] = sequence;
  writeLe16(&outPsdu[3], panId);
  writeLe16(&outPsdu[5], destinationShort);
  writeLe16(&outPsdu[7], sourceShort);
  outPsdu[9] = commandId;
  if (payloadLength > 0U) {
    memcpy(&outPsdu[kHeaderLen], payload, payloadLength);
  }
  *outLength = static_cast<uint8_t>(kHeaderLen + payloadLength);
  return true;
}

bool ZigbeeRadio::parseDataFrameShort(const uint8_t* psdu, uint8_t length,
                                      ZigbeeDataFrameView* outView) {
  if (outView != nullptr) {
    memset(outView, 0, sizeof(*outView));
  }
  if (psdu == nullptr || outView == nullptr || length < 9U) {
    return false;
  }

  const uint16_t frameControl = readLe16(&psdu[0]);
  const uint8_t frameType = static_cast<uint8_t>(frameControl & 0x0007U);
  const bool panCompression = ((frameControl >> 6U) & 0x1U) != 0U;
  const uint8_t dstAddrMode = static_cast<uint8_t>((frameControl >> 10U) & 0x03U);
  const uint8_t srcAddrMode = static_cast<uint8_t>((frameControl >> 14U) & 0x03U);

  if (frameType != 0x01U || dstAddrMode != 0x02U || srcAddrMode != 0x02U) {
    return false;
  }

  uint8_t offset = 3U;
  if (length < static_cast<uint8_t>(offset + 2U + 2U)) {
    return false;
  }
  const uint16_t destinationPan = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);
  const uint16_t destinationShort = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);

  uint16_t sourcePan = destinationPan;
  if (!panCompression) {
    if (length < static_cast<uint8_t>(offset + 2U)) {
      return false;
    }
    sourcePan = readLe16(&psdu[offset]);
    offset = static_cast<uint8_t>(offset + 2U);
  }

  if (length < static_cast<uint8_t>(offset + 2U)) {
    return false;
  }
  const uint16_t sourceShort = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);
  if (length < offset) {
    return false;
  }

  outView->valid = true;
  outView->ackRequested = ((frameControl >> 5U) & 0x1U) != 0U;
  outView->sequence = psdu[2];
  outView->panId = sourcePan;
  outView->destinationShort = destinationShort;
  outView->sourceShort = sourceShort;
  outView->payloadLength = static_cast<uint8_t>(length - offset);
  outView->payload = &psdu[offset];
  return true;
}

bool ZigbeeRadio::parseMacCommandFrameShort(const uint8_t* psdu, uint8_t length,
                                            ZigbeeMacCommandView* outView) {
  if (outView != nullptr) {
    memset(outView, 0, sizeof(*outView));
  }
  if (psdu == nullptr || outView == nullptr || length < 10U) {
    return false;
  }

  const uint16_t frameControl = readLe16(&psdu[0]);
  const uint8_t frameType = static_cast<uint8_t>(frameControl & 0x0007U);
  const bool panCompression = ((frameControl >> 6U) & 0x1U) != 0U;
  const uint8_t dstAddrMode = static_cast<uint8_t>((frameControl >> 10U) & 0x03U);
  const uint8_t srcAddrMode = static_cast<uint8_t>((frameControl >> 14U) & 0x03U);

  if (frameType != 0x03U || dstAddrMode != 0x02U || srcAddrMode != 0x02U) {
    return false;
  }

  uint8_t offset = 3U;
  if (length < static_cast<uint8_t>(offset + 2U + 2U)) {
    return false;
  }
  const uint16_t destinationPan = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);
  const uint16_t destinationShort = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);

  uint16_t sourcePan = destinationPan;
  if (!panCompression) {
    if (length < static_cast<uint8_t>(offset + 2U)) {
      return false;
    }
    sourcePan = readLe16(&psdu[offset]);
    offset = static_cast<uint8_t>(offset + 2U);
  }

  if (length < static_cast<uint8_t>(offset + 2U + 1U)) {
    return false;
  }
  const uint16_t sourceShort = readLe16(&psdu[offset]);
  offset = static_cast<uint8_t>(offset + 2U);
  const uint8_t commandId = psdu[offset];
  offset = static_cast<uint8_t>(offset + 1U);

  outView->valid = true;
  outView->ackRequested = ((frameControl >> 5U) & 0x1U) != 0U;
  outView->sequence = psdu[2];
  outView->panId = sourcePan;
  outView->destinationShort = destinationShort;
  outView->sourceShort = sourceShort;
  outView->commandId = commandId;
  outView->payloadLength = static_cast<uint8_t>(length - offset);
  outView->payload = &psdu[offset];
  return true;
}

BleRadio::BleRadio(uint32_t radioBase, uint32_t ficrBase)
    : radio_(reinterpret_cast<NRF_RADIO_Type*>(static_cast<uintptr_t>(radioBase))),
      ficr_(reinterpret_cast<NRF_FICR_Type*>(static_cast<uintptr_t>(ficrBase))),
      initialized_(false),
      addressType_(BleAddressType::kRandomStatic),
      pduType_(BleAdvPduType::kAdvInd),
      useChSel2_(true),
      externalAntenna_(false),
      address_{0},
      advData_{0},
      advDataLen_(0),
      scanRspData_{0},
      scanRspDataLen_(0),
      txPacket_{0},
      scanRspPacket_{0},
      rxPacket_{0},
      connectionTxPayload_{0},
      connected_(false),
      connectionPeerAddress_{0},
      connectionPeerAddressRandom_(false),
      connectionAccessAddress_(0),
      connectionCrcInit_(0),
      connectionIntervalUnits_(0),
      connectionLatency_(0),
      connectionTimeoutUnits_(0),
      connectionChannelMap_{0},
      connectionChannelCount_(0),
      connectionHop_(0),
      connectionUseChSel2_(false),
      connectionChannelId_(0U),
      connectionSca_(0),
      connectionChanUse_(0),
      connectionExpectedRxSn_(0),
      connectionTxSn_(0),
      connectionLastTxSn_(0),
      connectionTxHistoryValid_(false),
      connectionEventCounter_(0),
      connectionMissedEventCount_(0U),
      connectionNextEventUs_(0),
      connectionFirstEventListenUs_(0),
      connectionSyncAttemptsRemaining_(0U),
      connectionAttMtu_(kBleDefaultAttMtu),
      connectionLastTxLlid_(0x01U),
      connectionLastTxLength_(0),
      connectionLastTxPlainLlid_(0x01U),
      connectionLastTxPlainLength_(0U),
      connectionLastTxPlainPayload_{0},
      connectionPendingTxLlid_(0x01U),
      connectionPendingTxLength_(0U),
      connectionPendingTxValid_(false),
      connectionPendingTxPayload_{0},
      connectionUpdatePending_(false),
      connectionUpdateInstant_(0U),
      connectionPendingIntervalUnits_(0U),
      connectionPendingLatency_(0U),
      connectionPendingTimeoutUnits_(0U),
      connectionChannelMapPending_(false),
      connectionChannelMapInstant_(0U),
      connectionPendingChannelMap_{0},
      connectionPendingChannelCount_(0U),
      connectionServiceChangedIndicationsEnabled_(false),
      connectionServiceChangedIndicationPending_(false),
      connectionServiceChangedIndicationAwaitingConfirm_(false),
      connectionBatteryNotificationsEnabled_(false),
      connectionBatteryNotificationPending_(false),
      connectionPreparedWriteActive_(false),
      connectionPreparedWriteHandle_(0U),
      connectionPreparedWriteValue_{0},
      connectionPreparedWriteMask_(0U),
      smpPairingState_(kSmpPairingStateIdle),
      smpPairingReq_{0},
      smpPairingRsp_{0},
      smpPeerConfirm_{0},
      smpPeerRandom_{0},
      smpLocalRandom_{0},
      smpLocalConfirm_{0},
      smpStk_{0},
      smpStkValid_(false),
      connectionEncSessionValid_(false),
      connectionEncRxEnabled_(false),
      connectionEncTxEnabled_(false),
      connectionEncStartReqPending_(false),
      connectionEncStartReqTxPending_(false),
      connectionEncAwaitingStartRsp_(false),
      connectionEncEnableTxOnNextEvent_(false),
      connectionEncRxCounter_(0ULL),
      connectionEncTxCounter_(0ULL),
      connectionEncKeyDerivationPending_(false),
      connectionEncSkd_{0},
      connectionEncSessionKey_{0},
      connectionEncSessionKeyAlt_{0},
      connectionEncAltKeyValid_(false),
      connectionEncRxDirection_(1U),
      connectionEncTxDirection_(0U),
      connectionEncIv_{0},
      connectionLastTxWasEncrypted_(false),
      connectionLastTxEncryptedLength_(0U),
      connectionLastTxEncryptedPayload_{0},
      connectionEncPrecomputedEmptyValid_(false),
      connectionEncPrecomputedCounter_(0ULL),
      connectionEncPrecomputedPayload_{0},
      connectionEncPrecomputedStartRspValid_(false),
      connectionEncPrecomputedStartRsp_{0},
      connectionEncPrecomputedStartRspTxValid_(false),
      connectionEncPrecomputedStartRspTxCounter_(0ULL),
      connectionEncPrecomputedStartRspTx_{0},
      bondLoadCallback_(nullptr),
      bondSaveCallback_(nullptr),
      bondClearCallback_(nullptr),
      bondCallbackContext_(nullptr),
      bondRecord_{},
      bondRecordValid_(false),
      bondStorageLoaded_(false),
      bondKeyPrimedForConnection_(false),
      traceCallback_(nullptr),
      traceCallbackContext_(nullptr),
      smpBondingRequested_(false),
      smpExpectInitiatorEncKey_(false),
      smpPeerLtkValid_(false),
      smpPeerLtkAwaitMasterId_(false),
      smpPeerLtk_{0},
      smpEncReqRand_{0},
      smpEncReqEdiv_(0U),
      smpKeySize_(16U),
      advCycleStartIndex_(0U),
      scanCycleStartIndex_(0U),
      gapDeviceName_{0},
      gapDeviceNameLen_(0),
      gapAppearance_(0),
      gapPpcpIntervalMin_(kBlePreferredConnIntervalMinUnits),
      gapPpcpIntervalMax_(kBlePreferredConnIntervalMaxUnits),
      gapPpcpLatency_(kBlePreferredConnLatency),
      gapPpcpTimeout_(kBlePreferredConnTimeoutUnits),
      gapBatteryLevel_(100U),
      customGattServices_{},
      customGattCharacteristics_{},
      customGattServiceCount_(0U),
      customGattCharacteristicCount_(0U),
      customGattNextHandle_(kCustomGattHandleStart),
      connectionCustomNotificationPending_(false),
      connectionCustomPendingCharIndex_(0xFFU),
      connectionCustomPendingIndication_(false),
      connectionCustomIndicationAwaitingHandle_(0U),
      customGattWriteCallback_(nullptr),
      customGattWriteContext_(nullptr),
      encDebug_{} {}

bool BleRadio::begin(int8_t txPowerDbm) {
  connected_ = false;
  advCycleStartIndex_ = 0U;
  scanCycleStartIndex_ = 0U;
  clearCustomGattConnectionState();

#if defined(NRF54L15_CLEAN_BLE_ENABLED) && (NRF54L15_CLEAN_BLE_ENABLED == 0)
  (void)txPowerDbm;
  initialized_ = false;
  return false;
#endif

  // Observe the current RF switch routing without overriding sketch-managed
  // GPIO state. Tools > Antenna still sets the startup default in initVariant().
  g_boardAntennaPath = BoardControl::antennaPath();
  externalAntenna_ = (g_boardAntennaPath == BoardAntennaPath::kExternal);

  if (!ClockControl::startHfxo(true, 1500000UL)) {
    return false;
  }

  if (!configureBle1M()) {
    return false;
  }
  if (!setTxPowerDbm(txPowerDbm)) {
    return false;
  }

  uint8_t fallbackAddress[6] = {0xC0, 0x54, 0x15, 0x00, 0x00, 0x00};
  if (!loadAddressFromFicr(true)) {
    if (!setDeviceAddress(fallbackAddress, BleAddressType::kRandomStatic)) {
      return false;
    }
  }

  if (advDataLen_ == 0U) {
    if (!setAdvertisingName("XIAO-nRF54L15", true)) {
      return false;
    }
  } else if (!buildAdvertisingPacket()) {
    return false;
  }

  if (scanRspDataLen_ == 0U) {
    if (!setScanResponseName("XIAO-nRF54L15")) {
      return false;
    }
  } else if (!buildScanResponsePacket()) {
    return false;
  }

  if (gapDeviceNameLen_ == 0U) {
    if (!setGattDeviceName("XIAO-nRF54L15")) {
      return false;
    }
  }

  loadBondRecordFromPersistence();
  initialized_ = true;
  return true;
}

void BleRadio::end() {
  if (radio_ == nullptr) {
    connected_ = false;
    initialized_ = false;
    clearCustomGattConnectionState();
    return;
  }

  radio_->SHORTS = 0U;
  radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
  waitDisabled(120000UL);
  clearRadioCoreEvents(radio_);
  connected_ = false;
  initialized_ = false;
  clearCustomGattConnectionState();
}

bool BleRadio::setTxPowerDbm(int8_t dbm) {
  if (radio_ == nullptr) {
    return false;
  }
  const uint32_t regValue = txPowerRegFromDbm(dbm);
  radio_->TXPOWER = ((regValue << RADIO_TXPOWER_TXPOWER_Pos) &
                     RADIO_TXPOWER_TXPOWER_Msk);
  return true;
}

bool BleRadio::selectExternalAntenna(bool external) {
  if (!Gpio::configure(kPinRfSwitchCtl, GpioDirection::kOutput,
                       GpioPull::kDisabled)) {
    return false;
  }
  if (!Gpio::write(kPinRfSwitchCtl, external)) {
    return false;
  }

  externalAntenna_ = external;
  return true;
}

bool BleRadio::loadAddressFromFicr(bool forceRandomStatic) {
  if (ficr_ == nullptr) {
    return false;
  }

  const uint32_t lo = ficr_->DEVICEADDR[0];
  const uint32_t hi = ficr_->DEVICEADDR[1];

  uint8_t address[6];
  address[0] = static_cast<uint8_t>(lo & 0xFFU);
  address[1] = static_cast<uint8_t>((lo >> 8U) & 0xFFU);
  address[2] = static_cast<uint8_t>((lo >> 16U) & 0xFFU);
  address[3] = static_cast<uint8_t>((lo >> 24U) & 0xFFU);
  address[4] = static_cast<uint8_t>(hi & 0xFFU);
  address[5] = static_cast<uint8_t>((hi >> 8U) & 0xFFU);

