lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
bool BleRadio::addCustomGattServiceUuid(const uint8_t* uuidBytes, uint8_t uuidLength,
                                        uint16_t* outServiceHandle) {
  if (connected_ || uuidBytes == nullptr ||
      customGattServiceCount_ >= kCustomGattMaxServices) {
    return false;
  }
  if (uuidLength != kBleUuidLength16 && uuidLength != kBleUuidLength128) {
    return false;
  }
  if (customGattNextHandle_ > kCustomGattHandleEnd) {
    return false;
  }

  BleCustomServiceState& service = customGattServices_[customGattServiceCount_];
  memset(&service, 0, sizeof(service));
  if (uuidLength == kBleUuidLength16) {
    if (readLe16(uuidBytes) == 0U) {
      return false;
    }
    setCustomUuid16(&service.uuid.length, service.uuid.bytes, readLe16(uuidBytes));
  } else if (!setCustomUuid128(&service.uuid.length, service.uuid.bytes, uuidBytes)) {
    return false;
  }
  service.serviceHandle = customGattNextHandle_;
  service.endHandle = customGattNextHandle_;
  ++customGattNextHandle_;
  ++customGattServiceCount_;

  if (outServiceHandle != nullptr) {
    *outServiceHandle = service.serviceHandle;
  }
  return true;
}

bool BleRadio::addCustomGattCharacteristic(uint16_t serviceHandle, uint16_t uuid16,
                                           uint8_t properties,
                                           const uint8_t* initialValue,
                                           uint8_t initialValueLength,
                                           uint16_t* outValueHandle,
                                           uint16_t* outCccdHandle) {
  uint8_t uuidBytes[kBleUuidLength16] = {0U, 0U};
  writeLe16(uuidBytes, uuid16);
  return addCustomGattCharacteristicUuid(serviceHandle, uuidBytes, kBleUuidLength16,
                                         properties, initialValue,
                                         initialValueLength, outValueHandle,
                                         outCccdHandle);
}

bool BleRadio::addCustomGattCharacteristic128(
    uint16_t serviceHandle, const uint8_t uuid128[kCustomGattUuid128Length],
    uint8_t properties, const uint8_t* initialValue, uint8_t initialValueLength,
    uint16_t* outValueHandle, uint16_t* outCccdHandle) {
  return addCustomGattCharacteristicUuid(serviceHandle, uuid128,
                                         kBleUuidLength128, properties,
                                         initialValue, initialValueLength,
                                         outValueHandle, outCccdHandle);
}

bool BleRadio::addCustomGattCharacteristicUuid(uint16_t serviceHandle,
                                               const uint8_t* uuidBytes,
                                               uint8_t uuidLength,
                                               uint8_t properties,
                                               const uint8_t* initialValue,
                                               uint8_t initialValueLength,
                                               uint16_t* outValueHandle,
                                               uint16_t* outCccdHandle) {
  constexpr uint8_t kAllowedProps = static_cast<uint8_t>(
      kBleGattPropRead | kBleGattPropWriteNoRsp | kBleGattPropWrite |
      kBleGattPropNotify | kBleGattPropIndicate);
  if (connected_ || uuidBytes == nullptr ||
      customGattCharacteristicCount_ >= kCustomGattMaxCharacteristics ||
      (properties == 0U) || ((properties & ~kAllowedProps) != 0U)) {
    return false;
  }
  if (uuidLength != kBleUuidLength16 && uuidLength != kBleUuidLength128) {
    return false;
  }
  if (uuidLength == kBleUuidLength16 && readLe16(uuidBytes) == 0U) {
    return false;
  }
  if (initialValueLength > kCustomGattMaxValueLength ||
      (initialValueLength > 0U && initialValue == nullptr)) {
    return false;
  }

  uint8_t serviceIndex = 0xFFU;
  for (uint8_t i = 0U; i < customGattServiceCount_; ++i) {
    if (customGattServices_[i].serviceHandle == serviceHandle) {
      serviceIndex = i;
      break;
    }
  }
  if (serviceIndex == 0xFFU) {
    return false;
  }
  // Keep service ranges monotonic by only appending to the newest service.
  if (serviceIndex != static_cast<uint8_t>(customGattServiceCount_ - 1U)) {
    return false;
  }

  const bool hasCccd = ((properties & (kBleGattPropNotify | kBleGattPropIndicate)) != 0U);
  const uint16_t requiredHandles = hasCccd ? 3U : 2U;
  if (customGattNextHandle_ > kCustomGattHandleEnd ||
      (static_cast<uint16_t>(kCustomGattHandleEnd - customGattNextHandle_ + 1U) <
       requiredHandles)) {
    return false;
  }

  BleCustomCharacteristicState& characteristic =
      customGattCharacteristics_[customGattCharacteristicCount_];
  memset(&characteristic, 0, sizeof(characteristic));
  characteristic.serviceHandle = serviceHandle;
  if (uuidLength == kBleUuidLength16) {
    setCustomUuid16(&characteristic.uuid.length, characteristic.uuid.bytes,
                    readLe16(uuidBytes));
  } else if (!setCustomUuid128(&characteristic.uuid.length, characteristic.uuid.bytes,
                               uuidBytes)) {
    return false;
  }
  characteristic.properties = properties;
  characteristic.declarationHandle = customGattNextHandle_++;
  characteristic.valueHandle = customGattNextHandle_++;
  characteristic.cccdHandle = hasCccd ? customGattNextHandle_++ : 0U;
  characteristic.cccdValue = 0U;
  characteristic.valueLength = initialValueLength;
  if (initialValueLength > 0U) {
    memcpy(characteristic.value, initialValue, initialValueLength);
  }
  ++customGattCharacteristicCount_;

  BleCustomServiceState& service = customGattServices_[serviceIndex];
  service.endHandle = (characteristic.cccdHandle != 0U) ? characteristic.cccdHandle
                                                         : characteristic.valueHandle;

  if (outValueHandle != nullptr) {
    *outValueHandle = characteristic.valueHandle;
  }
  if (outCccdHandle != nullptr) {
    *outCccdHandle = characteristic.cccdHandle;
  }
  return true;
}

bool BleRadio::setCustomGattCharacteristicValue(uint16_t valueHandle,
                                                const uint8_t* value,
                                                uint8_t valueLength) {
  if (valueLength > kCustomGattMaxValueLength ||
      (valueLength > 0U && value == nullptr)) {
    return false;
  }

  BleCustomCharacteristicState* characteristic =
      findCustomCharacteristicByValueHandle(valueHandle);
  if (characteristic == nullptr) {
    return false;
  }
  characteristic->valueLength = valueLength;
  memset(characteristic->value, 0, sizeof(characteristic->value));
  if (valueLength > 0U) {
    memcpy(characteristic->value, value, valueLength);
  }
  return true;
}

bool BleRadio::getCustomGattCharacteristicValue(uint16_t valueHandle, uint8_t* outValue,
                                                uint8_t* inOutValueLength) const {
  if (outValue == nullptr || inOutValueLength == nullptr) {
    return false;
  }
  const BleCustomCharacteristicState* characteristic =
      findCustomCharacteristicByValueHandle(valueHandle);
  if (characteristic == nullptr) {
    return false;
  }
  if (*inOutValueLength < characteristic->valueLength) {
    *inOutValueLength = characteristic->valueLength;
    return false;
  }
  if (characteristic->valueLength > 0U) {
    memcpy(outValue, characteristic->value, characteristic->valueLength);
  }
  *inOutValueLength = characteristic->valueLength;
  return true;
}

bool BleRadio::notifyCustomGattCharacteristic(uint16_t valueHandle, bool indicate) {
  if (!connected_) {
    return false;
  }
  BleCustomCharacteristicState* characteristic =
      findCustomCharacteristicByValueHandle(valueHandle);
  if (characteristic == nullptr) {
    return false;
  }

