lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  const bool notifyEnabled = ((characteristic->properties & kBleGattPropNotify) != 0U) &&
                             ((characteristic->cccdValue & 0x0001U) != 0U);
  const bool indicateEnabled =
      ((characteristic->properties & kBleGattPropIndicate) != 0U) &&
      ((characteristic->cccdValue & 0x0002U) != 0U);
  if (indicate) {
    if (!indicateEnabled || connectionCustomIndicationAwaitingHandle_ != 0U) {
      return false;
    }
  } else if (!notifyEnabled) {
    return false;
  }

  const ptrdiff_t idx = (characteristic - &customGattCharacteristics_[0]);
  if (idx < 0 ||
      static_cast<uint8_t>(idx) >= customGattCharacteristicCount_) {
    return false;
  }
  if (connectionCustomNotificationPending_ &&
      connectionCustomPendingCharIndex_ != static_cast<uint8_t>(idx)) {
    return false;
  }

  connectionCustomNotificationPending_ = true;
  connectionCustomPendingCharIndex_ = static_cast<uint8_t>(idx);
  connectionCustomPendingIndication_ = indicate;
  return true;
}

bool BleRadio::isCustomGattCccdEnabled(uint16_t valueHandle, bool indication) const {
  const BleCustomCharacteristicState* characteristic =
      findCustomCharacteristicByValueHandle(valueHandle);
  if (characteristic == nullptr || characteristic->cccdHandle == 0U) {
    return false;
  }
  const uint16_t mask = indication ? 0x0002U : 0x0001U;
  return ((characteristic->cccdValue & mask) != 0U);
}

void BleRadio::setCustomGattWriteCallback(BleGattWriteCallback callback, void* context) {
  customGattWriteCallback_ = callback;
  customGattWriteContext_ = context;
}

bool BleRadio::writeCustomGattCharacteristic(uint16_t handle, const uint8_t* value,
                                             uint16_t valueLength, bool withResponse,
                                             uint8_t* outErrorCode) {
  if (outErrorCode != nullptr) {
    *outErrorCode = kAttErrWriteNotPermitted;
  }

  BleCustomCharacteristicState* valueTarget =
      findCustomCharacteristicByValueHandle(handle);
  if (valueTarget != nullptr) {
    if ((valueLength > kCustomGattMaxValueLength) ||
        (valueLength > 0U && value == nullptr)) {
      if (outErrorCode != nullptr) {
        *outErrorCode = kAttErrInvalidAttrValueLen;
      }
      return false;
    }
    const bool allowWriteReq = ((valueTarget->properties & kBleGattPropWrite) != 0U);
    const bool allowWriteCmd =
        ((valueTarget->properties & kBleGattPropWriteNoRsp) != 0U);
    if ((withResponse && !allowWriteReq) || (!withResponse && !allowWriteCmd)) {
      if (outErrorCode != nullptr) {
        *outErrorCode = kAttErrWriteNotPermitted;
      }
      return false;
    }

    valueTarget->valueLength = static_cast<uint8_t>(valueLength);
    memset(valueTarget->value, 0, sizeof(valueTarget->value));
    if (valueLength > 0U) {
      memcpy(valueTarget->value, value, valueLength);
    }
    if (customGattWriteCallback_ != nullptr) {
      customGattWriteCallback_(valueTarget->valueHandle, valueTarget->value,
                               valueTarget->valueLength, withResponse,
                               customGattWriteContext_);
    }
    return true;
  }

  BleCustomCharacteristicState* cccdTarget =
      findCustomCharacteristicByCccdHandle(handle);
  if (cccdTarget == nullptr) {
    if (outErrorCode != nullptr) {
      *outErrorCode = kAttErrWriteNotPermitted;
    }
    return false;
  }
  if (valueLength != 2U || value == nullptr) {
    if (outErrorCode != nullptr) {
      *outErrorCode = kAttErrInvalidAttrValueLen;
    }
    return false;
  }

  uint16_t allowedMask = 0U;
  if ((cccdTarget->properties & kBleGattPropNotify) != 0U) {
    allowedMask |= 0x0001U;
  }
  if ((cccdTarget->properties & kBleGattPropIndicate) != 0U) {
    allowedMask |= 0x0002U;
  }
  if (allowedMask == 0U) {
    if (outErrorCode != nullptr) {
      *outErrorCode = kAttErrWriteNotPermitted;
    }
    return false;
  }

  const uint16_t cccd = readLe16(value);
  if ((cccd & ~allowedMask) != 0U) {
    if (outErrorCode != nullptr) {
      *outErrorCode = kAttErrWriteNotPermitted;
    }
    return false;
  }
  cccdTarget->cccdValue = cccd;
  if ((cccdTarget->cccdValue & 0x0002U) == 0U &&
      connectionCustomIndicationAwaitingHandle_ == cccdTarget->valueHandle) {
    connectionCustomIndicationAwaitingHandle_ = 0U;
  }
  if (connectionCustomNotificationPending_) {
    const uint8_t idx = connectionCustomPendingCharIndex_;
    if (idx < customGattCharacteristicCount_ &&
        &customGattCharacteristics_[idx] == cccdTarget) {
      const bool pendingModeEnabled =
          connectionCustomPendingIndication_
              ? ((cccdTarget->cccdValue & 0x0002U) != 0U)
              : ((cccdTarget->cccdValue & 0x0001U) != 0U);
      if (!pendingModeEnabled) {
        connectionCustomNotificationPending_ = false;
        connectionCustomPendingCharIndex_ = 0xFFU;
        connectionCustomPendingIndication_ = false;
      }
    }
  }
  return true;
}

void BleRadio::clearCustomGattConnectionState() {
  connectionCustomNotificationPending_ = false;
  connectionCustomPendingCharIndex_ = 0xFFU;
  connectionCustomPendingIndication_ = false;
  connectionCustomIndicationAwaitingHandle_ = 0U;
  for (uint8_t i = 0U; i < customGattCharacteristicCount_; ++i) {
    customGattCharacteristics_[i].cccdValue = 0U;
  }
}

bool BleRadio::buildAdvertisingPacket() {
  const size_t payloadLen = sizeof(address_) + advDataLen_;
  if (payloadLen > 37U) {
    return false;
  }

  uint8_t header = static_cast<uint8_t>(pduType_) & 0x0FU;
  if (useChSel2_) {
    header |= (1U << 5U);
  }
  if (addressType_ == BleAddressType::kRandomStatic) {
    header |= (1U << 6U);
  }

  txPacket_[0] = header;
  txPacket_[1] = static_cast<uint8_t>(payloadLen & 0x3FU);

  memcpy(&txPacket_[2], address_, sizeof(address_));
  if (advDataLen_ > 0U) {
    memcpy(&txPacket_[2 + sizeof(address_)], advData_, advDataLen_);
  }

  return true;
}

bool BleRadio::setScanResponseData(const uint8_t* data, size_t len) {
  if (len > sizeof(scanRspData_)) {
    return false;
  }
  if (len > 0U && data == nullptr) {
    return false;
  }

  if (len > 0U) {
    memcpy(scanRspData_, data, len);
  }
  scanRspDataLen_ = len;
  return buildScanResponsePacket();
}

bool BleRadio::setScanResponseName(const char* name) {
  if (name == nullptr) {
    return false;
  }

  uint8_t payload[31];
  size_t used = 0;

