lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
void BleRadio::clearEncryptionDebugCounters() {
  memset(&encDebug_, 0, sizeof(encDebug_));
}

bool BleRadio::hasBondRecord() const { return bondRecordValid_; }

bool BleRadio::getBondRecord(BleBondRecord* outRecord) const {
  if (outRecord == nullptr || !bondRecordValid_) {
    return false;
  }
  memcpy(outRecord, &bondRecord_, sizeof(*outRecord));
  return true;
}

bool BleRadio::clearBondRecord(bool clearPersistentStorage) {
  memset(&bondRecord_, 0, sizeof(bondRecord_));
  bondRecordValid_ = false;
  bondStorageLoaded_ = true;
  bondKeyPrimedForConnection_ = false;
  if (clearPersistentStorage) {
    return clearPersistentBondRecord();
  }
  return true;
}

void BleRadio::setBondPersistenceCallbacks(BleBondLoadCallback loadCallback,
                                           BleBondSaveCallback saveCallback,
                                           BleBondClearCallback clearCallback,
                                           void* context) {
  bondLoadCallback_ = loadCallback;
  bondSaveCallback_ = saveCallback;
  bondClearCallback_ = clearCallback;
  bondCallbackContext_ = context;
  bondStorageLoaded_ = false;
  loadBondRecordFromPersistence();
}

void BleRadio::setTraceCallback(BleTraceCallback callback, void* context) {
  traceCallback_ = callback;
  traceCallbackContext_ = context;
}

bool BleRadio::disconnect(uint32_t spinLimit) {
  if (!initialized_ || radio_ == nullptr) {
    return false;
  }

  radio_->SHORTS = 0U;
  radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
  waitDisabled(spinLimit);
  connected_ = false;
  connectionLastTxLlid_ = 0x01U;
  connectionLastTxLength_ = 0U;
  connectionLastTxSn_ = 0U;
  connectionTxHistoryValid_ = false;
  connectionLastTxPlainLlid_ = 0x01U;
  connectionLastTxPlainLength_ = 0U;
  memset(connectionLastTxPlainPayload_, 0, sizeof(connectionLastTxPlainPayload_));
  connectionPendingTxLlid_ = 0x01U;
  connectionPendingTxLength_ = 0U;
  connectionPendingTxValid_ = false;
  memset(connectionPendingTxPayload_, 0, sizeof(connectionPendingTxPayload_));
  connectionAttMtu_ = kBleDefaultAttMtu;
  connectionUseChSel2_ = false;
  connectionChannelId_ = 0U;
  connectionMissedEventCount_ = 0U;
  connectionFirstEventListenUs_ = 0U;
  connectionSyncAttemptsRemaining_ = 0U;
  connectionUpdatePending_ = false;
  connectionUpdateInstant_ = 0U;
  connectionPendingIntervalUnits_ = 0U;
  connectionPendingLatency_ = 0U;
  connectionPendingTimeoutUnits_ = 0U;
  connectionChannelMapPending_ = false;
  connectionChannelMapInstant_ = 0U;
  memset(connectionPendingChannelMap_, 0, sizeof(connectionPendingChannelMap_));
  connectionPendingChannelCount_ = 0U;
  connectionServiceChangedIndicationsEnabled_ = false;
  connectionServiceChangedIndicationPending_ = false;
  connectionServiceChangedIndicationAwaitingConfirm_ = false;
  connectionBatteryNotificationsEnabled_ = false;
  connectionBatteryNotificationPending_ = false;
  connectionPreparedWriteActive_ = false;
  connectionPreparedWriteHandle_ = 0U;
  connectionPreparedWriteValue_[0] = 0U;
  connectionPreparedWriteValue_[1] = 0U;
  connectionPreparedWriteMask_ = 0U;
  clearCustomGattConnectionState();
  clearConnectionSecurityState();
  restoreAdvertisingLinkDefaults();
  clearRadioCoreEvents(radio_);
  emitBleTrace("DISCONNECT");
  return true;
}

bool BleRadio::pollConnectionEvent(BleConnectionEvent* event, uint32_t spinLimit) {
  if (event != nullptr) {
    event->eventStarted = false;
    event->packetReceived = false;
    event->crcOk = false;
    event->emptyAckTransmitted = false;
    event->packetIsNew = false;
    event->peerAckedLastTx = false;
    event->freshTxAllowed = false;
    event->implicitEmptyAck = false;
    event->terminateInd = false;
    event->llControlPacket = false;
    event->attPacket = false;
    event->txPacketSent = false;
    event->eventCounter = connectionEventCounter_;
    event->dataChannel = 0;
    event->rssiDbm = 0;
    event->llid = 0;
    event->rxNesn = 0U;
    event->rxSn = 0U;
    event->llControlOpcode = 0;
    event->attOpcode = 0;
    event->payloadLength = 0;
    event->txLlid = 0x01U;
    event->txNesn = 0U;
    event->txSn = 0U;
    event->txPayloadLength = 0;
    event->payload = nullptr;
    event->txPayload = nullptr;
  }

  if (!initialized_ || radio_ == nullptr || !connected_) {
    return false;
  }

  const uint32_t intervalUsForListen =
      (connectionIntervalUnits_ > 0U)
          ? (static_cast<uint32_t>(connectionIntervalUnits_) * 1250UL)
          : 1250UL;

  uint32_t nowUs = micros();
  // If application code stalled long enough that the current event window is
  // already behind us, align channel selection to the next event to avoid
  // staying one event behind indefinitely.
  uint32_t lateAllowanceUs = kBleConnAnchorPrewaitUs;
  if (connectionSyncAttemptsRemaining_ > 0U) {
    lateAllowanceUs = connectionFirstEventListenUs_ + 400U;
  }
  const bool useCurrentEventCounterForChannel =
      timeReachedUs(nowUs, connectionNextEventUs_ + lateAllowanceUs) ||
      (connectionMissedEventCount_ > 0U);

  const uint32_t rxStartUs = connectionNextEventUs_ - kBleConnRxStartLeadUs;
  if (!timeReachedUs(nowUs, rxStartUs)) {
    const uint32_t deltaUs = static_cast<uint32_t>(rxStartUs - nowUs);
    if (deltaUs > kBleConnAnchorPrewaitUs) {
      return false;
    }
    // Short, bounded pre-wait near anchor reduces event jitter while
    // allowing RX ramp-up before the nominal event anchor.
    while (!timeReachedUs(nowUs, rxStartUs)) {
      nowUs = micros();
    }
  }

  updateNextConnectionEventTime();

  // `updateNextConnectionEventTime()` advances `connectionEventCounter_`
  // before servicing this event. Use the same "current event" counter basis
  // as channel selection so LL instants are applied on the intended event.
  const uint16_t currentEventCounter =
      useCurrentEventCounterForChannel
          ? connectionEventCounter_
          : ((connectionEventCounter_ > 0U)
                 ? static_cast<uint16_t>(connectionEventCounter_ - 1U)
                 : 0U);

