lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  if ((llid == kBlePduLlControl) && (rxLength >= 2U) &&
      (rxPacket_[2] == kBleLlCtrlTerminateInd)) {
    terminateInd = true;
  }

  if ((llid == kBlePduLlControl) &&
      (rxLength >= 1U)) {
    const uint8_t opcode = rxPacket_[2];
    if (connectionEncStartReqPending_) {
      ++encDebug_.startPendingControlRxSeen;
      encDebug_.startPendingLastHdr = hdr0;
      encDebug_.startPendingLastLenRaw = rxLengthRaw;
      encDebug_.startPendingLastByte0 = opcode;
      encDebug_.startPendingLastDecrypted = rxWasDecrypted ? 1U : 0U;
    }

    if (packetIsNew) {
      if (opcode == kBleLlCtrlEncReq) {
        ++encDebug_.mainEncReqSeen;
      } else if (opcode == kBleLlCtrlStartEncReq) {
        ++encDebug_.mainStartEncReqSeen;
        if (rxWasDecrypted) {
          ++encDebug_.mainStartEncReqSeenDecrypted;
        }
      } else if (opcode == kBleLlCtrlStartEncRsp) {
        encDebug_.encStartRspLastRawLen = rxLengthRaw;
        encDebug_.encStartRspLastDecrypted = rxWasDecrypted ? 1U : 0U;
        encDebug_.encStartRspLastHdr = hdr0;
      }
    }
  }

  if (event != nullptr) {
    event->packetIsNew = packetIsNew;
    event->peerAckedLastTx = peerAckedLastTx;
    event->freshTxAllowed = (!connectionTxHistoryValid_ || peerAckedLastTx);
    event->implicitEmptyAck = implicitEmptyAck;
    event->terminateInd = terminateInd;
    event->llid = llid;
    event->rxNesn = nesn;
    event->rxSn = sn;
    event->payloadLength = rxLength;
    if (llid == kBlePduLlControl && rxLength >= 1U) {
      event->llControlPacket = true;
      event->llControlOpcode = rxPacket_[2];
    }
    if (llid == kBlePduDataStartOrComplete && rxLength >= 5U) {
      const uint16_t l2capLen = readLe16(&rxPacket_[2]);
      const uint16_t cid = readLe16(&rxPacket_[4]);
      const uint8_t availableAttLen = (rxLength > kBleL2capHeaderLen)
                                          ? static_cast<uint8_t>(rxLength - kBleL2capHeaderLen)
                                          : 0U;
      if (cid == kBleL2capCidAtt && l2capLen > 0U && availableAttLen > 0U) {
        event->attPacket = true;
        event->attOpcode = rxPacket_[2 + kBleL2capHeaderLen];
      }
    }
  }

  bool llControlHandledImmediate = false;
  bool immediateLlControlResponseValid = false;
  uint8_t immediateLlControlResponseLength = 0U;
  // If the peer has not ACKed our last TX PDU, keep retransmitting that exact
  // packet/SN until ACKed. This is required for encrypted empty PDUs as well,
  // since each fresh encrypted transmission consumes a new CCM packet counter.
  const bool canSendNewPayloadThisEvent =
      !connectionTxHistoryValid_ || peerAckedLastTx;
  // Several controllers retransmit the same LL control request until they see
  // a matching control response (not just an empty ACK). Build and transmit LL
  // control responses in this event whenever SN/NESN allows a fresh TX payload.
  if (packetIsNew && !terminateInd &&
      (llid == kBlePduLlControl) &&
      !deferAwaitingStartRspDecrypt &&
      canSendNewPayloadThisEvent) {
    llControlHandledImmediate = true;
    if (buildLlControlResponse(&rxPacket_[2], rxLength, connectionTxPayload_,
                               &immediateLlControlResponseLength, &terminateInd) &&
        immediateLlControlResponseLength > 0U) {
      immediateLlControlResponseValid = true;
    }
  }

  // If we decrypted LL_START_ENC_REQ (it arrived encrypted), some controllers
  // expect LL_START_ENC_RSP to be encrypted as well. Enable TX encryption
  // immediately for this response in that case.
  if (immediateLlControlResponseValid &&
      (llid == kBlePduLlControl) &&
      (rxLength >= 1U) &&
      (rxPacket_[2] == kBleLlCtrlStartEncReq) &&
      rxWasDecrypted) {
    connectionEncTxEnabled_ = true;
    connectionEncEnableTxOnNextEvent_ = false;
  }

  uint8_t txLlid = 0x01U;
  uint8_t txLength = 0U;
  const bool txCanUseFreshPayload =
      !terminateInd && canSendNewPayloadThisEvent;
  if (txCanUseFreshPayload) {
    // Time-critical path: transmit either a queued response from a previous
    // event or an empty ACK in this event, then build next responses after TX.
    if (immediateLlControlResponseValid) {
      txLlid = kBlePduLlControl;
      txLength = immediateLlControlResponseLength;
    } else if (connectionPendingTxValid_) {
      txLlid = connectionPendingTxLlid_;
      txLength = connectionPendingTxLength_;
      if (txLength > 0U) {
        memcpy(connectionTxPayload_, connectionPendingTxPayload_, txLength);
      }
      connectionPendingTxValid_ = false;
      connectionPendingTxLlid_ = 0x01U;
      connectionPendingTxLength_ = 0U;
    } else {
      txLlid = 0x01U;
      txLength = 0U;
    }

    connectionLastTxLlid_ = txLlid;
    connectionLastTxLength_ = txLength;
  } else {
    // Retransmit the last payload verbatim until it is ACKed.
    txLlid = connectionLastTxLlid_;
    txLength = connectionLastTxLength_;
  }

  if (terminateInd && terminateMicFailure) {
    txLlid = kBlePduLlControl;
    txLength = 2U;
    connectionTxPayload_[0] = kBleLlCtrlTerminateInd;
    connectionTxPayload_[1] = kBleLlErrorMicFailure;
    ++encDebug_.encClearCount;
    encDebug_.encLastClearReason = 0x05U;  // MIC failure terminate.
    connectionEncRxEnabled_ = false;
    connectionEncTxEnabled_ = false;
    connectionLastTxLlid_ = txLlid;
    connectionLastTxLength_ = txLength;
    connectionLastTxWasEncrypted_ = false;
    connectionLastTxEncryptedLength_ = 0U;
  }

  // Preserve a snapshot of the plaintext payload for retransmissions and for
  // `BleConnectionEvent::txPayload` visibility (the working buffer is reused later).
  const bool txPayloadIsNewPlain = txCanUseFreshPayload || (terminateInd && terminateMicFailure);
  if (txPayloadIsNewPlain) {
    connectionLastTxPlainLlid_ = txLlid;
    connectionLastTxPlainLength_ = txLength;
    if (txLength > 0U) {
      memcpy(connectionLastTxPlainPayload_, connectionTxPayload_, txLength);
    }
  }

  txPacket_[0] = static_cast<uint8_t>((txLlid & 0x03U) |
                                      ((connectionExpectedRxSn_ & 0x01U) << 2U) |
                                      ((connectionTxSn_ & 0x01U) << 3U));
  const uint8_t txNesnBit = static_cast<uint8_t>((txPacket_[0] >> 2U) & 0x01U);
  const uint8_t txSnBit = static_cast<uint8_t>((txPacket_[0] >> 3U) & 0x01U);

  const uint8_t* const txPlainPayloadForCurrentTx =
      txCanUseFreshPayload ? &connectionTxPayload_[0] : &connectionLastTxPlainPayload_[0];
  const bool txIsEncRspPlain =
      (txLlid == kBlePduLlControl) &&
      (txLength >= 1U) &&
      (txPlainPayloadForCurrentTx[0] == kBleLlCtrlEncRsp);
  const bool txIsStartEncReqPlain =
      (txLlid == kBlePduLlControl) &&
      (txLength >= 1U) &&
      (txPlainPayloadForCurrentTx[0] == kBleLlCtrlStartEncReq);
  const bool txIsStartEncRspPlain =
      (txLlid == kBlePduLlControl) &&
      (txLength >= 1U) &&
      (txPlainPayloadForCurrentTx[0] == kBleLlCtrlStartEncRsp);

  const bool sessionEncryptionActive = connectionEncTxEnabled_ && connectionEncSessionValid_;
  const bool encryptCurrentTx = sessionEncryptionActive &&
                                (txCanUseFreshPayload || connectionLastTxWasEncrypted_);
  uint8_t txLengthOnAir = txLength;
  uint64_t txCounterUsedForCurrentTx = 0ULL;
  bool txCounterUsedValid = false;
  if (!txCanUseFreshPayload && sessionEncryptionActive && connectionLastTxWasEncrypted_) {
    txLengthOnAir = connectionLastTxEncryptedLength_;
    txPacket_[1] = txLengthOnAir;
    if (txLengthOnAir > 0U) {
      memcpy(&txPacket_[2], connectionLastTxEncryptedPayload_, txLengthOnAir);
    }
  } else {
    const uint8_t* const txPlainPayload = txPlainPayloadForCurrentTx;
    txPacket_[1] = txLength;
    if (txLength > 0U) {
      memcpy(&txPacket_[2], txPlainPayload, txLength);
    }

    if (encryptCurrentTx) {
      uint8_t encryptedLength = 0U;
      bool encryptedOk = false;
      // `connectionEncTxCounter_` tracks the next TX packet counter to use.
      // Every fresh encrypted data-channel PDU (including zero-length/MIC-only)
      // consumes one counter value. Retransmissions reuse the cached ciphertext.
      uint64_t txCounterToUse = connectionEncTxCounter_;
      if (txCanUseFreshPayload &&
          (txLlid == 0x01U) &&
          (txLength == 0U) &&
          connectionEncPrecomputedEmptyValid_ &&
          (connectionEncPrecomputedCounter_ == txCounterToUse)) {
        encryptedLength = kBleMicLen;
        memcpy(connectionLastTxEncryptedPayload_, connectionEncPrecomputedPayload_,
               kBleMicLen);
        encryptedOk = true;
      } else if (txCanUseFreshPayload &&
                 txIsStartEncRspPlain &&
                 connectionEncPrecomputedStartRspTxValid_ &&
                 (connectionEncPrecomputedStartRspTxCounter_ == txCounterToUse)) {
        encryptedLength = static_cast<uint8_t>(1U + kBleMicLen);
        memcpy(connectionLastTxEncryptedPayload_, connectionEncPrecomputedStartRspTx_,
               encryptedLength);
        encryptedOk = true;
      } else {
        encryptedOk = bleCcmEncryptPayload(connectionEncSessionKey_, connectionEncIv_,
                                           txCounterToUse, connectionEncTxDirection_,
                                           txPacket_[0],
                                           txPlainPayload, txLength,
                                           connectionLastTxEncryptedPayload_, &encryptedLength);
      }

      if (!encryptedOk) {
        txLengthOnAir = 0U;
        txPacket_[1] = 0U;
        connectionLastTxWasEncrypted_ = false;
        connectionLastTxEncryptedLength_ = 0U;
        connectionEncPrecomputedEmptyValid_ = false;
        terminateInd = true;
      } else {
        txLengthOnAir = encryptedLength;
        txPacket_[1] = encryptedLength;
        memcpy(&txPacket_[2], connectionLastTxEncryptedPayload_, encryptedLength);
        connectionLastTxWasEncrypted_ = true;
        connectionLastTxEncryptedLength_ = encryptedLength;
        txCounterUsedForCurrentTx = txCounterToUse;
        txCounterUsedValid = true;
        if (txCanUseFreshPayload) {
          connectionEncTxCounter_ =
              (txCounterToUse + 1ULL) & kBleEncPacketCounterMask;
          if (connectionEncPrecomputedCounter_ != connectionEncTxCounter_) {
            connectionEncPrecomputedEmptyValid_ = false;
          }
          if (txIsStartEncRspPlain) {
            connectionEncPrecomputedStartRspTxValid_ = false;
          }
        }
      }
    } else if (txCanUseFreshPayload) {
      connectionLastTxWasEncrypted_ = false;
      connectionLastTxEncryptedLength_ = 0U;
      memset(connectionLastTxEncryptedPayload_, 0, sizeof(connectionLastTxEncryptedPayload_));
    }
  }

  encDebug_.encLastTxHdr = txPacket_[0];
  encDebug_.encLastTxPlainLen = txLength;
  encDebug_.encLastTxAirLen = txLengthOnAir;
  encDebug_.encLastTxWasFresh = txCanUseFreshPayload ? 1U : 0U;
  encDebug_.encLastTxWasEncrypted =
      (sessionEncryptionActive && connectionLastTxWasEncrypted_) ? 1U : 0U;
  if (encDebug_.encLastTxWasEncrypted != 0U) {
    uint64_t txCounterObserved = 0ULL;
    if (txCounterUsedValid) {
      txCounterObserved = txCounterUsedForCurrentTx;
    } else {
      txCounterObserved = (connectionEncTxCounter_ - 1ULL) & kBleEncPacketCounterMask;
    }
    encDebug_.encLastTxCounterLo =
        static_cast<uint32_t>(txCounterObserved & 0xFFFFFFFFULL);
  }

  // During start encryption, some controllers send LL_START_ENC_REQ as a second
  // packet in a later connection event. Keep TX->RX turnaround in hardware while
  // awaiting LL_START_ENC_REQ so we can catch it without CPU latency.
  const bool doPostTxRxTurnaround =
      !terminateInd &&
      ((connectionEncStartReqPending_ && txIsEncRspPlain) ||
       txIsStartEncReqPlain);

