lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  clearRadioCoreEvents(radio_);
  if (doPostTxRxTurnaround) {
    // Use a single buffer for TX and immediate follow-up RX so DISABLED->RXEN
    // shortcut can arm the receiver exactly at T_IFS timing.
    const size_t txCopyLen = 2U + static_cast<size_t>(txLengthOnAir);
    const size_t copyLen = (txCopyLen <= sizeof(rxPacket_)) ? txCopyLen : sizeof(rxPacket_);
    memcpy(rxPacket_, txPacket_, copyLen);
    radio_->PACKETPTR =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&rxPacket_[0]));
    radio_->SHORTS =
        ((RADIO_SHORTS_TXREADY_START_Enabled << RADIO_SHORTS_TXREADY_START_Pos) &
         RADIO_SHORTS_TXREADY_START_Msk) |
        ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
         RADIO_SHORTS_PHYEND_DISABLE_Msk) |
        ((RADIO_SHORTS_DISABLED_RXEN_Enabled << RADIO_SHORTS_DISABLED_RXEN_Pos) &
         RADIO_SHORTS_DISABLED_RXEN_Msk) |
        ((RADIO_SHORTS_RXREADY_START_Enabled << RADIO_SHORTS_RXREADY_START_Pos) &
         RADIO_SHORTS_RXREADY_START_Msk) |
        ((RADIO_SHORTS_ADDRESS_RSSISTART_Enabled
          << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) &
         RADIO_SHORTS_ADDRESS_RSSISTART_Msk);
  } else {
    radio_->PACKETPTR =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&txPacket_[0]));
    radio_->SHORTS =
        ((RADIO_SHORTS_TXREADY_START_Enabled << RADIO_SHORTS_TXREADY_START_Pos) &
         RADIO_SHORTS_TXREADY_START_Msk) |
        ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
         RADIO_SHORTS_PHYEND_DISABLE_Msk);
  }
  const uint32_t txTriggerTargetUs = rxEndTimestampUs + kBleConnTxenAfterRxUs;
  uint32_t txTriggerNowUs = micros();
  while (!timeReachedUs(txTriggerNowUs, txTriggerTargetUs)) {
    txTriggerNowUs = micros();
  }
  const uint32_t txLagUs = static_cast<uint32_t>(txTriggerNowUs - txTriggerTargetUs);
  encDebug_.txenLagLastUs = txLagUs;
  if (txLagUs > encDebug_.txenLagMaxUs) {
    encDebug_.txenLagMaxUs = txLagUs;
  }
  if (encryptCurrentTx) {
    ++encDebug_.encTxPacketCount;
    encDebug_.encTxenLagLastUs = txLagUs;
    if (txLagUs > encDebug_.encTxenLagMaxUs) {
      encDebug_.encTxenLagMaxUs = txLagUs;
    }
  }
  if (txIsEncRspPlain) {
    encDebug_.encRspTxenLagLastUs = txLagUs;
    if (txLagUs > encDebug_.encRspTxenLagMaxUs) {
      encDebug_.encRspTxenLagMaxUs = txLagUs;
    }
  }
  radio_->TASKS_TXEN = RADIO_TASKS_TXEN_TASKS_TXEN_Trigger;
  // Keep ENC_RSP timing deterministic while ensuring encrypted follow-up PDUs
  // (e.g. LL_START_ENC_REQ) can be decrypted in the same event window.
  derivePendingEncSessionKey();
  const uint32_t txEndBudgetUs = kBleConnTxDisableWaitUs + 1200U;
  const bool txEndSeen =
      waitRadioEndBudgeted(radio_, txEndBudgetUs, spinLimit / 2U + 1U);
  bool txOk = false;
  if (txEndSeen) {
    if (doPostTxRxTurnaround) {
      // Clear TX END/PHYEND immediately after TX completion so the follow-up
      // listener observes only RX completion events.
      radio_->EVENTS_END = 0U;
      radio_->EVENTS_PHYEND = 0U;
    }
    txOk = waitRadioDisabledBudgeted(radio_, kBleConnTxDisableWaitUs,
                                     spinLimit / 2U + 1U);
  }
  if (!txOk) {
    radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
    waitRadioDisabledBudgeted(radio_, kBleConnTxDisableWaitUs, spinLimit / 2U + 1U);
  }
  if (txOk) {
    connectionTxHistoryValid_ = true;
    connectionLastTxSn_ = txSnBit;
  }
  if (!doPostTxRxTurnaround || !txOk) {
    radio_->SHORTS = 0U;
  } else {
    // Clear TX completion events and remove DISABLED->RX shortcut so RX disable
    // completes cleanly once the follow-up listen window ends.
    radio_->EVENTS_DISABLED = 0U;
    radio_->EVENTS_CRCOK = 0U;
    radio_->EVENTS_CRCERROR = 0U;
    radio_->SHORTS =
        ((RADIO_SHORTS_RXREADY_START_Enabled << RADIO_SHORTS_RXREADY_START_Pos) &
         RADIO_SHORTS_RXREADY_START_Msk) |
        ((RADIO_SHORTS_ADDRESS_RSSISTART_Enabled
          << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) &
         RADIO_SHORTS_ADDRESS_RSSISTART_Msk) |
        ((RADIO_SHORTS_PHYEND_DISABLE_Enabled
          << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
         RADIO_SHORTS_PHYEND_DISABLE_Msk);

    // Defensive fallback: if shortcut path did not enter RX, arm RX manually.
    const uint32_t state =
        (radio_->STATE & RADIO_STATE_STATE_Msk) >> RADIO_STATE_STATE_Pos;
    if (state == RADIO_STATE_STATE_Disabled) {
      radio_->TASKS_RXEN = RADIO_TASKS_RXEN_TASKS_RXEN_Trigger;
    }
  }
  if (!txOk) {
    emitBleTrace("EVT_TX_TIMEOUT");
  }

  if (txOk &&
      (connectionLastTxPlainLlid_ == kBlePduLlControl) &&
      (connectionLastTxPlainLength_ >= 1U)) {
    const uint8_t opcode = connectionLastTxPlainPayload_[0];
    if (opcode == kBleLlCtrlEncRsp) {
      ++encDebug_.mainEncRspTxOk;
      // Some centrals do not send LL_START_ENC_REQ in the same event as
      // LL_ENC_RSP. Arm a next-event fallback so the procedure still advances
      // when the immediate follow-up listener sees nothing.
      if (connectionEncStartReqPending_) {
        connectionEncStartReqTxPending_ = true;
      }
    } else if (opcode == kBleLlCtrlStartEncReq) {
      connectionEncStartReqTxPending_ = false;
      connectionEncAwaitingStartRsp_ = true;
      connectionEncRxEnabled_ = true;
      // Tx encryption is enabled only after final LL_START_ENC_RSP is sent.
      connectionEncTxEnabled_ = false;
      connectionEncEnableTxOnNextEvent_ = false;
      uint8_t preLen = 0U;
      connectionEncPrecomputedCounter_ = connectionEncTxCounter_;
      connectionEncPrecomputedEmptyValid_ =
          bleCcmEncryptPayload(connectionEncSessionKey_, connectionEncIv_,
                               connectionEncPrecomputedCounter_,
                               connectionEncTxDirection_,
                               0x01U,  // LLID=1, SN/NESN/MD are masked in MIC.
                               nullptr, 0U,
                               connectionEncPrecomputedPayload_, &preLen) &&
          (preLen == kBleMicLen);
      const uint8_t startRspPlain[1] = {kBleLlCtrlStartEncRsp};
      uint8_t startRspLen = 0U;
      connectionEncPrecomputedStartRspValid_ =
          bleCcmEncryptPayload(connectionEncSessionKey_, connectionEncIv_,
                               connectionEncRxCounter_,
                               connectionEncRxDirection_,
                               0x03U,  // LLID=3, SN/NESN/MD are masked in MIC.
                               startRspPlain, sizeof(startRspPlain),
                               connectionEncPrecomputedStartRsp_, &startRspLen) &&
          (startRspLen == (1U + kBleMicLen));
      connectionEncPrecomputedStartRspTxCounter_ = connectionEncTxCounter_;
      uint8_t startRspTxLen = 0U;
      connectionEncPrecomputedStartRspTxValid_ =
          bleCcmEncryptPayload(connectionEncSessionKey_, connectionEncIv_,
                               connectionEncPrecomputedStartRspTxCounter_,
                               connectionEncTxDirection_,
                               0x03U,  // LLID=3, SN/NESN/MD are masked in MIC.
                               startRspPlain, sizeof(startRspPlain),
                               connectionEncPrecomputedStartRspTx_, &startRspTxLen) &&
          (startRspTxLen == (1U + kBleMicLen));
      emitBleTrace("LL_START_ENC_REQ_TX");
    } else if (opcode == kBleLlCtrlStartEncRsp) {
      ++encDebug_.mainStartEncRspTxOk;
      connectionEncPrecomputedCounter_ = connectionEncTxCounter_;
      uint8_t preLen = 0U;
      connectionEncPrecomputedEmptyValid_ =
          bleCcmEncryptPayload(connectionEncSessionKey_, connectionEncIv_,
                               connectionEncPrecomputedCounter_,
                               connectionEncTxDirection_,
                               0x01U,  // LLID=1, SN/NESN/MD are masked in MIC.
                               nullptr, 0U,
                               connectionEncPrecomputedPayload_, &preLen) &&
          (preLen == kBleMicLen);
    }
  }

