lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  bool lastTxOkForEncEnable = txOk;

  // While awaiting LL_START_ENC_REQ, listen briefly for a post-TX follow-up packet
  // and respond immediately (T_IFS). When doPostTxRxTurnaround is true, RX is already
  // armed in hardware at the TX->RX boundary.
  if (doPostTxRxTurnaround && txOk && !terminateInd) {
    ++encDebug_.followupArmed;
    uint32_t followListenUs = kBleConnFollowupRxListenMaxUs;
    const uint32_t intervalUs =
        static_cast<uint32_t>(connectionIntervalUnits_) * 1250UL;
    if (intervalUs > 3000U) {
      const uint32_t capUs = intervalUs - 3000U;
      if (followListenUs > capUs) {
        followListenUs = capUs;
      }
    }
    const uint32_t followStartUs = micros();
    uint8_t followPackets = 0U;
    while (!terminateInd) {
      const uint32_t nowUs = micros();
      const uint32_t elapsedUs = static_cast<uint32_t>(nowUs - followStartUs);
      if ((elapsedUs >= followListenUs) || (followPackets >= 8U)) {
        break;
      }
      const uint32_t remainingUs = followListenUs - elapsedUs;

      const bool followEndSeen =
          waitRadioRxDoneBudgeted(radio_, remainingUs, spinLimit / 2U + 1U);
      if (!followEndSeen) {
        radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
        waitRadioDisabledBudgeted(radio_, kBleConnDisableWaitUs, spinLimit / 2U + 1U);
        radio_->SHORTS = 0U;
        break;
      }

      ++followPackets;
      ++encDebug_.followupEndSeen;
      const uint32_t followRxEndTimestampUs = micros();
      bool followDisabled =
          waitRadioDisabledBudgeted(radio_, kBleConnDisableWaitUs, spinLimit / 2U + 1U);
      if (!followDisabled) {
        radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
        followDisabled = waitRadioDisabledBudgeted(radio_, kBleConnDisableWaitUs,
                                                   spinLimit / 2U + 1U);
      }
      radio_->SHORTS = 0U;
      if (!followDisabled) {
        break;
      }

      const uint32_t followCrcStatus =
          (radio_->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk) >>
          RADIO_CRCSTATUS_CRCSTATUS_Pos;
      const bool followCrcOk =
          (followCrcStatus == RADIO_CRCSTATUS_CRCSTATUS_CRCOk);
      if (followCrcOk) {
        ++encDebug_.followupCrcOk;
        const uint8_t hdrFollow = rxPacket_[0];
        const uint8_t llidFollow = hdrFollow & 0x03U;
        const uint8_t nesnFollow = (hdrFollow >> 2U) & 0x01U;
        const uint8_t snFollow = (hdrFollow >> 3U) & 0x01U;
        const uint8_t rxLengthFollowRaw = rxPacket_[1];

        const bool peerAckedLastTxFollow =
            connectionTxHistoryValid_ && (nesnFollow != connectionLastTxSn_);
        const bool snMatchesExpectedFollow = (snFollow == connectionExpectedRxSn_);
        const bool canConsumeNewPayloadFollow = snMatchesExpectedFollow;

        bool peerAckedLastTxFollowMutable = peerAckedLastTxFollow;
        bool packetIsNewFollow = false;
        if (canConsumeNewPayloadFollow) {
          connectionExpectedRxSn_ ^= 0x01U;
          packetIsNewFollow = true;
        }
        if (!peerAckedLastTxFollowMutable &&
            connectionTxHistoryValid_ &&
            packetIsNewFollow &&
            (connectionLastTxLlid_ == 0x01U) &&
            (connectionLastTxLength_ == 0U)) {
          peerAckedLastTxFollowMutable = true;
        }
        if (peerAckedLastTxFollowMutable) {
          connectionTxSn_ ^= 0x01U;
        }

        uint8_t rxLengthFollow = rxLengthFollowRaw;
        if (connectionEncSessionValid_ &&
            (connectionEncStartReqPending_ || connectionEncAwaitingStartRsp_) &&
            (llidFollow == kBlePduLlControl) &&
            (rxLengthFollowRaw == static_cast<uint8_t>(1U + kBleMicLen))) {
          uint64_t rxCounter = connectionEncRxCounter_;
          if (!packetIsNewFollow && (rxCounter > 0ULL)) {
            rxCounter -= 1ULL;
          }

          uint8_t plaintext[kBleDataPduMaxPayload] = {0};
          uint8_t plaintextLen = 0U;
          bool followDecryptOk =
              bleCcmDecryptPayload(connectionEncSessionKey_, connectionEncIv_,
                                   rxCounter, connectionEncRxDirection_, hdrFollow,
                                   &rxPacket_[2], rxLengthFollowRaw,
                                   plaintext, &plaintextLen);
          if (!followDecryptOk) {
            const uint8_t swappedRxDirection =
                static_cast<uint8_t>(connectionEncRxDirection_ ^ 0x01U);
            if (bleCcmDecryptPayload(connectionEncSessionKey_, connectionEncIv_,
                                     rxCounter, swappedRxDirection, hdrFollow,
                                     &rxPacket_[2], rxLengthFollowRaw,
                                     plaintext, &plaintextLen)) {
              followDecryptOk = true;
              connectionEncRxDirection_ = swappedRxDirection;
              connectionEncTxDirection_ = static_cast<uint8_t>(swappedRxDirection ^ 0x01U);
              connectionEncPrecomputedStartRspValid_ = false;
              connectionEncPrecomputedStartRspTxValid_ = false;
              emitBleTrace("ENC_DIR_SWAP");
            } else if (connectionEncAltKeyValid_ &&
                       bleCcmDecryptPayload(connectionEncSessionKeyAlt_, connectionEncIv_,
                                            rxCounter, connectionEncRxDirection_, hdrFollow,
                                            &rxPacket_[2], rxLengthFollowRaw,
                                            plaintext, &plaintextLen)) {
              followDecryptOk = true;
              memcpy(connectionEncSessionKey_, connectionEncSessionKeyAlt_,
                     sizeof(connectionEncSessionKey_));
              connectionEncAltKeyValid_ = false;
              connectionEncPrecomputedStartRspValid_ = false;
              connectionEncPrecomputedStartRspTxValid_ = false;
              emitBleTrace("ENC_KEY_SWAP");
            } else if (connectionEncAltKeyValid_ &&
                       bleCcmDecryptPayload(connectionEncSessionKeyAlt_, connectionEncIv_,
                                            rxCounter, swappedRxDirection, hdrFollow,
                                            &rxPacket_[2], rxLengthFollowRaw,
                                            plaintext, &plaintextLen)) {
              followDecryptOk = true;
              memcpy(connectionEncSessionKey_, connectionEncSessionKeyAlt_,
                     sizeof(connectionEncSessionKey_));
              connectionEncAltKeyValid_ = false;
              connectionEncRxDirection_ = swappedRxDirection;
              connectionEncTxDirection_ = static_cast<uint8_t>(swappedRxDirection ^ 0x01U);
              connectionEncPrecomputedStartRspValid_ = false;
              connectionEncPrecomputedStartRspTxValid_ = false;
              emitBleTrace("ENC_KEY_DIR_SWAP");
            }
          }
          if (followDecryptOk) {
            rxLengthFollow = plaintextLen;
            if (plaintextLen > 0U) {
              memcpy(&rxPacket_[2], plaintext, plaintextLen);
            }
            if (packetIsNewFollow) {
              connectionEncRxCounter_ =
                  (rxCounter + 1ULL) & kBleEncPacketCounterMask;
            }
          }
        }

        if (llidFollow == 0x01U) {
          ++encDebug_.followupRxLlid1;
        } else if (llidFollow == 0x02U) {
          ++encDebug_.followupRxLlid2;
        } else if (llidFollow == 0x03U) {
          ++encDebug_.followupRxLlid3;
        }
        encDebug_.lastFollowHdr = hdrFollow;
        encDebug_.lastFollowLlid = llidFollow;
        encDebug_.lastFollowLen = rxLengthFollow;
        encDebug_.lastFollowByte0 =
            (rxLengthFollow >= 1U) ? rxPacket_[2] : 0U;

