lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
        if (packetIsNewFollow && !terminateInd &&
            (llidFollow == kBlePduLlControl) &&
            (rxLengthFollow >= 1U) &&
            (rxPacket_[2] == kBleLlCtrlStartEncReq)) {
          ++encDebug_.followupStartEncReqSeen;
          uint8_t responseLength = 0U;
          bool followTerminate = false;
          if (buildLlControlResponse(&rxPacket_[2], rxLengthFollow,
                                     connectionTxPayload_, &responseLength,
                                     &followTerminate) &&
              responseLength > 0U) {
            const uint8_t txFollowLlid = kBlePduLlControl;
            const uint8_t txFollowLength = responseLength;

            connectionLastTxLlid_ = txFollowLlid;
            connectionLastTxLength_ = txFollowLength;
            connectionLastTxWasEncrypted_ = false;
            connectionLastTxEncryptedLength_ = 0U;
            memset(connectionLastTxEncryptedPayload_, 0,
                   sizeof(connectionLastTxEncryptedPayload_));
            connectionLastTxPlainLlid_ = txFollowLlid;
            connectionLastTxPlainLength_ = txFollowLength;
            if (txFollowLength > 0U) {
              memcpy(connectionLastTxPlainPayload_, connectionTxPayload_, txFollowLength);
            }

            txPacket_[0] = static_cast<uint8_t>((txFollowLlid & 0x03U) |
                                                ((connectionExpectedRxSn_ & 0x01U) << 2U) |
                                                ((connectionTxSn_ & 0x01U) << 3U));
            txPacket_[1] = txFollowLength;
            memcpy(&txPacket_[2], connectionTxPayload_, txFollowLength);

            clearRadioCoreEvents(radio_);
            radio_->PACKETPTR =
                static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&txPacket_[0]));
            radio_->SHORTS =
                ((RADIO_SHORTS_TXREADY_START_Enabled << RADIO_SHORTS_TXREADY_START_Pos) &
                 RADIO_SHORTS_TXREADY_START_Msk) |
                ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
                 RADIO_SHORTS_PHYEND_DISABLE_Msk);

            const uint32_t txFollowTriggerTargetUs =
                followRxEndTimestampUs + kBleConnTxenAfterRxUs;
            uint32_t txFollowTriggerNowUs = micros();
            while (!timeReachedUs(txFollowTriggerNowUs, txFollowTriggerTargetUs)) {
              txFollowTriggerNowUs = micros();
            }
            radio_->TASKS_TXEN = RADIO_TASKS_TXEN_TASKS_TXEN_Trigger;

            const uint32_t txFollowEndBudgetUs = kBleConnTxDisableWaitUs + 1200U;
            const bool txFollowEndSeen =
                waitRadioEndBudgeted(radio_, txFollowEndBudgetUs, spinLimit / 2U + 1U);
            bool txFollowOk = false;
            if (txFollowEndSeen) {
              txFollowOk =
                  waitRadioDisabledBudgeted(radio_, kBleConnTxDisableWaitUs,
                                            spinLimit / 2U + 1U);
            }
            if (!txFollowOk) {
              radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
              waitRadioDisabledBudgeted(radio_, kBleConnTxDisableWaitUs,
                                        spinLimit / 2U + 1U);
            }
            radio_->SHORTS = 0U;
            if (txFollowOk) {
              connectionTxHistoryValid_ = true;
              connectionLastTxSn_ =
                  static_cast<uint8_t>((txPacket_[0] >> 3U) & 0x01U);
              ++encDebug_.followupStartEncRspTxOk;
            }
            lastTxOkForEncEnable = txFollowOk;

            if (followTerminate) {
              terminateInd = true;
            }
          }

          // We handled LL_START_ENC_REQ; don't keep listening in this event.
          break;
        }
      }

      // Re-arm RX for another follow-up packet in the same event.
      clearRadioCoreEvents(radio_);
      radio_->PACKETPTR =
          static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&rxPacket_[0]));
      radio_->SHORTS =
          ((RADIO_SHORTS_RXREADY_START_Enabled << RADIO_SHORTS_RXREADY_START_Pos) &
           RADIO_SHORTS_RXREADY_START_Msk) |
          ((RADIO_SHORTS_ADDRESS_RSSISTART_Enabled
            << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) &
           RADIO_SHORTS_ADDRESS_RSSISTART_Msk) |
          ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
           RADIO_SHORTS_PHYEND_DISABLE_Msk);
      radio_->TASKS_RXEN = RADIO_TASKS_RXEN_TASKS_RXEN_Trigger;
    }

    clearRadioCoreEvents(radio_);
  }

  // Fallback in case TX path did not run to completion in this event.
  derivePendingEncSessionKey();

  // Awaiting LL_START_ENC_RSP is latency-critical for the ACK path: transmit the
  // ACK first, then validate/decode the encrypted control PDU.
  if (!terminateInd &&
      deferAwaitingStartRspDecrypt &&
      !fastStartEncRspMatched &&
      packetIsNew &&
      connectionEncSessionValid_ &&
      connectionEncAwaitingStartRsp_) {
    uint8_t plaintext[kBleDataPduMaxPayload] = {0};
    uint8_t plaintextLen = 0U;
    const uint64_t rxCounter = connectionEncRxCounter_;
    bool decryptOk = bleCcmDecryptPayload(connectionEncSessionKey_, connectionEncIv_,
                                          rxCounter, connectionEncRxDirection_, hdr0,
                                          &rxPacket_[2], rxLengthRaw,
                                          plaintext, &plaintextLen);
    if (!decryptOk) {
      const uint8_t swappedRxDirection =
          static_cast<uint8_t>(connectionEncRxDirection_ ^ 0x01U);
      if (bleCcmDecryptPayload(connectionEncSessionKey_, connectionEncIv_,
                               rxCounter, swappedRxDirection, hdr0,
                               &rxPacket_[2], rxLengthRaw,
                               plaintext, &plaintextLen)) {
        decryptOk = true;
        connectionEncRxDirection_ = swappedRxDirection;
        connectionEncTxDirection_ = static_cast<uint8_t>(swappedRxDirection ^ 0x01U);
        connectionEncPrecomputedStartRspValid_ = false;
        connectionEncPrecomputedStartRspTxValid_ = false;
        emitBleTrace("ENC_DIR_SWAP");
      } else if (connectionEncAltKeyValid_ &&
                 bleCcmDecryptPayload(connectionEncSessionKeyAlt_, connectionEncIv_,
                                      rxCounter, connectionEncRxDirection_, hdr0,
                                      &rxPacket_[2], rxLengthRaw,
                                      plaintext, &plaintextLen)) {
        decryptOk = true;
        memcpy(connectionEncSessionKey_, connectionEncSessionKeyAlt_,
               sizeof(connectionEncSessionKey_));
        connectionEncAltKeyValid_ = false;
        connectionEncPrecomputedStartRspValid_ = false;
        connectionEncPrecomputedStartRspTxValid_ = false;
        emitBleTrace("ENC_KEY_SWAP");
      } else if (connectionEncAltKeyValid_ &&
                 bleCcmDecryptPayload(connectionEncSessionKeyAlt_, connectionEncIv_,
                                      rxCounter, swappedRxDirection, hdr0,
                                      &rxPacket_[2], rxLengthRaw,
                                      plaintext, &plaintextLen)) {
        decryptOk = true;
        memcpy(connectionEncSessionKey_, connectionEncSessionKeyAlt_,
               sizeof(connectionEncSessionKey_));
        connectionEncAltKeyValid_ = false;
        connectionEncRxDirection_ = swappedRxDirection;
        connectionEncTxDirection_ = static_cast<uint8_t>(swappedRxDirection ^ 0x01U);
        connectionEncPrecomputedStartRspValid_ = false;
        connectionEncPrecomputedStartRspTxValid_ = false;
        emitBleTrace("ENC_KEY_DIR_SWAP");
      }
    }

