lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
    if (!decryptOk) {
      terminateInd = true;
      terminateMicFailure = true;
      ++encDebug_.encRxMicFailCount;
      encDebug_.encRxLastMicFailHdr = hdr0;
      encDebug_.encRxLastMicFailLenRaw = rxLengthRaw;
      encDebug_.encRxLastMicFailDir = connectionEncRxDirection_;
      encDebug_.encRxLastMicFailCounterLo =
          static_cast<uint32_t>(rxCounter & 0xFFFFFFFFULL);
      emitBleTrace("ENC_RX_MIC_FAIL_POSTTX");
    } else {
      rxWasDecrypted = true;
      rxLength = plaintextLen;
      if (plaintextLen > 0U) {
        memcpy(&rxPacket_[2], plaintext, plaintextLen);
      }
      if (packetIsNew) {
        connectionEncRxCounter_ = (rxCounter + 1ULL) & kBleEncPacketCounterMask;
      }

      if ((llid == kBlePduLlControl) &&
          (rxLength >= 1U) &&
          (rxPacket_[2] == kBleLlCtrlStartEncRsp)) {
        // Keep procedure state unchanged here so the normal LL control
        // response path can queue/transmit final LL_START_ENC_RSP.
        emitBleTrace("LL_START_ENC_RSP_RX_POSTTX");
      }
    }
  }

  if (deferEncryptedDataDecrypt && !terminateInd && packetIsNew) {
    const uint64_t rxCounter = connectionEncRxCounter_;
    uint8_t plaintext[kBleDataPduMaxPayload] = {0};
    uint8_t plaintextLen = 0U;
    const bool decryptOk =
        bleCcmDecryptPayload(connectionEncSessionKey_, connectionEncIv_,
                            rxCounter, connectionEncRxDirection_, hdr0,
                            &rxPacket_[2], rxLengthRaw,
                            plaintext, &plaintextLen);

    if (!decryptOk) {
      terminateInd = true;
      terminateMicFailure = true;
      ++encDebug_.encRxMicFailCount;
      encDebug_.encRxLastMicFailHdr = hdr0;
      encDebug_.encRxLastMicFailLenRaw = rxLengthRaw;
      encDebug_.encRxLastMicFailDir = connectionEncRxDirection_;
      encDebug_.encRxLastMicFailCounterLo =
          static_cast<uint32_t>(rxCounter & 0xFFFFFFFFULL);
      emitBleTrace("ENC_RX_MIC_FAIL_POSTTX_DATA");
    } else {
      rxWasDecrypted = true;
      rxLength = plaintextLen;
      if (plaintextLen > 0U) {
        memcpy(&rxPacket_[2], plaintext, plaintextLen);
      }
      connectionEncRxCounter_ = (rxCounter + 1ULL) & kBleEncPacketCounterMask;
    }
  }

  encDebug_.encLastRxHdr = hdr0;
  encDebug_.encLastRxLenRaw = rxLengthRaw;
  encDebug_.encLastRxWasNew = packetIsNew ? 1U : 0U;
  encDebug_.encLastRxWasDecrypted = rxWasDecrypted ? 1U : 0U;
  encDebug_.encLastRxCounterLo =
      static_cast<uint32_t>(connectionEncRxCounter_ & 0xFFFFFFFFULL);

  if (packetIsNew && !terminateInd) {
    uint8_t deferredLlid = 0x01U;
    uint8_t deferredLength = 0U;
    const bool encryptionProcedureBusy =
        connectionEncSessionValid_ &&
        (connectionEncKeyDerivationPending_ ||
         connectionEncStartReqTxPending_ ||
         connectionEncAwaitingStartRsp_ ||
         connectionEncEnableTxOnNextEvent_ ||
         connectionEncStartReqPending_);

    if (connectionEncSessionValid_ &&
        connectionEncStartReqPending_ &&
        connectionEncStartReqTxPending_ &&
        !connectionEncAwaitingStartRsp_ &&
        !connectionPendingTxValid_) {
      connectionTxPayload_[0] = kBleLlCtrlStartEncReq;
      deferredLlid = kBlePduLlControl;
      deferredLength = 1U;
    } else if (!llControlHandledImmediate &&
        llid == kBlePduLlControl && rxLength >= 1U) {
      uint8_t responseLength = 0U;
      if (buildLlControlResponse(&rxPacket_[2], rxLength, connectionTxPayload_,
                                 &responseLength, &terminateInd) &&
          responseLength > 0U) {
        deferredLlid = kBlePduLlControl;
        deferredLength = responseLength;
      }
    } else if (!encryptionProcedureBusy &&
               llid == kBlePduDataStartOrComplete &&
               rxLength >= kBleL2capHeaderLen) {
      uint8_t responseLength = 0U;
      if (buildL2capResponse(&rxPacket_[2], rxLength, connectionTxPayload_,
                             &responseLength) &&
          responseLength > 0U) {
        deferredLlid = kBlePduDataStartOrComplete;
        deferredLength = responseLength;
      }
    }

    if ((deferredLength == 0U) &&
        !encryptionProcedureBusy &&
        !connectionEncStartReqTxPending_ &&
        !connectionEncAwaitingStartRsp_ &&
        !connectionEncStartReqPending_ &&
        connectionServiceChangedIndicationsEnabled_ &&
        connectionServiceChangedIndicationPending_ &&
        !connectionServiceChangedIndicationAwaitingConfirm_) {
      writeLe16(&connectionTxPayload_[0], 7U);
      writeLe16(&connectionTxPayload_[2], kBleL2capCidAtt);
      connectionTxPayload_[4] = kAttOpHandleValueInd;
      writeLe16(&connectionTxPayload_[5], kHandleGattServiceChangedValue);
      writeLe16(&connectionTxPayload_[7], 0x0001U);
      writeLe16(&connectionTxPayload_[9], 0xFFFFU);
      deferredLlid = kBlePduDataStartOrComplete;
      deferredLength = 11U;
      connectionServiceChangedIndicationPending_ = false;
      connectionServiceChangedIndicationAwaitingConfirm_ = true;
    }

    if ((deferredLength == 0U) &&
        !encryptionProcedureBusy &&
        !connectionEncStartReqTxPending_ &&
        !connectionEncAwaitingStartRsp_ &&
        !connectionEncStartReqPending_ &&
        connectionCustomNotificationPending_) {
      if (connectionCustomPendingCharIndex_ < customGattCharacteristicCount_) {
        BleCustomCharacteristicState& custom =
            customGattCharacteristics_[connectionCustomPendingCharIndex_];
        const bool modeEnabled = connectionCustomPendingIndication_
                                     ? (((custom.properties & kBleGattPropIndicate) != 0U) &&
                                        ((custom.cccdValue & 0x0002U) != 0U))
                                     : (((custom.properties & kBleGattPropNotify) != 0U) &&
                                        ((custom.cccdValue & 0x0001U) != 0U));
        const bool indicationFlowReady =
            !connectionServiceChangedIndicationAwaitingConfirm_ &&
            (connectionCustomIndicationAwaitingHandle_ == 0U);
        const bool canTransmit =
            modeEnabled &&
            (!connectionCustomPendingIndication_ || indicationFlowReady);
        if (canTransmit) {
          writeLe16(&connectionTxPayload_[0],
                    static_cast<uint16_t>(3U + custom.valueLength));
          writeLe16(&connectionTxPayload_[2], kBleL2capCidAtt);
          connectionTxPayload_[4] = connectionCustomPendingIndication_
                                        ? kAttOpHandleValueInd
                                        : kAttOpHandleValueNtf;
          writeLe16(&connectionTxPayload_[5], custom.valueHandle);
          if (custom.valueLength > 0U) {
            memcpy(&connectionTxPayload_[7], custom.value, custom.valueLength);
          }
          deferredLlid = kBlePduDataStartOrComplete;
          deferredLength = static_cast<uint8_t>(7U + custom.valueLength);
          if (connectionCustomPendingIndication_) {
            connectionCustomIndicationAwaitingHandle_ = custom.valueHandle;
          }
          connectionCustomNotificationPending_ = false;
          connectionCustomPendingCharIndex_ = 0xFFU;
          connectionCustomPendingIndication_ = false;
        } else if (!modeEnabled) {
          connectionCustomNotificationPending_ = false;
          connectionCustomPendingCharIndex_ = 0xFFU;
          connectionCustomPendingIndication_ = false;
        }
      } else {
        connectionCustomNotificationPending_ = false;
        connectionCustomPendingCharIndex_ = 0xFFU;
        connectionCustomPendingIndication_ = false;
      }
    }

    if ((deferredLength == 0U) &&
        !encryptionProcedureBusy &&
        !connectionEncStartReqTxPending_ &&
        !connectionEncAwaitingStartRsp_ &&
        !connectionEncStartReqPending_ &&
        connectionBatteryNotificationsEnabled_ &&
        connectionBatteryNotificationPending_) {
      writeLe16(&connectionTxPayload_[0], 4U);
      writeLe16(&connectionTxPayload_[2], kBleL2capCidAtt);
      connectionTxPayload_[4] = kAttOpHandleValueNtf;
      writeLe16(&connectionTxPayload_[5], kHandleBatteryLevelValue);
      connectionTxPayload_[7] = gapBatteryLevel_;
      deferredLlid = kBlePduDataStartOrComplete;
      deferredLength = 8U;
      connectionBatteryNotificationPending_ = false;
    }

    if (!terminateInd && deferredLength > 0U) {
      connectionPendingTxLlid_ = deferredLlid;
      connectionPendingTxLength_ = deferredLength;
      memcpy(connectionPendingTxPayload_, connectionTxPayload_, deferredLength);
      connectionPendingTxValid_ = true;
    }
  }

