lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  const bool scannable =
      (advPduType == static_cast<uint8_t>(BleAdvPduType::kAdvInd)) ||
      (advPduType == static_cast<uint8_t>(BleAdvPduType::kAdvScanInd));
  if (!scannable) {
    clearRadioCoreEvents(radio_);
    return true;
  }

  // Active scan request: [ScanA (local)] [AdvA (remote)]
  const bool scannerAddressRandom = (addressType_ == BleAddressType::kRandomStatic);
  txPacket_[0] = static_cast<uint8_t>(kBlePduScanReq |
                                      ((scannerAddressRandom ? 1U : 0U) << 6U) |
                                      ((advertiserAddressRandom ? 1U : 0U) << 7U));
  txPacket_[1] = 12U;
  memcpy(&txPacket_[2], address_, 6U);
  memcpy(&txPacket_[8], advPayload, 6U);

  clearRadioCoreEvents(radio_);
  radio_->PACKETPTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&txPacket_[0]));
  radio_->SHORTS =
      ((RADIO_SHORTS_TXREADY_START_Enabled << RADIO_SHORTS_TXREADY_START_Pos) &
       RADIO_SHORTS_TXREADY_START_Msk) |
      ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
       RADIO_SHORTS_PHYEND_DISABLE_Msk);

  const uint32_t txTriggerTargetUs = advEndUs + kBleConnTxenAfterRxUs;
  uint32_t txTriggerNowUs = micros();
  while (!timeReachedUs(txTriggerNowUs, txTriggerTargetUs)) {
    txTriggerNowUs = micros();
  }

  radio_->TASKS_TXEN = RADIO_TASKS_TXEN_TASKS_TXEN_Trigger;
  const bool txEndSeen = waitForEnd(spinLimit / 2U + 1U);
  bool txDisabled = false;
  if (txEndSeen) {
    txDisabled = waitDisabled(spinLimit / 2U + 1U);
  }
  if (!txDisabled) {
    radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
    txDisabled = waitDisabled(spinLimit / 2U + 1U);
  }
  radio_->SHORTS = 0U;
  if (!txDisabled) {
    clearRadioCoreEvents(radio_);
    return true;
  }

  // Wait for SCAN_RSP on the same channel.
  clearRadioCoreEvents(radio_);
  memset(rxPacket_, 0, sizeof(rxPacket_));
  radio_->PACKETPTR =
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&rxPacket_[0]));
  radio_->SHORTS =
      ((RADIO_SHORTS_RXREADY_START_Enabled << RADIO_SHORTS_RXREADY_START_Pos) &
       RADIO_SHORTS_RXREADY_START_Msk) |
      ((RADIO_SHORTS_ADDRESS_RSSISTART_Enabled
        << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) &
       RADIO_SHORTS_ADDRESS_RSSISTART_Msk) |
      ((RADIO_SHORTS_PHYEND_DISABLE_Enabled << RADIO_SHORTS_PHYEND_DISABLE_Pos) &
       RADIO_SHORTS_PHYEND_DISABLE_Msk);
  radio_->TASKS_RXEN = RADIO_TASKS_RXEN_TASKS_RXEN_Trigger;

  const bool rspEndSeen = waitRadioEndBudgeted(
      radio_, kBleScanRspListenMaxUs, scanRspListenSpinLimit);
  if (!rspEndSeen) {
    radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
    waitDisabled(spinLimit / 2U + 1U);
    radio_->SHORTS = 0U;
    clearRadioCoreEvents(radio_);
    return true;
  }

  bool rspDisabled = waitDisabled(spinLimit / 2U + 1U);
  if (!rspDisabled) {
    radio_->TASKS_DISABLE = RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger;
    rspDisabled = waitDisabled(spinLimit / 2U + 1U);
  }
  const uint32_t rspCrcStatus =
      (radio_->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk) >>
      RADIO_CRCSTATUS_CRCSTATUS_Pos;
  const bool rspCrcOk = (rspCrcStatus == RADIO_CRCSTATUS_CRCSTATUS_CRCOk);
  const int8_t rspRssi = radioRssiDbm(radio_);
  radio_->SHORTS = 0U;
  if (!rspDisabled || !rspCrcOk) {
    clearRadioCoreEvents(radio_);
    return true;
  }

  const uint8_t rspHeader = rxPacket_[0];
  const uint8_t rspPduType = static_cast<uint8_t>(rspHeader & 0x0FU);
  const uint8_t rspPayloadLen = static_cast<uint8_t>(rxPacket_[1] & 0x3FU);
  const bool rspAddrRandom = ((rspHeader >> 6U) & 0x1U) != 0U;
  const uint8_t* rspPayload = &rxPacket_[2];

  const bool looksLikeMatchingScanRsp =
      (rspPduType == kBlePduScanRsp) &&
      (rspPayloadLen >= 6U) &&
      (rspAddrRandom == advertiserAddressRandom) &&
      bleAddressEqual(rspPayload, advPayload);
  if (looksLikeMatchingScanRsp && (result != nullptr)) {
    const uint8_t copyRspLen =
        (rspPayloadLen <= static_cast<uint8_t>(sizeof(result->scanRspPayload)))
            ? rspPayloadLen
            : static_cast<uint8_t>(sizeof(result->scanRspPayload));
    result->scanResponseReceived = true;
    result->scanRspRssiDbm = rspRssi;
    result->scanRspHeader = rspHeader;
    result->scanRspPayloadLength = copyRspLen;
    if (copyRspLen > 0U) {
      memcpy(result->scanRspPayload, rspPayload, copyRspLen);
    }
  }

  clearRadioCoreEvents(radio_);
  return true;
}

bool BleRadio::scanActiveCycle(BleActiveScanResult* result,
                               uint32_t perChannelAdvListenSpinLimit,
                               uint32_t scanRspListenSpinLimit) {
  static constexpr BleAdvertisingChannel kChannels[3] = {
      BleAdvertisingChannel::k37,
      BleAdvertisingChannel::k38,
      BleAdvertisingChannel::k39,
  };

  const uint32_t firstPassSpin = perChannelAdvListenSpinLimit;
  const uint32_t secondPassSpin =
      (perChannelAdvListenSpinLimit > 1U)
          ? (perChannelAdvListenSpinLimit / 2U)
          : perChannelAdvListenSpinLimit;

  for (uint8_t pass = 0U; pass < 2U; ++pass) {
    const uint32_t dwell = (pass == 0U) ? firstPassSpin : secondPassSpin;
    for (uint8_t i = 0U; i < 3U; ++i) {
      const uint8_t idx = static_cast<uint8_t>((scanCycleStartIndex_ + i) % 3U);
      if (scanActiveOnce(kChannels[idx], result, dwell, scanRspListenSpinLimit,
                         dwell + scanRspListenSpinLimit + 200000UL)) {
        scanCycleStartIndex_ = static_cast<uint8_t>((idx + 1U) % 3U);
        return true;
      }
    }
  }

  scanCycleStartIndex_ = static_cast<uint8_t>((scanCycleStartIndex_ + 1U) % 3U);
  return false;
}

bool BleRadio::handleRequestAndMaybeRespond(BleAdvertisingChannel channel,
                                            BleAdvInteraction* interaction,
                                            uint32_t requestListenSpinLimit,
                                            uint32_t spinLimit) {
  if (!initialized_ || radio_ == nullptr) {
    return false;
  }
  if (!setAdvertisingChannel(channel)) {
    return false;
  }

