lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
      const BleCustomCharacteristicState* characteristic =
          findCustomCharacteristicByValueHandle(handle);
      if (characteristic != nullptr) {
        if ((characteristic->properties & kBleGattPropRead) == 0U) {
          return kAttrReadNotPermittedLen;
        }
        if (characteristic->valueLength > 0U) {
          memcpy(&fullValue[0], characteristic->value, characteristic->valueLength);
        }
        fullLen = characteristic->valueLength;
        break;
      }

      characteristic = findCustomCharacteristicByCccdHandle(handle);
      if (characteristic != nullptr) {
        writeLe16(&fullValue[0], characteristic->cccdValue);
        fullLen = 2U;
        break;
      }

      for (uint8_t i = 0U; i < customGattCharacteristicCount_; ++i) {
        const BleCustomCharacteristicState& candidate = customGattCharacteristics_[i];
        if (candidate.declarationHandle != handle) {
          continue;
        }
        fullValue[0] = candidate.properties;
        writeLe16(&fullValue[1], candidate.valueHandle);
        const uint8_t uuidLength = customUuidLength(candidate.uuid.length);
        if (uuidLength == 0U) {
          return kAttrReadInvalidHandleLen;
        }
        memcpy(&fullValue[3], candidate.uuid.bytes, uuidLength);
        fullLen = static_cast<uint8_t>(3U + uuidLength);
        break;
      }
      if (fullLen == 0U) {
        return kAttrReadInvalidHandleLen;
      }
      break;
    }
  }

  if (offset > fullLen) {
    return kAttrReadInvalidOffsetLen;
  }
  const uint8_t remaining = static_cast<uint8_t>(fullLen - offset);
  const uint8_t toCopy = minU8(remaining, maxLen);
  if (toCopy > 0U) {
    memcpy(outValue, &fullValue[offset], toCopy);
  }
  return toCopy;
}

bool BleRadio::buildAttResponse(const uint8_t* attRequest, uint16_t requestLength,
                                uint8_t* outAttResponse,
                                uint16_t* outAttResponseLength) {
  if (attRequest == nullptr || outAttResponse == nullptr ||
      outAttResponseLength == nullptr || requestLength == 0U) {
    return false;
  }

  const uint16_t maxAttResponseLen = minU16(
      connectionAttMtu_, static_cast<uint16_t>(kBleDataPduMaxPayload - kBleL2capHeaderLen));
  if (maxAttResponseLen < 1U) {
    return false;
  }
  const uint8_t maxAttValueLen =
      static_cast<uint8_t>((maxAttResponseLen > 1U) ? (maxAttResponseLen - 1U) : 0U);

  const uint8_t opcode = attRequest[0];
  *outAttResponseLength = 0U;
  auto clearPreparedWrite = [&]() {
    connectionPreparedWriteActive_ = false;
    connectionPreparedWriteHandle_ = 0U;
    connectionPreparedWriteValue_[0] = 0U;
    connectionPreparedWriteValue_[1] = 0U;
    connectionPreparedWriteMask_ = 0U;
  };
  auto applyCccdState = [&](uint16_t handle, uint16_t cccd) -> bool {
    if (handle == kHandleGattServiceChangedCccd) {
      if ((cccd & ~0x0002U) != 0U) {
        return false;
      }
      const bool enableIndication = ((cccd & 0x0002U) != 0U);
      if (enableIndication && !connectionServiceChangedIndicationsEnabled_) {
        connectionServiceChangedIndicationPending_ = true;
      }
      if (!enableIndication) {
        connectionServiceChangedIndicationPending_ = false;
        connectionServiceChangedIndicationAwaitingConfirm_ = false;
      }
      connectionServiceChangedIndicationsEnabled_ = enableIndication;
      return true;
    }
    if (handle == kHandleBatteryLevelCccd) {
      if ((cccd & ~0x0001U) != 0U) {
        return false;
      }
      const bool enableNotify = ((cccd & 0x0001U) != 0U);
      connectionBatteryNotificationsEnabled_ = enableNotify;
      connectionBatteryNotificationPending_ = enableNotify;
      return true;
    }

    BleCustomCharacteristicState* custom = findCustomCharacteristicByCccdHandle(handle);
    if (custom == nullptr) {
      return false;
    }

    uint16_t allowedMask = 0U;
    if ((custom->properties & kBleGattPropNotify) != 0U) {
      allowedMask |= 0x0001U;
    }
    if ((custom->properties & kBleGattPropIndicate) != 0U) {
      allowedMask |= 0x0002U;
    }
    if (allowedMask == 0U || ((cccd & ~allowedMask) != 0U)) {
      return false;
    }

    custom->cccdValue = cccd;
    if (((custom->cccdValue & 0x0002U) == 0U) &&
        (connectionCustomIndicationAwaitingHandle_ == custom->valueHandle)) {
      connectionCustomIndicationAwaitingHandle_ = 0U;
    }
    if (connectionCustomNotificationPending_) {
      const uint8_t pendingIndex = connectionCustomPendingCharIndex_;
      if (pendingIndex < customGattCharacteristicCount_ &&
          (&customGattCharacteristics_[pendingIndex] == custom)) {
        const bool pendingEnabled =
            connectionCustomPendingIndication_
                ? ((custom->cccdValue & 0x0002U) != 0U)
                : ((custom->cccdValue & 0x0001U) != 0U);
        if (!pendingEnabled) {
          connectionCustomNotificationPending_ = false;
          connectionCustomPendingCharIndex_ = 0xFFU;
          connectionCustomPendingIndication_ = false;
        }
      }
    }
    return true;
  };

  switch (opcode) {
    case kAttOpExchangeMtuReq: {
      if (requestLength < 3U) {
        return buildAttErrorResponse(opcode, 0U, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }

      const uint16_t clientRxMtu = readLe16(&attRequest[1]);
      const uint16_t serverRxMtu =
          minU16(kBleDefaultAttMtu,
                 static_cast<uint16_t>(kBleDataPduMaxPayload - kBleL2capHeaderLen));
      const uint16_t negotiatedMtu = minU16(clientRxMtu, serverRxMtu);
      connectionAttMtu_ = (negotiatedMtu >= 23U) ? negotiatedMtu : 23U;

      outAttResponse[0] = kAttOpExchangeMtuRsp;
      writeLe16(&outAttResponse[1], serverRxMtu);
      *outAttResponseLength = 3U;
      return true;
    }

    case kAttOpFindInfoReq: {
      if (requestLength < 5U) {
        return buildAttErrorResponse(opcode, 0U, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }

