lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
      const uint16_t rawStart = readLe16(&attRequest[1]);
      const uint16_t end = readLe16(&attRequest[3]);
      if (rawStart == 0U || rawStart > end) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidHandle, outAttResponse,
                                     outAttResponseLength);
      }
      const uint16_t start = rawStart;

      outAttResponse[0] = kAttOpFindInfoRsp;
      outAttResponse[1] = 0U;
      uint16_t used = 2U;
      uint8_t responseFormat = 0U;
      uint16_t recordCount = 0U;
      bool stopFindInfo = false;
      for (size_t i = 0; i < (sizeof(kBleAttributeUuids) / sizeof(kBleAttributeUuids[0]));
           ++i) {
        const BleAttributeUuidRecord& record = kBleAttributeUuids[i];
        if (!inHandleRange(record.handle, start, end)) {
          continue;
        }
        if (responseFormat == kAttFindInfoFormat128Bit) {
          break;
        }
        if ((used + 4U) > maxAttResponseLen) {
          break;
        }
        responseFormat = kAttFindInfoFormat16Bit;
        outAttResponse[1] = responseFormat;
        writeLe16(&outAttResponse[used], record.handle);
        writeLe16(&outAttResponse[used + 2U], record.uuid16);
        used += 4U;
        ++recordCount;
      }
      for (uint8_t i = 0U;
           (i < customGattServiceCount_) && !stopFindInfo; ++i) {
        const BleCustomServiceState& service = customGattServices_[i];
        if (inHandleRange(service.serviceHandle, start, end)) {
          if (responseFormat == kAttFindInfoFormat128Bit || (used + 4U) > maxAttResponseLen) {
            break;
          }
          responseFormat = kAttFindInfoFormat16Bit;
          outAttResponse[1] = responseFormat;
          writeLe16(&outAttResponse[used], service.serviceHandle);
          writeLe16(&outAttResponse[used + 2U], kUuidPrimaryService);
          used += 4U;
          ++recordCount;
        }
        for (uint8_t j = 0U;
             j < customGattCharacteristicCount_; ++j) {
          const BleCustomCharacteristicState& ch = customGattCharacteristics_[j];
          if (ch.serviceHandle != service.serviceHandle) {
            continue;
          }
          if (inHandleRange(ch.declarationHandle, start, end)) {
            if (responseFormat == kAttFindInfoFormat128Bit ||
                (used + 4U) > maxAttResponseLen) {
              break;
            }
            responseFormat = kAttFindInfoFormat16Bit;
            outAttResponse[1] = responseFormat;
            writeLe16(&outAttResponse[used], ch.declarationHandle);
            writeLe16(&outAttResponse[used + 2U], kUuidCharacteristic);
            used += 4U;
            ++recordCount;
          }
          if (inHandleRange(ch.valueHandle, start, end)) {
            const uint8_t uuidLength = customUuidLength(ch.uuid.length);
            const uint8_t nextFormat =
                (uuidLength == kBleUuidLength128) ? kAttFindInfoFormat128Bit
                                                  : kAttFindInfoFormat16Bit;
            const uint16_t recordLen = static_cast<uint16_t>(2U + uuidLength);
            if (uuidLength == 0U) {
              stopFindInfo = true;
              break;
            }
            if ((responseFormat != 0U && responseFormat != nextFormat) ||
                (used + recordLen) > maxAttResponseLen) {
              stopFindInfo = true;
              break;
            }
            responseFormat = nextFormat;
            outAttResponse[1] = responseFormat;
            writeLe16(&outAttResponse[used], ch.valueHandle);
            memcpy(&outAttResponse[used + 2U], ch.uuid.bytes, uuidLength);
            used += recordLen;
            ++recordCount;
          }
          if (ch.cccdHandle != 0U &&
              inHandleRange(ch.cccdHandle, start, end)) {
            if (responseFormat == kAttFindInfoFormat128Bit ||
                (used + 4U) > maxAttResponseLen) {
              stopFindInfo = true;
              break;
            }
            responseFormat = kAttFindInfoFormat16Bit;
            outAttResponse[1] = responseFormat;
            writeLe16(&outAttResponse[used], ch.cccdHandle);
            writeLe16(&outAttResponse[used + 2U], kUuidClientCharacteristicConfig);
            used += 4U;
            ++recordCount;
          }
        }
      }

      if (recordCount == 0U) {
        return buildAttErrorResponse(opcode, start, kAttErrAttributeNotFound,
                                     outAttResponse, outAttResponseLength);
      }
      *outAttResponseLength = used;
      return true;
    }

    case kAttOpFindByTypeValueReq: {
      if (requestLength < 9U) {
        return buildAttErrorResponse(opcode, 0U, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }

      const uint16_t rawStart = readLe16(&attRequest[1]);
      const uint16_t end = readLe16(&attRequest[3]);
      const uint16_t attrType = readLe16(&attRequest[5]);
      if (rawStart == 0U || rawStart > end) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidHandle,
                                     outAttResponse, outAttResponseLength);
      }

      const uint8_t valueLen = static_cast<uint8_t>(requestLength - 7U);
      if (attrType != kUuidPrimaryService ||
          (valueLen != kBleUuidLength16 && valueLen != kBleUuidLength128)) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrAttributeNotFound,
                                     outAttResponse, outAttResponseLength);
      }
      outAttResponse[0] = kAttOpFindByTypeValueRsp;
      uint16_t used = 1U;
      const uint16_t maxRecords = static_cast<uint16_t>((maxAttResponseLen - 1U) / 4U);
      uint16_t recordCount = 0U;
      for (size_t i = 0; i < (sizeof(kBlePrimaryServices) / sizeof(kBlePrimaryServices[0]));
           ++i) {
        const BlePrimaryServiceRecord& service = kBlePrimaryServices[i];
        if (valueLen != kBleUuidLength16 || service.uuid16 != readLe16(&attRequest[7])) {
          continue;
        }
        if (!inHandleRange(service.startHandle, rawStart, end)) {
          continue;
        }
        if (recordCount >= maxRecords) {
          break;
        }
        writeLe16(&outAttResponse[used], service.startHandle);
        writeLe16(&outAttResponse[used + 2U], service.endHandle);
        used += 4U;
        ++recordCount;
      }
      for (uint8_t i = 0U;
           (i < customGattServiceCount_) && (recordCount < maxRecords); ++i) {
        const BleCustomServiceState& service = customGattServices_[i];
        if (!customUuidMatchesRaw(service.uuid.bytes, service.uuid.length, &attRequest[7],
                                  valueLen)) {
          continue;
        }
        if (!inHandleRange(service.serviceHandle, rawStart, end)) {
          continue;
        }
        writeLe16(&outAttResponse[used], service.serviceHandle);
        writeLe16(&outAttResponse[used + 2U], service.endHandle);
        used += 4U;
        ++recordCount;
      }

      if (recordCount == 0U) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrAttributeNotFound,
                                     outAttResponse, outAttResponseLength);
      }
      *outAttResponseLength = used;
      return true;
    }

    case kAttOpReadByGroupTypeReq: {
      if (requestLength < 7U) {
        return buildAttErrorResponse(opcode, 0U, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }

