lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
      const uint16_t rawStart = readLe16(&attRequest[1]);
      const uint16_t end = readLe16(&attRequest[3]);
      if (rawStart == 0U || rawStart > end) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidHandle,
                                     outAttResponse, outAttResponseLength);
      }

      const uint16_t groupTypeLen = static_cast<uint16_t>(requestLength - 5U);
      if (groupTypeLen != 2U) {
        if (groupTypeLen == 16U) {
          return buildAttErrorResponse(opcode, rawStart, kAttErrUnsupportedGroupType,
                                       outAttResponse, outAttResponseLength);
        }
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidPdu,
                                     outAttResponse, outAttResponseLength);
      }

      const uint16_t start = rawStart;
      const uint16_t groupType = readLe16(&attRequest[5]);
      if (groupType != kUuidPrimaryService) {
        return buildAttErrorResponse(opcode, start, kAttErrUnsupportedGroupType,
                                     outAttResponse, outAttResponseLength);
      }

      outAttResponse[0] = kAttOpReadByGroupTypeRsp;
      outAttResponse[1] = 0U;
      uint16_t used = 2U;
      uint8_t entryLen = 0U;
      uint16_t recordCount = 0U;
      for (size_t i = 0; i < (sizeof(kBlePrimaryServices) / sizeof(kBlePrimaryServices[0]));
           ++i) {
        const BlePrimaryServiceRecord& service = kBlePrimaryServices[i];
        if (!inHandleRange(service.startHandle, start, end)) {
          continue;
        }
        if (entryLen == 0U) {
          entryLen = 6U;
          outAttResponse[1] = entryLen;
        } else if (entryLen != 6U) {
          break;
        }
        if ((used + entryLen) > maxAttResponseLen) {
          break;
        }
        writeLe16(&outAttResponse[used], service.startHandle);
        writeLe16(&outAttResponse[used + 2U], service.endHandle);
        writeLe16(&outAttResponse[used + 4U], service.uuid16);
        used += 6U;
        ++recordCount;
      }
      for (uint8_t i = 0U;
           i < customGattServiceCount_; ++i) {
        const BleCustomServiceState& service = customGattServices_[i];
        if (!inHandleRange(service.serviceHandle, start, end)) {
          continue;
        }
        const uint8_t uuidLength = customUuidLength(service.uuid.length);
        const uint8_t candidateEntryLen =
            uuidLength == 0U ? 0U : static_cast<uint8_t>(4U + uuidLength);
        if (candidateEntryLen == 0U) {
          break;
        }
        if (entryLen == 0U) {
          entryLen = candidateEntryLen;
          outAttResponse[1] = entryLen;
        } else if (candidateEntryLen != entryLen) {
          break;
        }
        if ((used + entryLen) > maxAttResponseLen) {
          break;
        }
        writeLe16(&outAttResponse[used], service.serviceHandle);
        writeLe16(&outAttResponse[used + 2U], service.endHandle);
        memcpy(&outAttResponse[used + 4U], service.uuid.bytes, uuidLength);
        used += entryLen;
        ++recordCount;
      }

      if (recordCount == 0U) {
        return buildAttErrorResponse(opcode, start, kAttErrAttributeNotFound,
                                     outAttResponse, outAttResponseLength);
      }
      *outAttResponseLength = used;
      return true;
    }

    case kAttOpReadByTypeReq: {
      if (requestLength < 7U) {
        return buildAttErrorResponse(opcode, 0U, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }

      const uint16_t rawStart = readLe16(&attRequest[1]);
      const uint16_t end = readLe16(&attRequest[3]);
      if (rawStart == 0U || rawStart > end) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidHandle, outAttResponse,
                                     outAttResponseLength);
      }
      const uint16_t start = rawStart;
      const uint8_t typeLength = static_cast<uint8_t>(requestLength - 5U);
      if (typeLength != kBleUuidLength16 && typeLength != kBleUuidLength128) {
        return buildAttErrorResponse(opcode, rawStart, kAttErrInvalidPdu, outAttResponse,
                                     outAttResponseLength);
      }
      const uint16_t type16 =
          (typeLength == kBleUuidLength16) ? readLe16(&attRequest[5]) : 0U;

      outAttResponse[0] = kAttOpReadByTypeRsp;
      uint16_t used = 2U;
      uint8_t entryLen = 0U;
      uint16_t recordCount = 0U;

      if (typeLength == kBleUuidLength16 && type16 == kUuidCharacteristic) {
        for (size_t i = 0; i < (sizeof(kBleCharacteristics) / sizeof(kBleCharacteristics[0]));
             ++i) {
          const BleCharacteristicRecord& ch = kBleCharacteristics[i];
          if (!inHandleRange(ch.declarationHandle, start, end)) {
            continue;
          }
          const uint8_t candidateEntryLen = 7U;
          if (entryLen == 0U) {
            entryLen = candidateEntryLen;
            outAttResponse[1] = entryLen;
          } else if (candidateEntryLen != entryLen) {
            break;
          }
          if ((used + entryLen) > maxAttResponseLen) {
            break;
          }
          writeLe16(&outAttResponse[used], ch.declarationHandle);
          outAttResponse[used + 2U] = ch.properties;
          writeLe16(&outAttResponse[used + 3U], ch.valueHandle);
          writeLe16(&outAttResponse[used + 5U], ch.uuid16);
          used += entryLen;
          ++recordCount;
        }
        for (uint8_t i = 0U;
             i < customGattCharacteristicCount_; ++i) {
          const BleCustomCharacteristicState& ch = customGattCharacteristics_[i];
          if (!inHandleRange(ch.declarationHandle, start, end)) {
            continue;
          }
          const uint8_t uuidLength = customUuidLength(ch.uuid.length);
          const uint8_t candidateEntryLen = customCharacteristicDeclarationValueLength(
              ch.uuid.length);
          if (uuidLength == 0U || candidateEntryLen == 0U) {
            break;
          }
          const uint8_t responseEntryLen = static_cast<uint8_t>(2U + candidateEntryLen);
          if (entryLen == 0U) {
            entryLen = responseEntryLen;
            outAttResponse[1] = entryLen;
          } else if (responseEntryLen != entryLen) {
            break;
          }
          if ((used + entryLen) > maxAttResponseLen) {
            break;
          }
          writeLe16(&outAttResponse[used], ch.declarationHandle);
          outAttResponse[used + 2U] = ch.properties;
          writeLe16(&outAttResponse[used + 3U], ch.valueHandle);
          memcpy(&outAttResponse[used + 5U], ch.uuid.bytes, uuidLength);
          used += entryLen;
          ++recordCount;
        }
      } else if (typeLength == kBleUuidLength16 && type16 == kUuidPrimaryService) {
        for (size_t i = 0; i < (sizeof(kBlePrimaryServices) / sizeof(kBlePrimaryServices[0]));
             ++i) {
          const BlePrimaryServiceRecord& service = kBlePrimaryServices[i];
          if (!inHandleRange(service.startHandle, start, end)) {
            continue;
          }
          const uint8_t candidateEntryLen = 4U;
          if (entryLen == 0U) {
            entryLen = candidateEntryLen;
            outAttResponse[1] = entryLen;
          } else if (candidateEntryLen != entryLen) {
            break;
          }
          if ((used + entryLen) > maxAttResponseLen) {
            break;
          }
          writeLe16(&outAttResponse[used], service.startHandle);
          writeLe16(&outAttResponse[used + 2U], service.uuid16);
          used += entryLen;
          ++recordCount;
        }
        for (uint8_t i = 0U;
             i < customGattServiceCount_; ++i) {
          const BleCustomServiceState& service = customGattServices_[i];
          if (!inHandleRange(service.serviceHandle, start, end)) {
            continue;
          }
          const uint8_t uuidLength = customUuidLength(service.uuid.length);
          const uint8_t responseEntryLen =
              uuidLength == 0U ? 0U : static_cast<uint8_t>(2U + uuidLength);
          if (responseEntryLen == 0U) {
            break;
          }
          if (entryLen == 0U) {
            entryLen = responseEntryLen;
            outAttResponse[1] = entryLen;
          } else if (responseEntryLen != entryLen) {
            break;
          }
          if ((used + entryLen) > maxAttResponseLen) {
            break;
          }
          writeLe16(&outAttResponse[used], service.serviceHandle);
          memcpy(&outAttResponse[used + 2U], service.uuid.bytes, uuidLength);
          used += entryLen;
          ++recordCount;
        }
      } else {
        uint16_t handles[6] = {0U, 0U, 0U, 0U, 0U, 0U};
        uint8_t handleCount = 0U;
        if (typeLength == kBleUuidLength16 && type16 == kUuidDeviceName) {
          handles[handleCount++] = kHandleGapDeviceNameValue;
        } else if (typeLength == kBleUuidLength16 && type16 == kUuidAppearance) {
          handles[handleCount++] = kHandleGapAppearanceValue;
        } else if (typeLength == kBleUuidLength16 && type16 == kUuidPpcp) {
          handles[handleCount++] = kHandleGapPpcpValue;
        } else if (typeLength == kBleUuidLength16 && type16 == kUuidServiceChanged) {
          handles[handleCount++] = kHandleGattServiceChangedValue;
        } else if (typeLength == kBleUuidLength16 &&
                   type16 == kUuidClientCharacteristicConfig) {
          handles[handleCount++] = kHandleGattServiceChangedCccd;
          handles[handleCount++] = kHandleBatteryLevelCccd;
        } else if (typeLength == kBleUuidLength16 && type16 == kUuidBatteryLevel) {
          handles[handleCount++] = kHandleBatteryLevelValue;
        }

        for (uint8_t i = 0U; i < handleCount; ++i) {
          const uint16_t handle = handles[i];
          if (!inHandleRange(handle, start, end)) {
            continue;
          }
          uint8_t temp[31] = {0};
          const uint8_t vlen = readAttributeValue(handle, 0U, temp, maxAttValueLen);
          if (vlen == kAttrReadInvalidHandleLen || vlen == kAttrReadInvalidOffsetLen) {
            continue;
          }

          const uint8_t candidateEntryLen = static_cast<uint8_t>(2U + vlen);
          if (candidateEntryLen == 2U) {
            continue;
          }
          if (entryLen == 0U) {
            entryLen = candidateEntryLen;
            outAttResponse[1] = entryLen;
          } else if (candidateEntryLen != entryLen) {
            break;
          }
          if ((used + entryLen) > maxAttResponseLen) {
            break;
          }

          writeLe16(&outAttResponse[used], handle);
          if (vlen > 0U) {
            memcpy(&outAttResponse[used + 2U], temp, vlen);
          }
          used += entryLen;
          ++recordCount;
        }

