lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.cpp
  switch (smpCode) {
    case kSmpCodePairingRequest: {
      if (smpLength != kSmpPairingRequestLen) {
        return buildSmpPairingFailed(kSmpReasonInvalidParameters);
      }

      const uint8_t oobFlag = smp[2];
      const uint8_t maxKeySize = smp[4];
      if (oobFlag != 0x00U) {
        return buildSmpPairingFailed(kSmpReasonOobNotAvailable);
      }
      if (maxKeySize < 7U || maxKeySize > 16U) {
        return buildSmpPairingFailed(kSmpReasonEncryptionKeySize);
      }

      const bool replacingPrimedBond = bondKeyPrimedForConnection_;
      clearConnectionSecurityState();
      if (replacingPrimedBond && bondRecordValid_) {
        // Peer explicitly started a new pairing procedure; drop the prior
        // bonded key so this connection re-establishes security state cleanly.
        clearBondRecord(true);
        emitBleTrace("BOND_REPLACED");
      }
      memcpy(smpPairingReq_, smp, kSmpPairingRequestLen);
      smpPairingRsp_[0] = kSmpCodePairingResponse;
      smpPairingRsp_[1] = kSmpIoCapNoInputNoOutput;
      smpPairingRsp_[2] = 0x00U;
      const uint8_t peerBonding = smp[3] & kSmpAuthReqBondingMask;
      smpPairingRsp_[3] = (peerBonding != 0U) ? 0x01U : 0x00U;
      smpBondingRequested_ = (peerBonding != 0U);
      smpPairingRsp_[4] = maxKeySize;
      smpPairingRsp_[5] = smpBondingRequested_
                              ? static_cast<uint8_t>(smp[5] & kSmpKeyDistEncKeyMask)
                              : 0x00U;
      smpPairingRsp_[6] = 0x00U;
      smpExpectInitiatorEncKey_ = ((smpPairingRsp_[5] & kSmpKeyDistEncKeyMask) != 0U);
      smpKeySize_ = maxKeySize;

      // Precompute local confirm material here so confirm/random stages avoid
      // repeated AES work while servicing tight connection events.
      const uint32_t seed = micros() ^ connectionAccessAddress_ ^
                            static_cast<uint32_t>(connectionEventCounter_ << 16U);
      fillPseudoRandomBytes(smpLocalRandom_, sizeof(smpLocalRandom_), seed);
      const uint8_t tk[16] = {0};
      const uint8_t iat = connectionPeerAddressRandom_ ? 0x01U : 0x00U;
      const uint8_t rat =
          (addressType_ == BleAddressType::kRandomStatic) ? 0x01U : 0x00U;
      if (!smpC1(tk, smpLocalRandom_, smpPairingReq_, smpPairingRsp_, iat,
                 connectionPeerAddress_, rat, address_, smpLocalConfirm_)) {
        return buildSmpPairingFailed(kSmpReasonUnspecified);
      }

      smpPairingState_ = kSmpPairingStateRspSent;
      emitBleTrace("SMP_PAIRING_REQUEST_RX");
      return buildSmpResponse(smpPairingRsp_, kSmpPairingResponseLen);
    }

    case kSmpCodePairingConfirm: {
      if (smpLength != kSmpPairingConfirmLen) {
        return buildSmpPairingFailed(kSmpReasonInvalidParameters);
      }
      if (smpPairingState_ != kSmpPairingStateRspSent) {
        return buildSmpPairingFailed(kSmpReasonUnspecified);
      }

      memcpy(smpPeerConfirm_, &smp[1], sizeof(smpPeerConfirm_));
      uint8_t localConfirm[17] = {0};
      localConfirm[0] = kSmpCodePairingConfirm;
      memcpy(&localConfirm[1], smpLocalConfirm_, sizeof(smpLocalConfirm_));
      smpPairingState_ = kSmpPairingStateConfirmSent;
      emitBleTrace("SMP_CONFIRM_RX");
      return buildSmpResponse(localConfirm, sizeof(localConfirm));
    }

    case kSmpCodePairingRandom: {
      if (smpLength != kSmpPairingRandomLen) {
        return buildSmpPairingFailed(kSmpReasonInvalidParameters);
      }
      if (smpPairingState_ != kSmpPairingStateConfirmSent) {
        return buildSmpPairingFailed(kSmpReasonUnspecified);
      }

      memcpy(smpPeerRandom_, &smp[1], sizeof(smpPeerRandom_));
      const uint8_t tk[16] = {0};
      const uint8_t iat = connectionPeerAddressRandom_ ? 0x01U : 0x00U;
      const uint8_t rat =
          (addressType_ == BleAddressType::kRandomStatic) ? 0x01U : 0x00U;
      uint8_t expectedRemoteConfirm[16] = {0};
      if (!smpC1(tk, smpPeerRandom_, smpPairingReq_, smpPairingRsp_, iat,
                 connectionPeerAddress_, rat, address_, expectedRemoteConfirm)) {
        return buildSmpPairingFailed(kSmpReasonUnspecified);
      }

      if (memcmp(expectedRemoteConfirm, smpPeerConfirm_, sizeof(smpPeerConfirm_)) != 0) {
        return buildSmpPairingFailed(kSmpReasonConfirmValueFailed);
      }

      // STK is derived from the initiator (peer) and responder (local) random values.
      if (!smpS1(tk, smpPeerRandom_, smpLocalRandom_, smpStk_)) {
        return buildSmpPairingFailed(kSmpReasonUnspecified);
      }
      smpStkValid_ = true;

      uint8_t localRandom[17] = {0};
      localRandom[0] = kSmpCodePairingRandom;
      memcpy(&localRandom[1], smpLocalRandom_, sizeof(smpLocalRandom_));
      smpPairingState_ = kSmpPairingStateRandomSent;
      emitBleTrace("SMP_RANDOM_RX");
      return buildSmpResponse(localRandom, sizeof(localRandom));
    }

    case kSmpCodeEncryptionInformation:
      if (smpLength != kSmpEncryptionInformationLen) {
        return buildSmpPairingFailed(kSmpReasonInvalidParameters);
      }
      if (!smpBondingRequested_ || !smpExpectInitiatorEncKey_ ||
          !connectionEncSessionValid_ || !connectionEncRxEnabled_) {
        return false;
      }
      memcpy(smpPeerLtk_, &smp[1], sizeof(smpPeerLtk_));
      smpPeerLtkValid_ = true;
      smpPeerLtkAwaitMasterId_ = true;
      emitBleTrace("SMP_ENC_INFO_RX");
      return false;

    case kSmpCodeMasterIdentification:
      if (smpLength != kSmpMasterIdentificationLen) {
        return buildSmpPairingFailed(kSmpReasonInvalidParameters);
      }
      if (!smpBondingRequested_ || !smpPeerLtkValid_ || !smpPeerLtkAwaitMasterId_) {
        return false;
      }
      smpEncReqEdiv_ = readLe16(&smp[1]);
      memcpy(smpEncReqRand_, &smp[3], sizeof(smpEncReqRand_));
      smpPeerLtkAwaitMasterId_ = false;
      {
        BleBondRecord record{};
        memcpy(record.peerAddress, connectionPeerAddress_, sizeof(record.peerAddress));
        record.peerAddressRandom = connectionPeerAddressRandom_ ? 1U : 0U;
        memcpy(record.localAddress, address_, sizeof(record.localAddress));
        record.localAddressRandom =
            (addressType_ == BleAddressType::kRandomStatic) ? 1U : 0U;
        memcpy(record.ltk, smpPeerLtk_, sizeof(record.ltk));
        memcpy(record.rand, smpEncReqRand_, sizeof(record.rand));
        record.ediv = smpEncReqEdiv_;
        record.keySize = (smpKeySize_ >= 7U && smpKeySize_ <= 16U) ? smpKeySize_ : 16U;
        persistBondRecord(record);
      }
      emitBleTrace("SMP_MASTER_ID_RX");
      return false;

